[
  {
    "source": "ESPN",
    "title": "WNBA Power Rankings: Best end-of-season scenarios for every team",
    "url": "https://www.espn.com/wnba/story/_/id/46131834/wnba-2025-power-rankings-best-case-scenarios-playoffs-seeding",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nWith 10 days left in the WNBA's 2025 regular season, we already know the No. 1 seed -- the Minnesota Lynx -- and four of the five teams that won't make the playoffs. But there are more important developments still to come.\n\nWhich teams will secure home-court advantage in the opening round as the 2-seed, the 3-seed and the 4-seed. And which opponents will they face? Can the Los Angeles Sparks climb into the playoff picture from the ninth position in the standings?\n\nEvery team has dealt with injuries over the course of the longest regular season in WNBA history, and we will soon learn how that impacts the postseason. For now, let's forecast the best-case scenario for each team over the final stretch.\n\nPrevious ranking: 1\n\nNext seven days: @ LV (Sept. 4), @ GS (Sept. 6)\n\nThe Lynx beat Seattle, Connecticut and Dallas across the past week to secure home-court advantage for as long as they're in the playoffs. While they could impact other teams' positioning -- especially Golden State, which they play twice -- there isn't much at stake in their last four games. So, their best case is historical: If the Lynx win out and finish 36-8, they will have an 81.8% winning rate for the regular season, the second best in franchise history behind 82.4% in 2016. And their 36 wins would be the most in WNBA history -- 34 by Las Vegas in the 40-game season of 2023 is the record -- though the four games added to this season's schedule would have to be considered.\n\nPrevious ranking: 2\n\nNext seven days: vs. MIN (Sept. 4), vs. CHI (Sept. 7)\n\nThe Aces tied a franchise record with their 12th straight victory on Wednesday, beating Atlanta for a 3-0 series sweep to give them the potential tiebreaker for the No. 2 seed. And they won the season series against Phoenix (3-1), as well, so the Aces also own that tiebreaker, if needed. With a full week to prepare for Minnesota on Thursday, the best case for Las Vegas is to win out to claim the No. 2 seed and establish a club-record winning streak.\n\nPrevious ranking: 3\n\nNext seven days: vs. LA (Sept. 3), vs. LA (Sept. 5), vs. CON (Sept. 8)\n\nComing off a loss to Las Vegas and a triumph over Dallas, the Dream welcomed point guard Jordin Canada back from a hamstring injury in Monday's victory at Connecticut. Best case, they win out and Las Vegas loses one of its final four games to give the Dream the No. 2 seed. Atlanta owns the potential tiebreaker over Phoenix with a 3-0 season series sweep.\n\nplay 0:25 Jordin Canada spins in the air and gets the and-1 basket Jordin Canada spins in the air and gets the and-1 basket\n\nPrevious ranking: 4\n\nNext seven days: vs. IND (Sept. 2), @ WAS (Sept. 4), @ CON (Sept. 6)\n\nThe Mercury beat Los Angeles, Chicago and New York over the past week to win six of their past seven. Kahleah Copper has been limited to 23 games due to injuries, but she is playing well heading into the postseason, scoring 68 points in her last three games combined. The optimal outcome for Phoenix -- which has played one game less than Atlanta and Las Vegas -- is to win its last five while the Dream and the Aces each lose at least once to give the Mercury the No. 2 seed.\n\nPrevious ranking: 5\n\nNext seven days: @ GS (Sept. 2), @ SEA (Sept. 5)\n\nThe Liberty beat Washington and lost to Phoenix over the past week, which fits how hard it has been for New York to sustain momentum since late July, when Breanna Stewart suffered a right knee bone bruise that would sideline her for 13 games. She's back, but the Liberty still don't look like defending champions. While they are technically in the running for the 2-seed, a more realistic best-case scenario is climbing into the top four, though it won't be easy with three of their remaining four games on the road.\n\nPrevious ranking: 7\n\nNext seven days: vs. NY (Sept. 2), vs. DAL (Sept. 4), vs. MIN (Sept. 6)\n\nThe Valkyries beat Washington and Indiana over the past week to finish 8-5 in August, with all five losses coming to teams currently in the top four. They are 7-3 over their past 10 and are closing in on a playoff spot, but the Valkyries still have to play Minnesota twice. Mathematically, the Nos. 4 and 5 seeds are attainable but not probable. A more likely best case is the 6-seed, which would be excellent for an expansion franchise that many predicted wouldn't make the postseason.\n\nplay 1:08 Golden State Valkyries vs. Indiana Fever - Game Highlights Watch the Game Highlights from Golden State Valkyries vs. Indiana Fever, 08/31/2025\n\nPrevious ranking: 9\n\nNext seven days: @ PHO (Sept. 2), vs. Chi (Sept. 5), @ WAS (Sept. 7)\n\nThe Fever are still in playoff position despite running from the injury monster all season. They got crucial victories over Seattle and Los Angeles before losing at Golden State during the past week. But they aren't out of the woods yet; the Sparks could still catch them for the final playoff spot. The Fever could technically finish as high as No. 4, but it's unlikely they will win their final four games and the teams directly ahead of them will fall apart. A realistic best case for Indiana is the No. 6 seed -- and the return of Caitlin Clark for the postseason.\n\nPrevious ranking: 6\n\nNext seven days: vs. NY (Sept. 5)\n\nThe Storm really haven't handled prosperity well this season. After falling at Indiana before beating Minnesota and Chicago this past week, they lost a 17-point lead over Los Angeles on Monday to fall 91-85 at home. Seattle would have been closer to locking down a playoff position with a win; now it only has two games to do it. Best case, the Storm win both to finish .500 at home and enter the postseason with 24 victories.\n\nPrevious ranking: 8\n\nNext seven days: @ ATL (Sept. 3), @ ATL (Sept. 5), vs. DAL (Sept. 7)\n\nLos Angeles lost to Phoenix and Indiana then had to scramble to beat Washington over the past week. That set up Monday's key game at Seattle, in which the Storm appeared to have the upper hand until going ice-cold. The Sparks' 91-85 win keeps hope alive of ending their four-year playoff drought. They still have a lot of work to do with five games left, including three on the road. The Sparks have had one five-game winning streak (in July), but they must face Atlanta (twice), Phoenix and Las Vegas. The best case is winning four and hoping 23 victories will be enough to edge out Golden State, Indiana or Seattle.\n\nplay 0:24 Cameron Brink with the and-1 bucket Cameron Brink with the and-1 bucket\n\nPrevious ranking: 11\n\nNext seven days: vs. PHO (Sept. 4), vs. IND (Sept. 7)\n\nOver the past week, Connecticut beat Dallas before falling to Minnesota and Atlanta. Set to miss the playoffs for the first time since 2016 while facing uncertainty about whether the franchise will be sold, there isn't a real best-case scenario for the Sun. But they did win five games in the second half of August -- as many as they had won in the previous three months -- and they could finish 11th while playing spoiler to Atlanta's hopes for the No. 2 seed, as they still face the Dream twice.\n\nPrevious ranking: 10\n\nNext seven days: vs. PHO (Sept. 4), vs. IND (Sept. 7)\n\nThe playoffs were still a possibility for the Mystics in mid-August, but all the air has left that balloon. Washington is out of the postseason, which isn't surprising for a rebuilding team. The Mystics lost to New York, Golden State and Los Angeles over the past week, and they are on a seven-game skid. Best case, they end the losing streak in their last three games and Sonia Citron and Kiki Iriafen are named to the WNBA All-Rookie Team.\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nPrevious ranking: 12\n\nNext seven days: vs. CON (Sept. 3), @ IND (Sept. 5), @ LV (Sept. 7)\n\nThe Sky fell to Phoenix and Seattle last week, and they will be out of the postseason for the second year in a row. Chicago is 2-17 since the All-Star break and has a lot to figure out for the future. Best case, the Sky avoid last place and perhaps impact the order of the top four seeds, as they still have games left against Las Vegas (twice) and New York.\n\nPrevious ranking: 13\n\nNext seven days: @ GS (Sept. 4), @ LA (Sept. 7)\n\nThe Wings' only victory since July 30 was a one-point decision at Indiana on Aug. 12. They are in the midst of an eight-game losing streak, falling this past week to Connecticut, Atlanta and Minnesota. Best case, they will celebrate Paige Bueckers' impending Rookie of the Year Award and hope to win the draft lottery for a second consecutive No. 1 pick."
  },
  {
    "source": "ESPN",
    "title": "Sky suspend Angel Reese for a half for 'detrimental' comments",
    "url": "https://www.espn.com/wnba/story/_/id/46168942/sky-suspend-angel-reese-half-detrimental-comments",
    "date": "2025-09-07",
    "text": "Angel Reese says her language was taken out of context in an article in which she aired her frustrations amid a losing season for the Sky. (0:38)\n\nOpen Extended Reactions\n\nINDIANAPOLIS -- Chicago Sky star Angel Reese will be suspended for the first half of Sunday's game against the Las Vegas Aces for what the organization called \"statements detrimental to the team.\"\n\n\"The Chicago Sky values the safety, respect, and well-being of every player,\" the team said in a statement Friday. \"We are committed to accountability so our players can stay focused on playing basketball. This matter has been handled and resolved internally, and we are moving forward as a team.\"\n\nSky coach Tyler Marsh said before Friday's 97-77 loss to the Indiana Fever that the first-half suspension was an \"organizational decision\" that came from the \"top down.\"\n\n\"Just going to handle it internally, and that's kind of what it's been,\" Marsh said.\n\nReese also sat out Friday to serve a one-game suspension after receiving her eighth technical of the season Wednesday in Chicago's 88-64 win over the Connecticut Sun.\n\nShe said Wednesday that she apologized to her teammates for her comments that appeared in a Chicago Tribune article earlier this week.\n\nAmong her remarks, Reese told the Tribune she is \"not settling for the same s--- we did this year,\" adding that the team \"[has] to get great players\" this offseason or else she might consider moving on from it. The Sky (10-31) were eliminated from playoff contention last month.\n\nReese also expressed concern over the Sky's point guard situation, saying, \"We can't rely on Courtney [Vandersloot] to come back [from an ACL tear] at the age that she's at. I know she'll be a great asset for us, but we can't rely on that. We need someone, probably a little younger with some experience, somebody who's been playing the game and is willing to compete for a championship and has done it before.\"\n\nMarsh said Friday that he had spoken with Reese but declined to give details of the conversation, reiterating that \"the matter has been resolved, and we'd just like to focus on tonight.\"\n\nA two-time All-Star, Reese leads the WNBA with 12.6 rebounds per game and 23 double-doubles this season. She also averages a team-high 14.7 points and is tied for first with 3.7 assists."
  },
  {
    "source": "ESPN",
    "title": "Fantasy women's basketball: Boost your finals lineup with these picks",
    "url": "https://www.espn.com/fantasy/womens-basketball/story/_/id/46129039/fantasy-women-basketball-wavier-wire-wnba-rankings-finals",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nThe longest regular season in WNBA history concludes next week. Fantasy leagues will be decided in the coming days, adding to the significance of these final games.\n\nEven if your team -- real or fantasy -- isn't contending this deep into the season, there is value in identifying strong finishers around the league. The Connecticut SUN, for instance, have a rising rookie featured in the backcourt section below who could be a top fantasy force for the 2026 campaign.\n\nYour League, Your Rules Create a league and customize league size, scoring and rules to play in the league you want to play in. Create a league today!\n\nFocusing on individual production trends as well as matchup metrics, let's discuss players worth acquiring for these final nights of the season.\n\nBackcourt\n\nLeila Lacan, G, Connecticut Sun (Rostered in 34.5% of ESPN leagues): An awesome finish to her first run in the \"W\" has the arrow up for Lacan heading into next season. Not only has she shown an ability to score at a top level, but also create for others and get her hands on the ball defensively. The Sun will let her shine down the stretch.\n\nOdyssey Sims, G, Indiana Fever (28.3%): The savvy veteran has kept the Indiana offense organized amid a wave of impact injuries. Don't expect her to shine in the scoring department every night out, but enough production in each category should surface given Sims' major role for this Fever offense.\n\nFantasy Football Gridiron Gauntlet FREE to play. Become ESPN fantasy football's ultimate champ. Sign Up | Find out more\n\nTe-Hina Paopao, G, Atlanta Dream (6.3%): The return of Jordin Canada could slow down Paopao's momentum, but her recent rise is worthy of discussion. This combo guard has been a top creator for Atlanta the past two weeks, culminating in a brilliant performance against Dallas recently. If she can retain a real role in the rotation down the stretch, Paopao could help fantasy managers.\n\nKaila Charles, G, Golden State Valkyries (4.7%): With Tiffany Hayes sidelined and the team looking for potential rotation fixtures for next season, Charles has become a more important part of the rotation in recent weeks. With some scoring pop and atypically strong rebounding rates for a guard, Charles is in a nice spot to finish strong for what has been a fun first season for the franchise.\n\nFrontcourt\n\nMyisha Hines-Allen, F, Dallas Wings (27.0%): The long season has eroded the Wings' rotation, with Hines-Allen left as one of the frontcourt pillars the staff can trust. A recent surge in minutes, touches, and overall usage has resulted in strong production for the combo forward. Meanwhile, Dallas has one of the softer finishing schedules.\n\nIliana Rupert, C, Golden State Valkyries (15.5%): We included Rupert in this space last week given her ascent in the wake of several frontcourt injuries for Golden State. All she's done since is produce, as Rupert continues to produce a bankable bandwidth of fantasy production between 20 and 30 points when active. An inviting matchup with the Wings in a few nights helps offset meetings with the Liberty and Lynx."
  },
  {
    "source": "ESPN",
    "title": "How Clark's extended absence impacts Fever's WNBA playoffs",
    "url": "https://www.espn.com/wnba/story/_/id/46159102/wnba-2025-caitlin-clark-indiana-fever-ruled-season-miss-playoffs",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nThe Indiana Fever said Thursday that guard Caitlin Clark is out for the remainder of the 2025 WNBA season, missing the team's final three regular-season games and any potential postseason play. The announcement ended weeks of speculation about when Clark, who hasn't played since July 15 due to a right groin injury, would return -- a frustrating chapter for Clark and the Fever, who currently are the No. 8 seed for the WNBA playoffs.\n\nClark didn't miss a game during her four seasons at Iowa or her first season in the WNBA, when she won Rookie of the Year and led the league in assists and 3-pointers. But she has struggled to stay healthy throughout 2025, appearing in just 13 of Indiana's 41 games so far.\n\nThree different injuries forced her to miss the Commissioner's Cup final on July 1, won by the Fever over Minnesota; the All-Star Game, for which she was a captain for the contest in her home arena, Gainbridge Fieldhouse; and the final seven weeks of the season.\n\nWhat does it mean for the Fever and WNBA that Clark won't be in the playoffs? And what's next for the 23-year-old, who is one of the biggest stars in professional sports?\n\nAfter dealing with three separate injuries this season, Caitlin Clark ends 2025 having averaged 16.5 points, 8.8 assists, 5.0 rebounds and 1.6 steals in 13 games. Matthew Huang/Icon Sportswire\n\nHow does Thursday's news impact the rest of the Fever's season and playoff hopes going forward?\n\nThe Fever have been through so many injuries and new players added and subtracted this season that they've proved they just roll with the punches. And they won't be surprised by this news -- they're around Clark all the time and know how her recovery has been going. Despite all the difficulties, four Fever players have appeared in all 41 games: guards Kelsey Mitchell and Lexie Hull, and posts Aliyah Boston and Natasha Howard.\n\nThat's still a very good and experienced quartet of players to take into the postseason if the Fever can lock up their playoff berth. Mitchell and Boston are both averaging career highs in points, and Hull has career-high averages in points (7.2), rebounds (4.4) and assists (1.8). Howard is a three-time WNBA champion with Seattle (twice) and Minnesota.\n\nIn August, after season-ending injuries to guards Aari McDonald and Sydney Colson, the Fever added veteran guard Odyssey Sims. They also added Aerial Powers later in the month after Sophie Cunningham was lost for the season. Sims and Powers combined have played in 55 WNBA postseason games. Powers won a WNBA title with Washington.\n\nObviously, this team doesn't look like what was expected back in May, but its resilience has never gone away. Clark being officially shut down is a blow, but the Fever have played more than twice as many games without Clark this season as they have with her. -- Voepel\n\nHow has Indiana played without Clark?\n\nThe good news for the Fever is they still have two healthy All-Stars in Boston and Mitchell, the latter of whom has stepped up as Indiana's primary perimeter creator in Clark's absence. Mitchell has averaged 21.2 PPG and 3.9 APG in 28 games without Clark, compared with 19.2 PPG and 2.2 APG as part of an All-Star backcourt duo.\n\nThe enhanced ESPN App Watch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nHowever, recent injuries to guards beyond Clark have tested Indiana's depth. The Fever won five consecutive games from July 24 to Aug. 3, but just after the win streak was snapped in Los Angeles, they lost McDonald and Colson in a loss to Phoenix. Including that game, which neither player finished, Indiana has gone 4-7 in its past 11 games. Then Cunningham, who averaged 11.2 PPG in 13 starts, was also lost for the season.\n\nIntriguingly, Indiana still has a better net rating (minus-2.5 points per 100 possessions) in that span than Los Angeles (minus-3.5), according to WNBA Advanced Stats. The Sparks are 1.5 games back of the Fever for the eighth and final playoff spot, which is why the Fever make the playoffs in 93% of simulations using ESPN's Basketball Power Index (BPI). But Indiana's net rating is last among the eight teams currently in playoff position, which doesn't bode well for a first-round upset. -- Pelton\n\nWhy did the Fever make the decision now?\n\nThe Fever might have been ready to pull the plug on Clark's season even before Thursday. But Clark is a fierce competitor, and Fever management probably wanted to give her every opportunity to return if she could. All along, it has seemed like the Fever have tried to balance encouraging Clark with attempting to stay pragmatic.\n\nBut with the end of the regular season next week, the clock had realistically run out on her coming back. There was no reason to keep dangling that hope to Fever fans, many of whom likely anticipated this announcement, or for Clark to keep pushing toward an impossible goal. -- Voepel\n\nAfter returning Caitlin Clark, Kelsey Mitchell and Aliyah Boston, bringing in coach Stephanie White and adding DeWanna Bonner, Natasha Howard and Sophie Cunningham in the offseason, the Fever were expected to contend for the 2025 WNBA title. Ron Hoskins/NBAE via Getty Images\n\nWhat does Clark being shut down for the season mean for her immediate future?\n\nShe ends her second season having averaged 16.5 points, 8.8 assists, 5.0 rebounds and 1.6 steals in 13 games. Even in her time off the court, she was never disengaged from the Fever. She was a vocal and energetic presence on the bench, and we can expect that will remain the same for all of Indiana's remaining games. But there is now no pressure to push herself physically, which is for the best. She can focus on getting healthy, setting up workout routines that will carry over into the offseason and supporting the team for however long the 2025 season lasts.\n\nAs for what it means for the WNBA, clearly Clark is the league's biggest draw: Her presence on the court draws interest even from people who aren't big sports fans. She definitely will be missed in the postseason. But if the standings hold, Indiana still will host its first playoff game since 2016, and across the league there remains anticipation for the playoffs and several intriguing storylines. -- Voepel\n\nWhat should we expect from Clark next May in her third WNBA season?\n\nFor this injury-plagued season to be a memory. We're still at least eight months away from the start of the 2026 regular season, more than enough time for Clark's groin to heal completely.\n\nPerhaps the most compelling parallel to Clark's lost 2025 is Michael Jordan's second NBA season. After winning Rookie of the Year, like Clark did last year, Jordan was limited to 18 games and seven starts in 1985-86 by a navicular fracture. (One key difference: Jordan returned for the playoffs, dropping 63 points on the eventual champion Celtics at the Boston Garden in a first-round loss.) The following season, Jordan averaged a career-high 37.1 PPG and finished second in MVP voting.\n\nThere's WNBA precedent, too. Three-time MVP A'ja Wilson went from averaging 20.7 PPG as a rookie to 16.5 in Year 2, in part because of an ankle sprain that cost her a couple of weeks. The next year, in 2020, Wilson won the first of those MVP trophies. Sue Bird managed to play all 34 games during her second season despite a knee injury that required microfracture surgery the following offseason. In Year 3, Bird helped lead the Seattle Storm to the first of her four championships.\n\nThat's not to say that Clark will win a scoring title, MVP or a championship in 2026, but her potential shouldn't be limited by what happened this year.\n\nOne interesting question is whether missing so much time might alter Clark's offseason plans. She opted against any organized competition after her rookie campaign, but going so long without competitive games might not be ideal for Clark this time around. That could make participating in Unrivaled's 3-on-3 play or going overseas more appealing. -- Pelton"
  },
  {
    "source": "ESPN",
    "title": "Copper, Sabally, Thomas lead Mercury into WNBA playoffs",
    "url": "https://www.espn.com/wnba/story/_/id/46152718/wnba-2025-phoenix-mercury-alyssa-thomas-satou-sabally-kahleah-cooper-playoff-run",
    "date": "2025-09-07",
    "text": "Alyssa Thomas drops 12 points, 16 rebounds and 15 assists for her seventh triple-double of the season, breaking her own single-season WNBA record. (1:43)\n\nOpen Extended Reactions\n\nKahleah Copper and Satou Sabally sat across from each other at a restaurant in Miami in late January, two blocks from their apartment complex at Unrivaled, for a midmorning breakfast before practice.\n\nThey had played basketball against each other for years but never on the same team. They made small talk -- how the inaugural season of the new 3-on-3 league would allow them to develop their games, how impressive the resources were at Unrivaled and how having 36 of the WNBA's top players together in one space would create a recruiting frenzy for upcoming free agents.\n\nOnly a few weeks earlier, Sabally had told the Dallas Wings she intended to find a new home, making her one of the league's top players on the market. And she had cheekily let her peers in Miami know she was open to bribes and coffee.\n\nCopper texted her coach and general manager with the Phoenix Mercury, telling Nate Tibbetts and Nick U'Ren she was pitching the team to Sabally -- and requested reimbursement for the meal.\n\n\"What are you looking for with your next team?\" Copper asked Sabally as they ate.\n\n\"I need to go into a professional organization, top to bottom, where there are high standards,\" Sabally recalled to ESPN. \"Being surrounded by greatness ... I want to be in a place where I am not setting the standard, but I'm living up to one.\"\n\nDiana Taurasi and Brittney Griner set the bar in Phoenix for the last decade. But with Taurasi likely retiring and Griner rumored to be on the move, the Mercury were entering a new era. If they wanted to contend for a title, they had to redefine themselves and find a new identity.\n\nThree weeks after that breakfast, Sabally informed Phoenix's front office that she wanted to play for the Mercury. U'Ren was already putting the finishing touches on bringing perennial MVP candidate Alyssa Thomas to Phoenix, but a historic four-team trade landed both Sabally and Thomas, establishing a new big three and the start of a new chapter in the desert.\n\n\"It's about upholding that legacy and the standard of what they set,\" Copper told ESPN. \"But now it's also taking that next step to greatness -- to the playoffs and to championships and that caliber of organization. It's honoring them, but embracing this new era.\"\n\nSatou Sabally, Alyssa Thomas and Kahleah Copper combine to average 48.5 points and 18 rebounds per game. ESPN Illustration\n\nCOPPER ASSESSED HER options at the top of the key, finding Thomas with a bounce pass as she cut to the hoop. A Seattle Storm defender nearly intercepted the pass, but Thomas collected it just in time to slingshot the ball to Sabally, who was waiting on the right wing and knocked down a 3-pointer.\n\nPhoenix went on to win that Aug. 17 road game by three points, and that type of play was what Tibbetts and U'Ren envisioned during the offseason, when they had discussed the need to add elite, versatile wings to the roster. In her first season in Phoenix in 2024, Copper had proved to be a reliable scorer, and they wanted to surround her with bigger bodies who could facilitate, supplement scoring and boost the defense.\n\nAn elite cutter, Copper would thrive off Thomas' passing, and Sabally -- nicknamed \"The Unicorn\" because of her shooting and dribbling versatility and size -- could tie it all together. On paper, the trio perfectly fit the position-less style Tibbets, who was an NBA assistant for 12 years, and U'Ren, a former executive with the Golden State Warriors, brought from their NBA backgrounds and wanted to establish in Phoenix.\n\nThe enhanced ESPN App Watch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nThe Mercury went after Sabally in 2024 when she was a restricted free agent. Though she opted to stay in Dallas for one more year, the seeds were planted. And as whispers that Thomas could be looking for a new home after 11 seasons with the Connecticut Sun, she also became a target of Phoenix.\n\nDuring the Unrivaled season, Copper reached out to Thomas as well. Since playing with Candace Parker in Chicago -- together they helped the Sky win the 2021 WNBA championship -- Copper had been hunting for another point-forward to play next to. Copper relayed to Thomas that Tibbetts and U'Ren would make her Phoenix's primary ball handler and rely on her to call plays and run the offense. Thomas has been given even more freedom than she expected.\n\n\"This year is the most in my career I've initiated the offense,\" Thomas told ESPN. \"It's been an easy transition for me. It's the first time I've had someone from an NBA style, so it's fun to pick their brain on that level.\"\n\nThomas is putting together another MVP-caliber season, averaging 16.0 points on 53.8% field goal shooting, both of which are career highs, to go along with 8.9 rebounds, 9.2 assists (another career high) and 1.6 steals. She has tallied a WNBA single-season record seven triple-doubles this year, three of which came in consecutive games, and on Aug. 26 became the first player in league history to record a 10-point, 15-rebound, 15-assist game.\n\n\"She's done this her entire career, but she's doing it now at a new clip,\" Tibbetts told ESPN. \"The thing I've been wowed with is how much she loves to compete, how much she wants to win, and what she's willing to do to accomplish that.\"\n\nplay 1:08 Phoenix Mercury vs. Indiana Fever - Game Highlights Watch the Game Highlights from Phoenix Mercury vs. Indiana Fever, 09/02/2025\n\nPlaying together has allowed Thomas, Sabally (team-high 16.5 PPG) and Copper (16.0) to play fewer minutes without sacrificing impact.\n\n\"Playing next to them, it feels like it also takes weight off of you in games,\" said Sabally, who's averaging 26.8 minutes per game, down from 34.1 in 2024. \"I can just play my minutes with maximum intensity, rather than the maximum amount of time.\"\n\nInjuries have prevented them from playing together as often as they'd hoped. Chemistry is tough to come by when Copper (left knee) was sidelined for the first 4½ weeks of the season, Thomas (left calf) missed five games between May and June and Sabally (right ankle) was out two weeks in July.\n\nBut when all three players are available, the Mercury are 14-9 and have a net rating of plus-7.3. According to Second Spectrum, the Mercury score 1.08 points per possession and allow just 1.01 points per possession on defense when Sabally, Copper and Thomas share the court -- ranking in the top four of both categories in the WNBA over a full season.\n\n\"Real winners don't want to do it alone,\" Copper said. \"You want the help, you want to surround yourself with greats. That's a big reason why I was pressing them to come and join me.\"\n\nAlyssa Thomas has had seven triple-doubles this season, and says the part of basketball she loves the most is \"finding easy shots for my teammates.\" Emily Johnson for ESPN\n\nFOUR GAMES REMAIN in the regular season. Phoenix is one of five teams that have clinched a playoff berth. Now the focus for the final stretch is integrating all of the pieces together for a postseason push.\n\nDepth was one of the biggest questions entering the season but got established early when Tibbetts threw different lineups and combinations together to see what would work. It wasn't the ideal way to start the year, but key contributors emerged, such as unconventional rookies Monique Akoa Makani -- a 24-year-old guard from Cameroon who has played professionally in France the past six years -- and Kathryn Westbeld, 29, who was part of Notre Dame's NCAA championship team in 2018.\n\nPhoenix is bringing the heat to the playoffs 🔥\n\n\n\nThe Mercury clinch a spot with a Dream win 👏 pic.twitter.com/OEEBPwlzaH — espnW (@espnW) August 30, 2025\n\nSeven Mercury players have started at least 19 games, and 10 players average at least 15 minutes per game.\n\n\"[It's] not only having depth, but trusting that depth,\" Copper said. \"We have so many players who are threats. They take one thing away, we're playing to the next option.\"\n\nIn early July, the Mercury signed DeWanna Bonner, who returned to the franchise she helped in winning WNBA titles in 2009 and 2014. She has now settled in as the team's fourth double-digit scorer (11.6 PPG). Finally, in mid-July, their big three were healthy.\n\n\"The exciting part is the success we are having when we haven't had much time,\" Copper said. \"That's such a plus. If we continue to have this time together and we continue to build before the playoffs, that's big-time for us. We are having success and we're just out there freestyling.\"\n\nThe Mercury have won five consecutive games and seven of their last eight dating back to that win over Seattle. Phoenix, the Atlanta Dream and Las Vegas Aces are all six games behind the league-leading Minnesota Lynx, but the Mercury sit in fourth place in the standings through Wednesday's games as they are 1-3 against the Aces and 0-3 against the Dream. Home-court advantage might not be decided until the last few days of the season.\n\nTibbetts has cautioned his players not to get caught up in watching the standings, advising them to find a balance between being aware of where they are but not focusing too much on other teams' results.\n\nPhoenix, he said, must focus on what it can control: continued growth and development.\n\nSabally said recently that the Mercury were 80% of where they want to be for the postseason, but as they've continued to get more reps as a complete team, they've become more confident in what their ceiling can be this year.\n\n\"We knew that we had to stay patient,\" Sabally said. \"We kept saying be patient, trust the process, everything will come together. We just have to peak at the right time.\""
  },
  {
    "source": "ESPN",
    "title": "Ruling out Caitlin Clark's return a 'big picture' call, Fever say",
    "url": "https://www.espn.com/wnba/story/_/id/46170176/ruling-caitlin-clark-return-big-picture-call-fever-say",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nINDIANAPOLIS -- Indiana Fever coach Stephanie White said Friday that she hopes star Caitlin Clark's injury-riddled second season will be a blip on the radar for her career and that Clark will learn from experiencing adversity so early as a pro.\n\n\"There's a hunger and drive that comes with not having played and not wanting to do that again,\" White said Friday, a day after Clark was officially ruled out for the season. \"So what does that look like from a training perspective, what does that look like from a mentality perspective, from a preparation perspective, [is] just as much [impactful] as what you learn about the game and your teammates.\"\n\nClark, the 2024 No. 1 pick, was limited to 13 games this year and has not played since July 15, when she suffered a right groin injury in the final minute of the Fever's win over the Connecticut Sun. She had been sidelined earlier in the year with left quad and left groin injuries and in an August workout suffered a bone bruise in her right ankle that she had to rehab concurrently with her groin.\n\nWhite said Friday that the team has had a \"preliminary conversation\" about what Clark's continued rehab will look like through the end of the season but will sit and talk more thoroughly about an offseason plan once the Fever season is done.\n\nClark had been \"working her butt off to be able to get back,\" White said, and the team's recent road trip to the West Coast was a crucial opportunity for the Fever to see if they could get her on the floor with contact and build her endurance back to a high level in consecutive days.\n\nBut with Indiana's regular season ending Tuesday and a playoff berth not guaranteed, the Fever felt they ran out of time.\n\n\"We just weren't able to get to where we thought we needed for her to be able to participate at this level,\" White said. \"Some of that's physical, in terms of the rehab and all of that, and some of that is also endurance and being able to play at the level that it takes, build back that endurance enough to play, because all of these games right now are like playoff games. There's a sense of urgency and a level to which they're being played.\"\n\nBefore this season, Clark had never missed a game during her college career at Iowa or her rookie campaign with the Fever, which ended with her earning all-WNBA first-team honors and finishing fourth in MVP voting. A second season that started with so much promise instead saw Clark fail to appear in more than five consecutive games, sidelined for Indianapolis' WNBA All-Star festivities and ultimately miss the final eight weeks of the season.\n\n\"Just all the injuries that she's had and the amount of work she's put in to position herself to play and then to be able to ultimately make this decision, there's disappointment,\" White said. \"There's the obvious frustration that's come with not being healthy, really, for an entire season. But ultimately, I think the big picture is the most important thing, and those are conversations that we continue to have. And the message has continued to be that her long-term health and wellness, and her being 100% when she's ready to go, is the most important thing.\"\n\nClark is the fifth Fever player to be ruled out for the season because of injury, joining Aari McDonald (foot), Sydney Colson (knee), Sophie Cunningham (knee) and Chloe Bibby (knee). But Indiana (22-20) is still within reach of a second consecutive playoff berth and is competing alongside the Seattle Storm and Los Angeles Sparks for one of two remaining spots.\n\nThe Fever beat the Chicago Sky 97-77 on Friday. They will take on the Washington Mystics on the road Sunday and the Minnesota Lynx at home in their regular-season finale Tuesday.\n\nIndiana needs to win one of its remaining games, or for the Sparks to drop one of their remaining three contests, to make it into the postseason. With Friday's victory, the Fever also ensured consecutive .500 finishes for the first time since 2015-16, after which the team languished and missed the playoffs for seven straight years.\n\n\"It's definitely a stepping stone in the right direction,\" said Kelsey Mitchell, the team's longest tenured player who finished with 20 points and 8 assists Friday. \"I think it's definitely important for us to kind of bask in it for a little bit, because I remember where this group was.\"\n\nBut Indiana doesn't want to take its foot off the gas, knowing it must play better moving forward to ensure a spot in the postseason.\n\n\"The job's not done,\" Natasha Howard said. \"We still have things that we still need to work on before the playoff start. ... We need to focus on playing defense and defense without fouling. We get that together, it's going to be scary for other teams.\""
  },
  {
    "source": "ESPN",
    "title": "Fantasy women's basketball: Four picks to win your finals",
    "url": "https://www.espn.com/fantasy/womens-basketball/story/_/id/46079893/fantasy-women-basketball-wavier-wire-wnba-rankings-week-august-26",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nWith the WNBA playoffs just a few weeks away, the fantasy playoffs have begun for most leagues. This doesn't spell the end of working on your roster. Rather, each move means even more during these final days of the season.\n\nYour League, Your Rules Create a league and customize league size, scoring and rules to play in the league you want to play in. Create a league today!\n\nInjuries are influencing several rotations around the league, such as the wave of starters missing for the Indiana Fever. It can be frustrating when the stars that helped get you this far are sidelined, but it also creates openings for hidden gems to step up. Pivoting to productive players from free agency is the best way to exercise agency as a fantasy manager during these final nights of the season.\n\nDon't be afraid to take risks now as short-term production matters more than name value. With that in mind, let's look at the league with an eye on identifying some of the best streaming options in the week ahead.\n\nBackcourt\n\nFantasy Football Gridiron Gauntlet FREE to play. Become ESPN fantasy football's ultimate champ. Sign Up | Find out more\n\nLexie Hull, G, Indiana Fever (Rostered in 40.7% of ESPN leagues): The Fever are missing multiple key starters, pushing Hull into a primary playmaking role. With increased touches, passes and shots in this role, Hull could prove to be a difference-maker during the final games of the campaign.\n\nLeila Lacan, G, Connecticut Sun (13.6%): It's advisable to pursue both of the team's emergent rookie guards, as Saniya Rivers (43.3%) has been a revelation in recent outings. Lacan missed Monday night's matchup with the Liberty, but a return to action by Wednesday for an inviting matchup with the Wings appears possible. Lacan has been one of the league's most productive passers the past few weeks. With the team turning the offense over to their rookie guards, it's a wise time to invest in the Sun.\n\nFrontcourt\n\nJessica Shepard, F, Minnesota Lynx (24.7%): A massive triple-double was followed by a scoreless outing for Shepard recently, highlighting some of the volatility inherent to her fantasy profile. As one of the team's top \"glue\" players on both sides of the ball, Shepard won't handle a massive workload now that her superstar teammate Napheesa Collier is back in the mix. That said, there are still going to be big lines ahead for a critical starter in a contending rotation.\n\nIliana Rupert, C, Golden State Valkyries (6.8%): An injury to Cecilia Zandalasini and a shift to the bench for Kate Martin opens up minutes and touches for Rupert in the rotation. Strong production has surfaced whenever Rupert starts, which was the case in a strong recent game against Dallas. There's also a place for Janelle Salaun (30.1%) on fantasy rosters, albeit with a lower ceiling."
  },
  {
    "source": "ESPN",
    "title": "Tracking WNBA MVP race, awards: Who are the front-runners?",
    "url": "https://www.espn.com/wnba/story/_/id/45473671/wnba-2025-awards-mvp-rookie-year-coach-dpoy-most-improved-sixth-woman",
    "date": "2025-09-07",
    "text": "Check out some of the best moments from Thursday's WNBA action, including Alyssa Thomas' impressive triple-double to lead the Mercury past the Fever. (0:48)\n\nOpen Extended Reactions\n\nWNBA players are focused on the playoff push, but their performances over the next few weeks also will solidify the 2025 season's honors.\n\nInjuries and teams' ups and downs continue to be a factor in the awards tracker.\n\nOne thing hasn't changed, though: Minnesota Lynx forward Napheesa Collier, out because of an ankle injury, remains the front-runner for MVP. Collier, the All-Star Game MVP, is having the best season of her career, and the Lynx are in first place.\n\nPhoenix Mercury forward Alyssa Thomas has been making a big push in the MVP race, but Collier will be difficult to catch.\n\nThe favorites for some other awards have changed each month, and might change again when we make our final votes in September. ESPN's Michael Voepel, Kevin Pelton, Kendra Andrews and Alexa Philippou weigh in on who seems to have the upper hand for six awards, along with picking the top challengers.\n\nJump to:\n\nMVP | Rookie of Year | Defensive Player of Year\n\nMost Improved | Sixth Player | Coach of Year\n\nMVP\n\nBruce Kluckhohn-Imagn Images\n\nKendra Andrews: Napheesa Collier, Minnesota Lynx\n\nKevin Pelton: Napheesa Collier, Minnesota Lynx\n\nAlexa Philippou: Napheesa Collier, Minnesota Lynx\n\nMichael Voepel: Napheesa Collier, Minnesota Lynx\n\nESPN's front-runner: Napheesa Collier, Minnesota Lynx\n\nDespite missing the past three games because of an ankle sprain, Collier remains our consensus pick. Minnesota has won all three games without Collier, albeit by smaller margins, and still holds a six-game cushion in the standings. If Collier is out for more than the two weeks she initially was reported to miss, the race could get interesting. But Collier has been the league's best player all season and has played more minutes than her closest challenger, Alyssa Thomas.\n\n(Collier was also the front-runner in June and July.)\n\nTop challenger: Alyssa Thomas, Phoenix Mercury\n\nThomas' value can be gathered by looking at Phoenix's rise and Connecticut's fall this season. She has gotten more comfortable as the months have passed in her first season in Phoenix, becoming the first player in WNBA history to record triple-doubles in three consecutive games earlier this month.\n\nThomas, the 2023 MVP runner-up, is averaging career highs in points (16.0) and assists (a league-leading 9.0), putting her second on our ballot. However, don't rule out reigning MVP A'ja Wilson: she became the first player in league history with a 30-20 game earlier this week and has led the Las Vegas Aces on a five-game winning streak. -- Kevin Pelton\n\nRookie of the Year\n\nAndrews: Paige Bueckers, Dallas Wings\n\nPelton: Paige Bueckers, Dallas Wings\n\nPhilippou: Paige Bueckers, Dallas Wings\n\nVoepel: Paige Bueckers, Dallas Wings\n\nESPN's front-runner: Paige Bueckers, Dallas Wings\n\nOther than missing seven games because of injury or illness, Bueckers' transition to the WNBA has been smooth. Bueckers is virtually a lock to be the fourth consecutive No. 1 pick to be named Rookie of the Year, following Atlanta's Rhyne Howard and Indiana's Aliyah Boston and Caitlin Clark.\n\nBueckers is averaging 18.4 points, 5.4 assists and 4.0 rebounds while shooting 45.2%. It has been a challenging season for the 9-24 Wings, but Bueckers has been a bright spot. The Wings have been at their best when she's on the court, and they could still gain some momentum for next year during the closing weeks of the 2025 season. Personnel moves must be made around Bueckers to improve Dallas for 2026.\n\n(Bueckers was also the ESPN front-runner in July.)\n\nTop challenger: Sonia Citron, Washington Mystics\n\nNo. 3 pick Citron, who joined Bueckers and her Mystics teammate Kiki Iriafen as rookie All-Stars, has lived up to her lottery selection. With fellow guard Brittney Sykes having been traded to Seattle on Aug. 5, Citron is Washington's leading scorer at 14.8 points while shooting 46.5%. She averages 4.5 rebounds and 2.4 assists. Her 51 3-pointers lead the 14-18 Mystics and are the most among all WNBA rookies this season. -- Michael Voepel\n\nDefensive Player of the Year\n\nAndrews: Gabby Williams, Seattle Storm\n\nPelton: Gabby Williams, Seattle Storm\n\nPhilippou: Alanna Smith, Minnesota Lynx\n\nVoepel: Napheesa Collier, Minnesota Lynx\n\nESPN's front-runner: Gabby Williams, Seattle Storm\n\nThis race remains wide open with four weeks left in the season. Three players got first-place votes from our panel, with another (Alyssa Thomas) getting runner-up votes. Williams' candidacy might depend on Seattle rebounding from a recent six-game losing streak that has dropped the Storm from second to fifth in defensive rating. Still, Williams is a top individual defender whose 2.5 steals are the most by a WNBA player since 2013.\n\n(Napheesa Collier was the front-runner in July, while Natasha Cloud in June.)\n\nTop challenger: Napheesa Collier, Minnesota Lynx; Alyssa Thomas, Phoenix Mercury; A'ja Wilson, Las Vegas Aces\n\nAs was the case last year, the MVP front-runners are also at the forefront of the DPOY race. Collier's stats are just as good as when she won this award, though she could split votes with her teammates. Thomas, meanwhile, has led Phoenix to second in defensive rating after the Mercury finished ninth a year ago. And though the Aces' defense isn't in the same class, Wilson remains the WNBA's leading shot blocker. -- Peloton\n\nMost Improved Player\n\nAndrews: Allisha Gray, Atlanta Dream\n\nPelton: Veronica Burton, Golden State Valkyries\n\nPhilippou: Veronica Burton, Golden State Valkyries\n\nVoepel: Veronica Burton, Golden State Valkyries\n\nplay 1:08 Veronica Burton propels Valkyries past Sparks The Valkyries, led by Veronica Burton's 16 points, get a much-needed win vs. the Sparks.\n\nESPN's front-runner: Veronica Burton, Golden State Valkyries\n\nBurton's story is about perseverance meeting opportunity. Burton, the No. 7 pick in the 2022 draft out of Northwestern, played two seasons with Dallas, averaging about 2.5 points, before being waived before the 2024 season. Connecticut picked her up, and she has played 31 games for the Sun, averaging 3.1 points.\n\nShe was selected No. 3 by the Valkyries in the expansion draft and has been one of the keys for the first-year franchise. The 25-year-old guard has always been a strong defensive player, and is now averaging 11.2 points, 5.2 assists and 4.3 rebounds. She scored a career-high 30 points Wednesday in a victory over Washington as the 17-15 Valkyries seek a playoff berth.\n\n(Allisha Gray was the front-runner in July.)\n\nplay 1:59 Allisha Gray, Dream top the Mercury on Sunday Alisha Gray drops 17 points in the Dream's 74-66 win over the Mercury.\n\nTop challengers: Allisha Gray, Atlanta Dream; Azura Stevens, Los Angeles Sparks\n\nGray, 30, is already a well-established player -- an All-Star, Olympic gold medalist and 2017 Rookie of the Year -- who is enjoying a career-best season. Stevens, 29, is also having a career-best year (14.6 PPG, 8.1 RPG, 51.4% FG) and has moved into a more elite status during her eighth season in the league as she hopes to help return the Sparks to the postseason. -- Voepel\n\nSixth Player of the Year\n\nAndrews: Naz Hillmon, Atlanta Dream\n\nPelton: Naz Hillmon, Atlanta Dream\n\nPhilippou: Naz Hillmon, Atlanta Dream\n\nVoepel: Naz Hillmon, Atlanta Dream\n\nplay 0:31 Naz Hillmon's clutch 3 wins it for the Dream Naz Hillmon connects on a go-ahead 3-pointer in the final seconds to give the Dream a dramatic win over the Wings.\n\nESPN front-runner: Naz Hillmon, Atlanta Dream\n\nThe Dream have outscored opponents by 13.5 points per 100 possessions with Hillmon on the court, the best net rating for any WNBA rotation player who's not on the Lynx. That reflects Hillmon's newfound ability to stretch the floor (1.2 3-pointers per game after one total in her first three pro seasons). By removing long 2s from her game under Karl Smesko, Hillmon is also shooting 69% inside the arc and has stayed in the starting lineup next to Brionna Jones since Brittney Griner returned from injury. Because Hillmon came off the bench for Atlanta's first 27 games, she'll qualify for the Sixth Player Award even if she remains a starter the rest of the way.\n\n(Kennedy Burke was the front-runner in June and July.)\n\nTop challenger: Jessica Shepard, Minnesota Lynx\n\nWith early front-runner Kennedy Burke of the New York Liberty missing more than two weeks because of a calf strain, Shepard has moved ahead in the pecking order. Shepard and Natisha Hiedeman have averaged 7-plus points off the Minnesota second unit, but Shepard is doing so with superior efficiency (61% shooting) and has been one of the league's best rebounders this season. -- Pelton\n\nplay 1:06 Valkyries take down Sun for 2nd straight win Three Valkyries starters score in double figures en route to defeating the Sun 74-57.\n\nCoach of the Year\n\nAndrews: Natalie Nakase, Golden State Valkyries\n\nPelton: Natalie Nakase, Golden State Valkyries\n\nPhilippou: Natalie Nakase, Golden State Valkyries\n\nVoepel: Natalie Nakase, Golden State Valkyries\n\nESPN's front-runner: Natalie Nakase, Golden State Valkyries\n\nNakase was a big part of the Aces' championship success as one of Becky Hammon's assistants, and that made her an excellent head coaching candidate this season. Nakase was ready to strategize at the highest level. That has been a big factor in the expansion Valkyries being a potential playoff team. Golden State has been particularly impressive on defense, allowing the second-fewest points in the league (77.3 PPG).\n\n(Nakase was the front-runner in July. Phoenix's Nate Tibbetts was the front-runner in June.)\n\nTop challenger: Karl Smesko, Atlanta Dream\n\nSmesko has transitioned from being consistently good at Florida Gulf Coast to finding success in his first season in the WNBA. The 21-11 Dream are in second and have won six games in a row, and eight of their past nine. Gray and Hillmon are having career-best years. The Dream, who averaged a league-worst 77.0 points last season, are scoring 84.3 points this year. -- Voepel"
  },
  {
    "source": "ESPN",
    "title": "WNBA's CBA negotiations: From rev sharing to potential lockout",
    "url": "https://www.espn.com/wnba/story/_/id/45901210/wnba-2025-collective-bargaining-agreement-cba-negotiations-salaries-rev-shares-lockout",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nWe knew going into this WNBA season that the league's collective bargaining negotiations with the players would be one of the most important issues in 2025. With no deal in place ahead of the current collective bargaining agreement expiring on Oct. 31, it has become the single most important topic.\n\nDuring WNBA All-Star Weekend in mid-July, the players put the focus squarely on the CBA. Players described a meeting with commissioner Cathy Engelbert and ownership representative in Indianapolis as being \"a missed opportunity\" to come closer on terms.\n\nBefore the July 19 All-Star Game, players wore \"Pay Us What You Owe Us\" T-shirts during warmups. Fans chanted in support of the players after the game, but the move got some criticism, too.\n\nEven retired WNBA legend Candace Parker said during her \"Post Moves\" podcast with the Indiana Fever's Aliyah Boston that it wasn't a great look for the players to wear those shirts and then give little to no effort during the game. Boston countered by saying that with so many games on the schedule and short recovery times, the players didn't need to play hard in an exhibition because they are giving so much in the games that matter.\n\nMeanwhile, Engelbert has stayed on message with mostly positive platitudes, guiding a management/ownership response -- or lack thereof -- that isn't focused on public perception.\n\nWill the sides move closer over the next few months? ESPN looks at what we've learned to this point about the CBA negotiations and what could come from them.\n\nThe biggest issue in CBA negotiations, per WNBPA president Nneka Ogwumike, is that the players want a system that allows them to earn a greater percentage of the revenue pie as the business continues to grow. Trevor Ruszkowski-Imagn Images\n\nWhat are the players' biggest priorities?\n\nThere are several, but the most important is revenue sharing: how it's determined and whether the percentage will be allowed to grow during the course of the CBA and not be a fixed number for the duration of the deal.\n\n\"The players are still adamant that we get a percentage of revenue that grows with the business, which perhaps includes team revenue, and that's just a part of the conversation,\" WNBA Players Association president Nneka Ogwumike told ESPN.\n\nFans are used to salary caps for NBA and NFL teams being set based on a percentage of what the CBA describes as \"basketball-related income,\" or BRI. By contrast, the WNBA's current CBA defined the cap for each season ahead of time with modest 3% annual raises. A mechanism in the CBA that would increase the cap based on revenue was effectively invalidated by the timing of the deal.\n\nBecause the current CBA began in 2020 prior to the COVID-19 pandemic, revenue targets were set based on the previous campaign (2019) and made cumulative over the life of the deal. The league made no money off ticket sales during the abbreviated 2020 season, played on the IMG Academy campus in Bradenton, Florida, and attendance was also limited in 2021 by local restrictions. That made it unrealistic for the targets to be met despite the league's increased attendance over the past two seasons.\n\nPer Ogwumike, the WNBA's latest offer to its players -- while dramatically increasing the salary cap and maximum base salaries, which a league source suggested could quadruple to at least $1 million from their current $249,244 -- follows the same model as the current CBA.\n\n\"It's basically the same system that we exist in right now,\" Ogwumike said. \"They're proposing a system that includes revenue that would grow with the business. When you approach it from the perspective of their response to our proposal, yes, money is more, but ultimately if you look at the growth of the business, the money relative to the percentage of everything is virtually staying the same.\"\n\nThe players see the astonishing leap in franchise valuations -- the Las Vegas Aces, for example, were purchased for $2 million in 2021 but are now valued at $310 million, and the New York Liberty were purchased for between $10 million and $14 million after being for sale for more than a year and now have an estimated valuation of around $450 million -- in the past couple of years and question if they are getting their proper share of that growth.\n\nOn its face, that's a reasonable thing to ask. But what about the NBA's claims for years of subsidizing WNBA losses? Will the NBA say the new money is in part back-filling past deficits? Could it prove that?\n\nOne of the most difficult parts of following the WNBA's labor negotiations all these years has been getting firm numbers from the league's side of things. The players have said they don't always feel like they get that. By the same token, the side we do hear much more from -- during every CBA -- is the players and their union. There has been dramatic change in the WNBA -- and what that indicates for the future -- in a short period of time after many years that seemed stagnant. The popularity of 2024 No. 1 draft pick Caitlin Clark has been an enormous boost for a league that had clearly started to turn the corner toward real growth over the past five years.\n\nIf that growth continues as expected, it's understandable the players are concerned about how their part of the pie grows, too.\n\n\"We're seeing expansion, and the players are just saying, 'Hey, let us have our fair share of that,'\" Ogwumike said. \"Sometimes that means proposing something new that makes sense for the time. Not really new -- new to us, not to other leagues.\"\n\nplay 1:46 Could the WNBA be headed towards a work stoppage? Alexa Philippou reports on the WNBA players' push for revenue sharing in the new CBA proposal.\n\nHow realistic is a lockout? What about the WNBA missing games in 2026?\n\nMuch of the attention around CBA negotiations has inevitably focused on the potential of a work stoppage, something that would be unprecedented in WNBA history. The players' disappointment with the outcome of their meeting at the All-Star break fanned the flames on the possibility.\n\nIdeally, a new deal would be reached before the Oct. 31 expiration of the CBA, allowing the offseason to proceed as scheduled. There's precedent for that. The NBA's last two CBA negotiations have been completed during the previous season, well before the deadline, and the NWSL and its players replaced their CBA with a historic new one signed in 2024 with two years remaining on their previous deal.\n\nFailing to reach agreement by Halloween wouldn't necessarily translate into a lockout. With talks progressing, the two sides extended the term of the last CBA until they completed negotiations in January on the eve of free agency.\n\nThe WNBA might have more urgency this year because of the expansion process for the Portland Fire and Toronto Tempo, set to begin play in 2026 (and expansion to 18 teams by 2030). Last year's Golden State Valkyries expansion draft was held Dec. 7, giving the team time to prepare for free agency and players to promote their inaugural season.\n\nAlthough an offseason lockout would be disruptive, most notably by preventing players from utilizing team facilities to work out -- something that's more of an issue now than in 2020 with multiple teams building dedicated practice facilities that are available to players year-round -- when fans think about a work stoppage, their real concern is missing games. That's not in anyone's best interest.\n\nSpecifically, owners have more at stake now that franchise valuations have escalated. Most explicitly in 2003, when negotiations on the WNBA's second CBA took until April to complete, players have always had to deal with the possibility that owners could withdraw their support for the league.\n\nWith fierce competition for expansion teams, the WNBA is no longer at risk of going anywhere. That's increased player resolve to make a deal on their terms -- however long that means.\n\n\"The headline is 'lockout!' and ultimately the goal for everyone is to get a good deal done,\" Ogwumike said. \"Hopefully it gets done in the time that makes sense. I don't think anyone wants to see a lockout. That's not something that we're advocating for. We just want to make sure that this is a deal that's done the right way and using whatever time it takes for us to be able to have both sides agree on something.\"\n\nplay 0:21 WNBA stars wear 'pay us what you owe us' shirts The WNBA All-Stars wear shirts that read \"Pay Us What You Owe Us\" amid CBA talks with the league.\n\nHow big of an issue is prioritization this time?\n\nThis was a must-have for owners in the last CBA negotiations, so it will be important again. They want the players to prioritize playing in the WNBA above overseas leagues and newer ventures like Unrivaled, the U.S.-based 3-on-3 league that played its first season in February and March.\n\nThe Minnesota Lynx's Napheesa Collier and New York Liberty's Breanna Stewart co-founded Unrivaled and are also on the WNBPA's executive committee. Both insist this doesn't constitute a conflict of interest with them also participating in CBA negotiations, but it's difficult to see how that could be entirely avoided.\n\nFor instance, Collier wore an Unrivaled shirt during the televised WNBA All-Star Game roster draft, for which she was a captain. Of the move, Collier told ESPN, \"I thought it was a great opportunity to represent something I was passionate about.\"\n\nSeattle Storm player Gabby Williams was outspoken during All-Star Weekend that she thinks the WNBA wants to see the end of Unrivaled and another U.S.-based league, Athletes Unlimited, even if they aren't direct competitors with the WNBA's summertime schedule. The WNBA hasn't said that. But the owners have been willing to put more pressure on the players since the last CBA to affirm their loyalty to the WNBA.\n\nThere are some exceptions for prioritization -- including for younger players establishing themselves overseas and for those competing for national teams -- that could stay in place. But the owners say that the WNBA holding firm on prioritization brings more respect to the league, and that it has prompted some scheduling concessions from overseas leagues and FIBA events to not conflict with the WNBA season when possible. Starting in 2030, for example, the FIBA Women's Basketball World Cup will move from September-October to November-December.\n\nOgwumike is encouraged by the state of conversations but notes that the two sides haven't yet drilled down on non-financial terms.\n\n\"I don't think that we've served enough time discussing a lot of the other details because this is really kind of what we need to get going to move forward with everything else,\" she said. \"It's been quite receptive to our proposal and their response in terms of, you know, seeing things that we want to change and perhaps them even proposing different things when it comes to season footprint and number of games. As we see the expansion of these teams, we're going to be playing more teams.\n\n\"Right now, we're prioritizing salary and salary systems.\"\n\nWhat is something we would like to see added to the CBA?\n\nAs we mentioned earlier this year, the rules for draft eligibility might need to be updated and simplified. In the current system, college seniors and juniors who turn 22 in the year of the draft (or are set to graduate within three months of the draft) can declare. Meanwhile, international players who don't play in the United States college system are first eligible for the draft in the year they turn 20.\n\nPerhaps the WNBA could consider having similar rules to MLB and college baseball, where players are draft-eligible after their junior season or when they turn 21, whichever comes first.\n\n\"That's come up in conversations ... exploring what the age limit can be,\" Ogwumike said earlier this year."
  },
  {
    "source": "ESPN",
    "title": "WNBA playoffs 2025: Which teams have clinched berths",
    "url": "https://www.espn.com/wnba/story/_/id/46074109/wnba-playoffs-2025-which-teams-clinched-postseason-berth",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nEight teams advance to the 2025 WNBA playoffs, and the bracket is filling up.\n\nThe regular season wraps up Sept. 11, and we're tracking which teams have secured a spot in the postseason, which opens Sept. 14.\n\nThe Connecticut Sun, Dallas Wings, Chicago Sky and Washington Mystics have been eliminated from the playoff race.\n\nHere's a look at the teams that have clinched a playoff berth.\n\nPlayoff schedule | How the playoffs work | ESPN's WNBA BPI\n\nHow they got here: Expectations were low for the WNBA's first expansion team since 2008, especially after what many considered underwhelming performances in the expansion draft and April draft. But the Valkyries have done nothing but make history. They became the first team in women's sports history to sell 15,000 season-ticket deposits. They sold out all 22 home games and are leading the league in attendance in their inaugural season. And now they're the first WNBA expansion franchise to reach the playoffs in its first season. On Thursday, Golden State locked up its postseason berth with a win, which also marked the first five-game win streak in franchise history. First-year head coach Natalie Nakase is a top contender for the WNBA's Coach of the Year award and Veronica Burton might be the front-runner for Most Improved Player.\n\nKey stat: For the first two months of the season, Kayla Thornton led Golden State in scoring (14.0 PPG) and rebounding (7.0). But after playing in her first All-Star Game, Thornton suffered a season-ending knee injury in practice. Despite losing that sort of production, the Valkyries have rebounded to go 13-6 since. Burton, in particular, has stepped up, and now leads the team with 11.9 points and 5.9 assists per game. But balance is key, as nine active players average at least 7.0 points and everyone on the roster is capable of meeting the moment.\n\nThere it is: Golden State beats Dallas 84-80 and is on its way to the playoffs in its first season.\n\n\n\nPretty incredible what this team made of sixth women, international players and rookies have done behind the leadership of Natalie Nakase. — Kendra Andrews (@kendra__andrews) September 5, 2025\n\nHow they made it: Like the Lynx, the Liberty opened the season with nine consecutive victories. They were 15-6 at the All-Star break and signed 2019 WNBA Finals MVP Emma Meesseman on July 21, a move that was supposed to make the defending champs the favorite going forward. But the Liberty closed July and opened August on a four-game losing streak that coincided with the start of an injury absence from Breanna Stewart, who sustained a bone bruise in her right knee on July 26. New York is 3-7 in its past 10 games, falling to as low as fifth in the WNBA standings.\n\nKey stat: Stewart sat out 13 consecutive games because of her injury, and WNBA Finals MVP Jonquel Jones (played in 28 of 41 games so far) and Nyara Sabally (appeared in 15 games) have also sat out significant time because of injuries. Sabrina Ionescu (toe) sat out her third straight game Tuesday.\n\nEmily Johnson for ESPN\n\nHow they made it: A six-game winning streak from July 30 to Aug. 15 propelled the Dream up the WNBA standings, even to the No. 2 spot at times. Despite returning guards Jordin Canada, Allisha Gray and Rhyne Howard, Atlanta opened the season as a bit of a mystery. In the offseason, Atlanta brought in new coach Karl Smesko -- who made the jump to the WNBA from Florida Gulf Coast and is known for a pace-and-space offense -- and signed free agent post players Brittney Griner and Brionna Jones. The result is one of the WNBA's most talented rosters, the top rebounding team in the league and the franchise's 11th trip to the postseason. Atlanta, which is eagerly awaiting the return of point guard Canada, who suffered a hamstring injury Aug. 10, clinched its postseason berth with a win over Dallas on Aug. 29.\n\nKey stat: Gray is a former Olympic gold medalist (3x3), WNBA Rookie of the Year and All-Star. And yet, she's having a career year. Her 18.7 PPG are three more than she averaged in 2024.\n\nHow they made it: This is what the Mercury front office was hoping for when it brought perennial MVP contender Alyssa Thomas and All-Star Satou Sabally to the desert in a four-team trade in the offseason. Along with Kahleah Copper, the duo has Phoenix back in the playoffs and jockeying for the right to host first-round games. Phoenix's big three each average at least 15.8 points, with Sabally leading the way at 16.7 per game and Thomas averaging a team-high 9.0 rebounds and 9.2 assists. The Mercury have won eight of their past 11 games. Idle Phoenix secured its playoff berth when Atlanta won on Aug. 29.\n\nKey stat: Sabally is nicknamed The Unicorn for her diverse skill set and size, but no one in the league is more versatile than Thomas. She has seven triple-doubles this season, breaking her own single-season WNBA record (six in 2023). Last week, she became the only player in WNBA history to tally at least 10 points, 15 rebounds and 15 assists in a game. She is the first player in WNBA or NBA history with at least 12 rebounds and 15 assists in consecutive games. Thomas has 18 career triple-doubles -- and counting.\n\nplay 1:43 Alyssa Thomas breaks her own record with 7th triple-double of season Alyssa Thomas drops 12 points, 16 rebounds and 15 assists for her seventh triple-double of the season, breaking her own single-season WNBA record.\n\nHow they made it: The Aces didn't look like a contender, much less a playoff team, for the first two months of the season. Las Vegas suffered a three-game losing streak in mid-June and was .500 at the All-Star break. But after suffering a 53-point home loss to Minnesota -- which set the WNBA record for largest road win -- on Aug. 2, the Aces have won 11 consecutive games to become the second team to clinch a playoff bid this season. And now they're in a good position to host first-round games.\n\nKey stat: A'ja Wilson has scored at least 30 points in five of the 11 straight victories as the MVP race heats up. On Aug. 10, the reigning MVP became the first player in WNBA history to have a 30-point, 20-rebound game.\n\nA'ja Wilson has been on a TEAR 😤 pic.twitter.com/FQzQcNtBhW — espnW (@espnW) August 23, 2025\n\nHow they made it: Behind Napheesa Collier, the MVP front-runner for most of the season, the Lynx have held a commanding lead at the top of the standings. Minnesota opened the season with nine consecutive victories and won 17 of its first 19 games.\n\nThe enhanced ESPN App Watch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nOn Aug. 12, the Lynx became the first team to clinch a playoff spot.\n\nKey stat: For the first three months of the regular season, the Lynx didn't drop back-to-back games, a streak that ended last week with road losses against New York and Atlanta. Those occurred while Collier was out, but Minnesota went 5-2 while she was sidelined for three weeks with an ankle injury."
  },
  {
    "source": "ESPN",
    "title": "Dream's Rhyne Howard ties WNBA mark again with 9 3-pointers",
    "url": "https://www.espn.com/wnba/story/_/id/46171454/dream-rhyne-howard-ties-wnba-mark-again-9-3-pointers",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nAtlanta Dream guard Rhyne Howard tied the WNBA single-game record with nine 3-pointers Friday, becoming the first player in league history to do that more than once.\n\nHoward finished with 37 points as the host Dream beat the Los Angeles Sparks 104-85, guaranteeing Atlanta home-court advantage in the first round of the playoffs. Howard was 13-of-26, including 9-of-17 from behind the arc. She also made nine 3-pointers June 13 in an 88-70 victory over the Chicago Sky. Both games were in Atlanta.\n\nThere have been six games, including the playoffs and Commissioner's Cup finals, in which a WNBA player has made nine 3-pointers.\n\n\"I think it forces people to put me in that conversation with the best shooters,\" said Howard, who is in her fourth season at age 25. \"Because you can't leave that off. Nobody's ever done it until I got here.\"\n\nHoward, the No. 1 pick and Rookie of the Year out of Kentucky in 2022, also credited first-year Dream coach Karl Smesko. His offensive system, which was successful for many years at Florida Gulf Coast, has translated well in his first season in the WNBA.\n\nThe Dream had 19 3-pointers Friday, tying the New York Liberty for the regular-season record. The Las Vegas Aces hit 23 3-pointers in a playoff game in 2022.\n\n\"As far as the system, I knew it was going to be great for me,\" Howard said of playing for Smesko. \"Everybody was like, 'He likes 3s and layups.' Everybody knows I like 3s. I'm going to get them up, but the fact that I can still continue to hit them consistently, that's the most important part.\"\n\nHoward has 97 3-pointers despite missing 11 games because of injury this season. She sat out 10 consecutive regular-season games and the WNBA All-Star Game because of a knee injury before returning Aug. 10.\n\n\"It was just a remarkable game by Rhy,\" Smesko said. \"You get a sense she's feeling real comfortable about her release, and she's being aggressive, looking for good shots. When she really gets in a rhythm, she can go on some pretty amazing streaks like she did today.\"\n\nDream All-Star guard Allisha Gray, who has 93 3-pointers this season, has missed the past two games because of a knee injury. But that hasn't slowed Atlanta, which has won six of its past seven.\n\nThe Dream (28-14) are vying for the No. 2 seed behind the Minnesota Lynx, who have clinched the top seed. Las Vegas and Phoenix are both 27-14.\n\nAtlanta will have its first postseason game at home since Sept. 4, 2018, when it lost Game 5 of the semifinals to Washington. Atlanta did not make the playoffs from 2019 to 2022 then lost 2-0 in a first-round series at Dallas in 2023 and at New York last year. This season, the WNBA is moving to a 1-1-1 format for the first round, so every playoff team will have at least one home game."
  },
  {
    "source": "ESPN",
    "title": "Valkyries first WNBA expansion team to reach playoffs in inaugural season",
    "url": "https://www.espn.com/wnba/story/_/id/46161843/valkyries-first-wnba-expansion-team-reach-playoffs-inaugural-season",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nSAN FRANCISCO -- The Golden State Valkyries made history Thursday night as they became the first WNBA expansion franchise to make the playoffs in its inaugural season.\n\nThe Valkyries clinched the berth after beating the Dallas Wings 84-80 at Chase Center.\n\n\"A lot of people didn't believe in us, (and) it lights a fire in us,\" forward Janelle Salaun said. \"It's a good thing. It's better to start as the underdog and prove it to everyone. I know the girls on this team have (always) been in this position. It's something that we are used to, and we did it as a group.\"\n\nVeronica Burton squared up against 2025 No. 1 draft pick Paige Bueckers as the game clock ticked down to under 30 seconds left in the game and Golden State up by just two points.\n\nBurton started working toward her right, dragging Bueckers inside the 3-point line with her. Burton tried to shake her, and as Grace Berger reached as the help defender, Burton fought through the contact and threw up a circus shot.\n\n\"I kind of blacked out,\" Burton said, laughing.\n\nAs the ball went in, she punched the air, and Ballhalla erupted as the Valkyries went up four, all but deciding the game.\n\n\"I don't even know what I was feeling. ... I was just trying to get a bucket when it mattered in crunch time,\" Burton said. \"I wasn't looking for the foul, I was just looking to finish. ... It was a huge help having everyone instill a bunch of confidence in me.\"\n\nBurton finished with 15 points on 5-of-10 shooting and five assists. Salaun led the team with 19 points, and Carla Leite had 15 points on 6-of-8 shooting and a plus-28 net rating.\n\nAfter the final buzzer, the players gathered at center court and put on T-shirts that read \"Playoffs 2025.\" Fans refused to leave the stands, dancing to Rihanna's \"This Is What You Came For.\" Salaun grabbed the arena mic and yelled, \"Let's Goooo,\" and inside the locker room, players doused each other with water.\n\nValkyries coach Natalie Nakase watched the celebration from what she considered a healthy distance, knowing she would let the team have this moment, but tomorrow it would be right back to the film room.\n\nGolden State has just three games remaining on its regular-season schedule -- two against the league-leading Minnesota Lynx -- and each is crucial to secure seeding and not fall to the seventh or eighth spot in the standings.\n\n\"I know, I'm a party pooper,\" Nakase said.\n\nShe added: \"We're not done yet. Maybe after the season, after this is all done, I'll reflect ... I've got to stay present. I've got to stay where my feet are ... and I think that's why we've been able to do what we do, because we stay present. I don't really allow them to celebrate. They can obviously enjoy this, but I also keep them humble. Y'all want to continue to make strides? Then let's stay focused.\"\n\nThere was plenty of celebrating on the Valkyries bench Thursday night as Golden State became the first expansion team in WNBA history to make the playoffs in its first year. Photo by Ezra Shaw/Getty Images\n\nDespite being a \"start-up\" team, the Valkyries have been confident in themselves since they reported to camp in April. With a roster made up of former sixth women and role players, international stars and young rookies, the common conclusion was that it would take time -- at least a season -- for Golden State to find its footing. That's how most other expansion teams start out, like when the Atlanta Dream joined the WNBA in 2008 as the league's last expansion team.\n\nBut the Valkyries made it clear they were writing their own story and did not want to be compared to expansion teams before them. They used the doubt as fuel.\n\n\"I told the girls this: We picked you guys for this reason -- to do things for the first (time),\" Nakase said.\n\nGolden State has broken several records throughout its first season. First, it became the first team in women's sports history to eclipse 15,000 season-ticket deposits. It led the league in attendance, selling out all 22 of its home games in Chase Center, which seats over 18,000. Now, it's the first expansion team competing in the playoffs.\n\n\"This is awesome, honestly,\" Burton said. \"It's a testament to all of the work that we put in, a testament to the belief that our coaching staff had in us; Ohemaa [Nyanin], the front office, all of them. To do it with the group that we did, we're just enjoying it, soaking it in. Obviously, there is a long road ahead of us, but (we're) able to sit and enjoy it.\"\n\nBecause of a scheduling conflict, the Valkyries will not play their first home playoff game at Chase Center. Instead, Game 2 will be hosted at the SAP Center in San Jose, 48.4 miles from San Francisco.\n\n\"We can't control it,\" Burton said. \"We have faith in our fans that they are going to continue to show out for us. Wherever we play, we're going to bring our basketball. We're confident, we're excited for the opportunity to compete. Regardless of where we're at, we're going to show up.\"\n\nWho the Valkyries will face in the first round is still up in the air. They currently sit in the sixth seed, one game behind the New York Liberty. The Seattle Storm are a game and a half behind the Valkyries in seventh. The Dream, Phoenix Mercury and Las Vegas Aces are in a heated race from the second, third and fourth seeds."
  },
  {
    "source": "ESPN",
    "title": "WNBA playoff schedule 2025: Postseason tips Sept. 14",
    "url": "https://www.espn.com/wnba/story/_/id/46030946/wnba-playoffs-schedule-2025-games-first-round-semifinals-finals-scores-results-news-highlights",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nThe 2025 WNBA playoffs open Sept. 14. Through Tuesday's games, the league-leading Minnesota Lynx are the only team to have officially clinched a postseason berth. The top eight teams advance. The Connecticut Sun, Dallas Wings and Chicago Sky have been eliminated from the playoff race.\n\nThe best-of-three first round is a 1-1-1 format, with the higher seed hosting Game 1 and, if necessary, Game 3. The semifinals, a best-of-five format, are 2-2-1, with the higher seed hosting Games 1, 2 and 5.\n\nFor the first time, the WNBA Finals will expand to a best-of-seven series and will have a 2-2-1-1-1 structure, in which the higher seed would host Games 1, 2, 5 and 7.\n\nTrack the playoff race with our WNBA standings page. We'll update playoff matchups as they're decided. The regular season wraps up Sept. 11.\n\nWhich teams have clinched a spot in the playoffs\n\nFirst Round\n\nSunday, Sept. 14\n\nGame 1: 1 p.m. ET (ESPN)\n\nGame 1: 3 p.m. ET (ABC)\n\nGame 1: 5 p.m. ET (ESPN)\n\nGame 1: 10 p.m. ET (ESPN)\n\nTuesday, Sept. 16\n\nGame 2: 7:30 p.m. ET (ESPN)\n\nGame 2: 9:30 p.m. ET (ESPN)\n\nWednesday, Sept. 17\n\nGame 2: 7:30 p.m. ET (ESPN)\n\nGame 2: 9:30 p.m. ET (ESPN)\n\nThursday, Sept. 18\n\nGame 3*: 7:30 p.m. ET (ESPN2)\n\nGame 3*: 9:30 p.m. ET (ESPN2)\n\nFriday, Sept. 19\n\nGame 3*: 7:30 p.m. ET (ESPN2)\n\nGame 3*: 9:30 p.m. ET (ESPN2)\n\n* If necessary\n\nSemifinals\n\nSunday, Sept. 21\n\nGame 1: 3 p.m. ET (ABC)\n\nGame 1: 5 p.m. ET (ESPN)\n\nAll of ESPN. All in one place. Watch your favorite events in the newly enhanced ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nTuesday, Sept. 23\n\nGame 2: 7:30 p.m. ET (ESPN)\n\nGame 2: 9:30 p.m. ET (ESPN)\n\nFriday, Sept. 26\n\nGame 3: 7:30 p.m. ET (ESPN2)\n\nGame 3: 9:30 p.m. ET (ESPN2)\n\nSunday, Sept. 28\n\nGame 4*: 1 or 5 p.m. ET (ESPN)\n\nGame 4*: 3 p.m. ET (ABC)\n\nTuesday, Sept. 30\n\nGame 5*: TBD (TBD)\n\nGame 5*: TBD (TBD)\n\n* If necessary\n\nWNBA Finals\n\nFriday, Oct. 3\n\nGame 1: 8 p.m. ET (ESPN)\n\nSunday, Oct. 5\n\nGame 2: 3 p.m. ET (ABC)\n\nWednesday, Oct. 8\n\nGame 3: 8 p.m. ET (ESPN)\n\nFriday, Oct. 10\n\nGame 4: 8 p.m. ET (ESPN)\n\nSunday, Oct. 12\n\nGame 5*: 3 p.m. ET (ABC)\n\nWednesday, Oct. 15\n\nGame 6*: 8 p.m. ET (ESPN)\n\nFriday, Oct. 17\n\nGame 7*: 8 p.m. ET (ESPN)\n\n* If necessary"
  },
  {
    "source": "ESPN",
    "title": "Life on the WNBA fringe: Suitcases, sacrifice, soul-searching",
    "url": "https://www.espn.com/wnba/story/_/id/46082100/wnba-players-fringe-waived-signed-released",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nFOR TWO YEARS, Haley Jones reserved a drawer for her Atlanta Dream gear. In a span of 16 days, she cleared out two more drawers for two more teams. Julie Vanloo sped across 3,000 miles to sit and wait for a job offer she might never get. Shyanne Sellers -- she knows it sounds awful -- felt a twinge of hope when she saw somebody get hurt. Seven words from a basketball icon -- You're not ready for the league yet -- haunted Harmoni Turner. Diamond DeShields felt mocked by her own juicer that barely had time to juice.\n\nFive players. Twenty transactions. Seventeen states. Four countries. Eighty-six days. This is life on the fringe of the WNBA.\n\nJONES STANDS JUST beyond the 3-point line and watches as her former teammates on the Atlanta Dream smother one of her new teammates on the Dallas Wings.\n\nThere's 3:42 to go in the July 30 game, and Dallas is down 76-74 with six seconds on the shot clock. Wings veteran Arike Ogunbowale manages to find an opening in the Dream's defense and kicks the ball out to Jones, but the pass is high and it slips through her fingers. Jones retrieves it near the logo with three seconds left on the shot clock. She whips around. She barely has time to recenter herself. She squats and launches.\n\nThe ball arches across nearly half the court and lands squarely inside the net. Paige Bueckers, standing underneath the hoop, punches her right fist in the air to celebrate her new teammate's good fortune and the Wings' one-point lead. Jones laughs out loud. It's her 10th game with the Wings, the eighth since she signed her rest-of-season contract 21 days earlier. In 31 minutes, she scored 12 points on 5-of-8 shooting and added three assists and three rebounds, but the Wings fell 88-85.\n\nStill, social media erupted with comments about how the Dream made a huge mistake when they waived the sixth overall pick in the 2023 draft right before the 2025 season.\n\nAtlanta was the only home Jones had known since she graduated from Stanford and moved out of the Bay Area. She'd settled in Atlanta with her partner, who had taken a job there to live with her. She'd even bought an investment property in the city. She was looking forward to expanding her role during her third season with the Dream.\n\nThen, on the second-to-last day of training camp, Jones became the last player on the team to be waived. Over the next 56 days, she flew from Atlanta back home to the Bay Area, then to Phoenix, then back home, then to Dallas and then back home before returning to Dallas again. She lived in four states, pingponged some 7,000 miles between homes, played on three teams and found herself unemployed three times.\n\n\"That was a roller coaster, what?\" Jones said, dragging the word \"what\" almost like she's shocked by the amount of change she's been through in a matter of months.\n\nHaley Jones, the sixth pick in the 2023 draft, was released by Atlanta and then by Phoenix before finishing her season in a starting role for Dallas. David Becker/NBAE via Getty Images\n\nWild as it sounds, Jones' journey isn't all that unique.\n\nThe WNBA consists of 13 teams. Each team -- according to the CBA -- can have a maximum of 12 players, meaning a playing workforce of 156 at most. In 2025, 38 players were drafted into the league that had 151 returning players. Econ 101: the supply is greater than the demand. Most years, fewer than half of the draftees land a roster spot for opening day. In 2025, 20 draftees made it until opening day, up from 13 of 36 in 2024. In 2023, it was 15. Unlike the NBA, which allows teams to carry 15 players, the WNBA doesn't have a minor league system or a developmental league. So players who are released are often unmoored, unemployed and unhappy.\n\nBut here's the thing: roster spots regularly open up in the WNBA -- sometimes even shortly before the playoffs -- because the CBA mandates that teams carry a minimum of 11 players. Injuries and player commitments to national teams create regular opportunities for employment, a carrot for players on the fringe. Think of it as temp work that comes with a quandary. Should players on the league's fringe wait around hoping to get another shot? Should they abandon their WNBA aspirations, maybe even their basketball dreams altogether? Get another job? And if they opt to stick it out, where do they live? Who do they train with? And how can they pay their bills? Not to mention the biggest question of all: Will they ever be good enough to secure a steady job in the WNBA?\n\n\"You feel shock, you feel embarrassment,\" Jones said. \"And then it's a lot of life you gotta figure out.\"\n\nDiamond DeShields won a WNBA championship with Chicago in 2021 and expected to be one of the faces of the Connecticut franchise in 2025. Matt Marton-USA TODAY Sports\n\nFIRST THINGS FIRST, DeShields thought. How do I get home? And, should I take my juicer?\n\nDon't blame DeShields for being a bit scattered after she was released by the Connecticut Sun on May 15. She's a former league All-Star, a former WNBA champion. And she didn't see the shoe that was about to drop.\n\n\"Everything was about me having a leadership role and being one of the vets on the team,\" said DeShields, who had signed a one-year contract with the Sun in February.\n\nHer face, she said, was plastered all over the Mohegan Sun walls. She had shot promo videos with the team just days earlier. Every conversation revolved around her long-term progress with the team, she said.\n\nThen she was called in and let go.\n\nIn a career that has been full of notable moments, this was a first. She was the third overall pick in the 2018 draft. She was named a WNBA All-Star in 2019. Later that year, she was diagnosed with a benign tumor in her spinal cord. She underwent a nine-hour surgery and had to learn how to walk again. She made it back to the league for 13 games in 2020. In 2021, she helped the Chicago Sky win the franchise's first championship. Now, after a minor ankle sprain that had hampered her during training camp, she was unemployed. And soon to be evicted.\n\nDeShields sat on her bed in the apartment the Sun had provided for her and took stock of her space. Her juicer, her workout equipment, her many, many bags of clothes she'd carefully arranged in what she thought would be her home for the next year stared at her as though they were mocking her.\n\nShe called an Uber. She needed to get to a rental car lot so she could find a car that could carry all of her stuff 1,000 miles back to Atlanta. The Sun, she said, offered her a coach ticket back home, which is mandated in the CBA, but wouldn't cover all her shipping expenses.\n\n\"The team will ship three to five boxes,\" she said. \"But I have more than three to five boxes worth of stuff.\"\n\nI need to pack up and drive back home.\n\nThe trouble was, she couldn't find anything to drive. The first rental place didn't have a vehicle big enough. Ditto at the second and the third and the fourth.\n\nDejected, she sat outside her final stop and recorded a video. \"Getting waived is crazy, because what do you do after you get waived?\" she asks, looking this way and that way but never directly at the camera.\n\nShe posted the video on Instagram, hoping somebody could help her find a way out of her predicament. Then she reached out to the Sun, who connected her to a rental car company they had a partnership with.\n\n\"In my mind, I'm like, 'Well, that would have just been much easier to know from the jump,'\" DeShields said.\n\nThankfully, they had a truck that would do the trick. For the next several hours she packed up her apartment and squeezed it into her rental. Early the next morning, she drove 15 hours south to Atlanta, only stopping to take restroom and meal breaks.\n\nWhen she arrived back home, a to-do list began to take form.\n\nJulie Vanloo took a roundabout trip from Golden State to Los Angeles -- via New York -- before settling in for a rest-of-season run with the Sparks. Juan Ocampo/NBAE via Getty Images\n\nIN HER NINTH game with the expansion Golden State Valkyries this season, Vanloo dished out eight assists in an eight-point win over the Los Angeles Sparks. After that June 9 game, the second-year WNBA player flew overseas to play for Belgium in the FIBA Women's EuroBasket tournament. Vanloo helped lead Belgium to its second straight title and then skipped the celebrations and got on a plane to rejoin her Valkyries teammates in America. On June 30, an hour after landing in California, the Valkyries waived her. Wish I had known that a day ago, Vanloo thought.\n\nShe didn't have a home and she didn't wallow in the what-ifs. She called her agent, who told her there was a chance the Sparks could have a roster spot for her. She didn't sit around and wait.\n\nVanloo bought a ticket (with her own money), packed a suitcase and got on a plane to New York because the Sparks were playing the Liberty in Brooklyn on July 3.\n\n\"If I have to pay for a flight and go to New York, fly all night to be there and be ready, I'll do it,\" Vanloo said.\n\nShe arrived at Barclays Center early -- she worried she would get stuck in traffic and be late for a job she didn't even have -- and sat outside the entrance for two hours all in the hopes that the Sparks might call. She pulled out her cell phone and watched the time tick away until 5 p.m., when her two-day waiver timeline would elapse.\n\nHer agent called her shortly after 5 and told her that Sparks general manager Raegan Pebley was on her way to get her.\n\n\"Welcome to the Sparks,\" Pebley said.\n\nA wave of happiness and relief flooded Vanloo. Her past four days flashed in front of her eyes: the gold medal, the waiver, the doubt and now the new opportunity.\n\nTwo hours later, she was suited up and on the Barclays floor and played two minutes.\n\nThen she flew to Indiana with the team for its July 5 game against the Indiana Fever. She entered the game with 1:53 to go in the first quarter. Forty-six seconds later, she rattled in a 3-pointer from the wing, her first points for the Sparks.\n\nShe returned to California, this time to L.A., and moved into her team-assigned apartment. In many ways, she feels like she's home. She reunited with Julie Allemand, her Belgian teammate, with whom she'd just won the EuroBasket title. She has played 21 games for the Sparks so far, averaging 10.6 minutes and 2.6 points.\n\nThe Aug. 9 game, Sparks at Golden State, was particularly emotional. Being a visitor in her former home, she said, felt strange. She reached out to the fans the day before.\n\n\"Tomorrow I'm going to be back in Chase Center,\" Vanloo wrote in an Instagram story. \"I can't wait to see you all again. No matter what, Valks fans have a very special place in my heart.\"\n\nValkyries coach Natalie Nakase said she feels like a \"proud parent\" that Vanloo and other players who didn't make her roster are contributing elsewhere. The problem isn't with the players, she says, it's with the rules.\n\n\"We need more roster spots,\" Nakase said. \"These girls deserve roster spots.\"\n\nNow Vanloo is hoping to prolong her up-and-down season by helping the Sparks secure a playoff spot. The close call has given way to an important perspective.\n\n\"I'll do anything,\" Vanloo said, \"for my dream.\"\n\nShyanne Sellers felt like she achieved her childhood dream on April 14 when she was drafted by Golden State. By May 12, she had been released by two teams. Vincent Carchietta-Imagn Images\n\nSELLERS WIPED AWAY a tear when WNBA commissioner Cathy Engelbert called her name as the 17th overall selection in the 2025 April 14 draft. Wearing a light blue suit, Sellers walked to the stage, posed for photos and held a Golden State Valkyries jersey for the cameras.\n\nNineteen days later, she was gone. \"We're going to release you,\" Valkyries GM Ohemaa Nyanin said. \"You've done everything we've asked of you -- but we're going to let you go.\"\n\nFairytale endings are hard to come by for players on the fringe. Especially rookies on the fringe.\n\nSellers, a former Maryland star, had put her belongings in storage before flying to the Valkyries training camp. Now she was unsure where home even was.\n\nShe knew she needed to pack up the bags she brought to camp, and she knew she needed to book a flight. But to where?\n\nShould she join her fiancee in New Jersey? Maybe go spend time with her dad, former NBA player Brad Sellers, in Ohio? Question after question floated in her brain as she walked out of the coaches office toward her hotel room.\n\nShe called her agent, who told her to stay put until they figured out if other teams had interest. A day later, tired of waiting, she told them she was flying to New Jersey.\n\n\"I was like, alright, I just want to get myself together -- do laundry. Like, I've been living out of a suitcase for a month at this point,\" Sellers said.\n\nHer clothes still had that fresh scent when her agent called and said the Dream wanted to sign her. She repacked her suitcase -- this time just a single one -- kissed her fiancee goodbye and got on a plane to Atlanta 12 hours after she arrived in Jersey. She joined the Dream on May 5.\n\nA week later, on May 12, she was released. She heard the same words again, this time from a different GM. Thank you for coming, we're going to release you.\n\nThat same day, she got on a plane but rerouted to her father's house in Warrensville Heights, Ohio, where he serves as the town's mayor. She spent the next few weeks paying out of pocket to rehab her tweaked right knee.\n\nAt Maryland, she was the first player to have 1,500 points, 500 rebounds and 500 assists. Now she might not even get a field goal attempt this season in the WNBA. She kept going back to one thought: Two teams waived me in a matter of weeks. What are the chances a third team will take a chance on me?\n\nFellow 2025 draftee Harmoni Turner, a flashy guard straight out of Harvard, thought she'd only need one coach to take a chance on her. Drafted by the Aces in the third round, one day she was geeking out about getting a text from her new teammate A'ja Wilson, the next day she was a former WNBA player who didn't make it out of training camp.\n\n\"You're not ready for the league yet,\" Aces coach Becky Hammon told her.\n\nTurner went back to Harvard, completed some classwork and participated in graduation ceremonies. Then she moved back in with her parents in Mansfield, Texas. She didn't even have a paystub to show for her time in Las Vegas. In accordance with the CBA, she received just a stipend for lodging, meals and travel.\n\nEvery time somebody back home asked, \"What's next for you?\" she took it to mean that they thought her basketball career was over -- that they were looking for a new answer from her.\n\nMaybe I should quit, she kept thinking.\n\nHarvard's Harmoni Turner tried to block out all things WNBA after she was released by the Aces out of training camp. Erica Denhoff/Icon Sportswire\n\nVANLOO IS ONE of the lucky ones. Waived, picked up and now contributing for a new team. But for many fringe players, the soul-searching begins after the chaos of getting released ends.\n\nDeShields couldn't stomach the idea of sitting around Atlanta waiting for her phone to ring.\n\nAfter spending a week back home, she decided to move to Los Angeles to work with a trainer and physio she knew. Because the Sun released her for medical reasons, they owed her a percentage of her salary, about $20,000, but that wouldn't last long in L.A. She carefully budgeted her travel and training expenses and reached out to some WNBA friends in the L.A. area who might be able to help her find a place to stay. Lexie Brown, a childhood pal and former teammate who is playing for the Storm in Seattle, offered DeShields her L.A. apartment. DeShields thanked the universe for Brown's generosity and for her lucky break. She moved to the West Coast.\n\nWeeks later, she signed a contract with OGM Ormanspor, a professional team that plays in the Turkey Women's Basketball Super League in Ankara. She left earlier this week and will return next spring just in time for WNBA training camps. The setback has made her goal even clearer.\n\n\"When I get back on the court, I plan on making an impact,\" DeShields said. \"I'll definitely be back playing next summer.\"\n\nIt took Turner a bit more time to figure things out.\n\nWhen she got back to Texas, she worked out with a personal trainer two hours a day, but she kept asking herself, \"What was the point of this workout?\" USA Basketball invited her to play in a 3x3 tournament in Washington D.C., but her heart wasn't in it. Hammon's voice kept ringing in her brain. On the one hand, she felt immense gratitude to Hammon for taking a shot on her. But those words stung.\n\nWhen she wasn't in the gym, she stayed home and fixated on the future. She muted any news about the WNBA on her social media. She couldn't bear to see people getting re-signed and getting second chances. The thought of watching the season made her stomach curdle, so she distanced herself. She went out with friends practically every night to avoid the games.\n\nBut basketball's pull was too great. One day, she made a promise to herself: I will spend the next seven to eight months getting stronger, bigger and more physical. I will get a call for training camp next season. I will show Hammon -- and everybody else -- what I am capable of doing.\n\nShe signed with Landerneau, a team in the French league. She got on a call with head coach Wani Muganguzi. He told her all the right things. They loved her unorthodox style of play and wanted to help her develop.\n\nShe left for France on Aug. 12.\n\n\"[I'm going to use] those stumbling blocks as stepping stones to get back to the W,\" she said. \"But not only get back to the W, but dominate at a level that shocks everybody.\"\n\nUnlike Turner, Sellers loves watching her friends and former teammates in the WNBA. After she was waived for the second time, she started texting them -- Diamond Miller, Brionna Jones, Shatori Walker-Kimbrough -- and absorbed their perspectives on how to keep believing. \"Your time will come,\" they told her.\n\nShe found a small gym in northern New Jersey near her fiancee's house. She also regularly went to her fiancee's mom's AAU gym to keep developing her skills.\n\n\"The world's not over because I didn't make the WNBA on my first try,\" Sellers said.\n\nSome days, she heard news of a player getting injured and she stared at her phone wondering if she'd get a call to become their replacement. She's not the kind of person to wish an injury on anybody, but she's aware of how -- in a perverse way -- news of an injury makes her hope.\n\nShe knows what she wants. And she's willing to wait. And work.\n\n\"I've always told people, there is no plan B to basketball -- it's just basketball,\" Sellers said. \"That's just kind of what you're waiting on... is someone to give you a chance.\"\n\n\"That was a roller coaster,\" Haley Jones says of the first part of her 2025 season. Michael Gonzales/NBAE via Getty Images\n\nJONES FOUND A second and then a third team to give her a chance. And as grateful as she is, life on the fringe has created some serious snarls.\n\nAtlanta, where she spent the first two seasons of her career, had become her home. Now Atlanta didn't want her.\n\nAfter she was released, she moved back home to Santa Cruz, California, so she could work with her trainer and physio. She remembers first going back to her team-assigned apartment and sorting her life's belongings into piles. What do I need for the immediate future? What can I leave behind?\n\nTurns out her partner was one of the things she had to leave behind. He stayed in Atlanta, moved into their rental property (along with many of Jones' belongings) and kept his job until he started law school in the fall.\n\nTwo weeks after Jones returned to her parents' home, she signed a hardship contract with the Phoenix Mercury. She knew what she was getting into: She would be there for a week or so to fill the gap while Alyssa Thomas and Natasha Mack recovered from their injuries. Their return would mean a full roster and no room for Jones. It wasn't ideal, but she wanted to keep playing. She took it as a networking opportunity and developed friendships with the players and met with coaches. Then, four games and a week later, on June 8, she returned home to the Bay Area. She'd done what was asked of her, and she was onto finding her next gig.\n\nA week later, on June 17, she heard from the Wings. It was another hardship contract, this time to help bridge injury absences and departures of players representing their national teams. She played two games before she was waived to make space for the European players who were returning to Dallas.\n\nJones packed her suitcase and returned to the Bay Area. Again. She still believed she could land a roster spot. Somewhere. But the discourse online bothered her. \"If you don't know the W, you're like, 'Haley keeps getting cut,'\" Jones said. \"But the reality of a hardship contract is that I was there to fill a role.\" Nothing more. Nothing less.\n\nJones stopped looking at the internet and continued training.\n\nAlmost two months after she was waived by the Dream, Jones received another call from the Wings. This time, they offered her a contract to play through the end of the season. She triple-checked with them that it was not another hardship contract before she allowed herself to get excited. She quickly packed two suitcases and a carry-on bag, flew to Dallas and signed on July 9. She brought mostly cotton and linen outfits that would help her get through the summer in Dallas.\n\nShe and her partner are doing long-distance for the foreseeable future as he pursues law school and she goes after her WNBA dreams that nearly slipped away. She's cautious about putting down roots. But she has learned that home is people, not a place. And she's slowly finding her people in Dallas.\n\nThe past three months, the constant moves and the constant uncertainties have made her more resilient. When she walks onto the court, she doesn't linger much in the past, but neither does she fixate on the future. She plays like today is all she has. And it shows.\n\nIn the 19 games she has played since signing her rest-of-season contract, she's averaging 8.3 points, 3.6 rebounds and 2.3 assists. She started 13 straight. Fine is the line between star and spectator.\n\nBut Dallas, at 9-32, won't make the playoffs this season. Jones' job is secure for three more games. Next season, the league expands to Toronto and Portland. More jobs will be open. Players such as DeShields, Sellers and Turner will be working to land them. A new class of draftees will join the fray.\n\nBack home in the Bay, Jones has a bedroom drawer reserved for her Atlanta Dream swag. This season, she cleared out two more: one for her Mercury swag and another for her Wings swag. Her mom asked her if she'd like to give any of it away to Goodwill, but Jones decided to keep it. She just might need it someday.\n\n\"Who knows what the future holds for me,\" she said."
  },
  {
    "source": "ESPN",
    "title": "WNBA playoff picture 2025: What's on the line in final week?",
    "url": "https://www.espn.com/wnba/story/_/id/46162169/wnba-playoffs-2025-picture-postseason-race-berth",
    "date": "2025-09-07",
    "text": "Open Extended Reactions\n\nThe Las Vegas Aces set a franchise record with their 13th consecutive victory, the Golden State Valkyries became the first expansion team to make the playoffs in a franchise's inaugural season, and Indiana Fever guard Caitlin Clark announced that she will not return this season due to injury.\n\nSuffice to say, it was an eventful Thursday in the WNBA.\n\nSeven days are left in the 2025 regular season, with much still to be determined. Six teams -- the Minnesota Lynx, Las Vegas, Atlanta Dream, Phoenix Mercury, New York Liberty and Golden State -- have clinched postseason berths.\n\nThree teams -- the Seattle Storm, Indiana and Los Angeles Sparks -- are still battling for the final two playoff spots.\n\nDespite their loss to Las Vegas on Thursday, Minnesota already has wrapped up the league's best record and home-court advantage throughout the playoffs. But the Aces are the league's hottest team, while defending champion New York is in danger of not being among the top-four seeds and not having home-court advantage in the best-of-three first round.\n\nAs the final days of the 2025 regular season wind down, here are how things stand for the nine teams that have made the playoffs or are still in contention, and what seed they are likely to get.\n\nJump to: ATL | GS | IND | LV | LA | MIN | NY | PHO | SEA\n\nThe No. 1 seed\n\nMinnesota Lynx (32-9)\n\nRemaining games: @ GS (Sept. 6), @ IND (Sept. 9), vs. GS (Sept. 11)\n\nOutlook: Staying healthy through these last three regular-season games and going into the playoffs strong is the most important thing for the Lynx at this point. Thursday's loss to Las Vegas might irritate the Lynx, but it shouldn't dent their confidence. They were 3-1 in the season series vs. the Aces.\n\nThe most likely candidates for the No. 2 seed\n\nAtlanta Dream (27-14)\n\nRemaining games: vs. LA (Sept. 5), vs. CON (Sept. 8), @ CON (Sept. 10)\n\nOutlook: It looks like Atlanta could finish with three more victories; the Dream are 2-0 against the Sparks and 1-1 against the Sun. Those are the last two teams Atlanta faced: The Dream won at Connecticut by 17 points Monday and defeated Los Angeles at home by 11 on Wednesday. The Dream have the tiebreaker over Phoenix but not against Las Vegas; those are the other top challengers for the No. 2 seed.\n\nThe enhanced ESPN App Watch your favorite events in the newly upgraded ESPN App. Learn more about what plan is right for you. Sign Up Now\n\nLas Vegas Aces (27-14)\n\nRemaining games: vs. CHI (Sept. 7), vs. CHI (Sept. 9), @ LA (Sept. 11)\n\nOutlook: The Aces had a closer-than-expected 79-74 victory at Chicago on Aug. 25, but will be heavily favored in back-to-back games against the Sky in Las Vegas. It's possible Los Angeles will be playing for its playoff life in the regular-season finale. But the Aces could have plenty to play for, too, if they are still trying to secure the No. 2 seed. The Aces also hold the tiebreaker against both Atlanta and Phoenix.\n\nPhoenix Mercury (27-14)\n\nRemaining games: @ CON (Sept. 6), vs. LA (Sept. 9), @ DAL (Sept. 11)\n\nOutlook: The Mercury have won six in a row and eight of their last nine. They might be playing their best basketball of the season, especially with how well Kahleah Copper has played the past month after battling injuries earlier in the season. The Mercury are guaranteed home-court advantage for the first round, but Atlanta and Las Vegas both hold tiebreakers over Phoenix.\n\nA potential No. 4 seed\n\nNew York Liberty (24-17)\n\nRemaining games: @ SEA (Sept. 5), vs. WAS (Sept. 9), @ CHI (Sept. 11)\n\nOutlook: The Liberty are hanging by a thread in pursuit of a top-four seed. New York needs to win its last three games and for Las Vegas to lose all three. More realistically, the Liberty -- who have lost four of their last six -- should focus on holding onto the No. 5 seed, which is not locked up.\n\nplay 1:06 Golden State Valkyries vs. Dallas Wings - Game Highlights Watch the Game Highlights from Golden State Valkyries vs. Dallas Wings, 09/04/2025\n\nThe potential 5-8 seeds\n\nGolden State Valkyries (23-18)\n\nRemaining games: vs. MIN (Sept. 6), @ SEA (Sept. 9), @ MIN (Sept. 11)\n\nOutlook: What a job by the Valkyries to make the postseason in their first year as an expansion team. They could climb to the No. 5 spot but currently sit at No. 6. They still must face the first-place Lynx twice, and while Minnesota isn't playing for anything specific at this point, the Valkyries' other remaining opponent, Seattle, is still trying to nail down its playoff spot.\n\nSeattle Storm (22-20)\n\nRemaining games: vs. NY (Sept. 5), vs. GS (Sept. 9)\n\nOutlook: Typically, the Storm would be in good shape with their last two games at home. But Seattle has a better record on the road this year (13-9) than at home (9-11). As for their last two opponents, the Storm are 2-0 against the Liberty and 1-2 against the Valkyries. The Storm have won five of their last seven games, but they're coming off a very frustrating loss at home to Los Angeles on Monday.\n\nIndiana Fever (21-20)\n\nRemaining games: vs. CHI (Sept. 5), @ WAS (Sept. 7), vs. MIN (Sept. 9)\n\nOutlook: Realistically, Caitlin Clark's absence doesn't change anything that the Fever are doing on court because she hasn't played since mid-July. The question is can they finish strong? Angel Reese, Chicago's leading scorer and rebounder, will miss Friday's matchup with Indiana after picking up her eighth technical foul Wednesday. Washington is already eliminated from the playoffs. Still, the Fever have lost four of their last six, so they are not out of the woods.\n\nLos Angeles Sparks (19-21)\n\nRemaining games: @ ATL (Sept. 5), vs. DAL (Sept. 7), @ PHO (Sept. 9), vs. LV (Sept. 11)\n\nOutlook: The Sparks have the most remaining games of any playoff contender, but three of those are against the teams battling for second place. It will take a big finish for Los Angeles to avoid a fifth straight season missing the playoffs, but it still has some hope."
  },
  {
    "source": "Yahoo",
    "title": "Alyssa Thomas regains single-season assist record a year after losing it to Caitlin Clark",
    "url": "https://sports.yahoo.com/article/alyssa-thomas-regains-single-season-175944468.html",
    "date": "2025-09-07",
    "text": "UNCASVILLE, Conn. (AP) — Alyssa Thomas had no idea that she was closing in on taking back the WNBA's single-season assist record.\n\nShe was just focused on trying to help her team win and improve their playoff positioning.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nShe topped Caitlin Clark's mark of 337 assists set last season, but Thomas' Mercury came up short against the Connecticut Sun on Saturday, falling 87-84.\n\n“Honestly I didn't know that I was even close,” Thomas said. “I didn't focus on that, but definitely credit to my teammates I can't do it without them. It's been a great change for me this year with a new offense that just allows me to go out there and make the reads that I need to make.”\n\nThomas needed six assists coming into Saturday's game against Connecticut, where she starred for so many years before leaving for Phoenix this season as a free agent.\n\n“It was my home for 11 years and it was awesome to be able to do it in front of them,” Thomas said. “It all started here so yeah it's cool, a full-circle moment.”\n\nAdvertisement\n\nAdvertisement Advertisement\n\nShe got the record-breaking one on a 3-pointer by Kathryn Westbeld in the corner with 4:45 left in the second quarter. She finished the game with 10 to give her 342 this season.\n\n“I've been fortunate to be surrounded by so many great 3-point shooters so they make my job easy,” Thomas said. “I hit the open person and the rest is on them to hit the shot. Credit to them they have my back like that.”\n\nThomas held the record in 2023 with 316 assists when she played for Connecticut. Clark broke it a year later as a rookie. Now the 33-year-old Thomas, who also holds the WNBA record for triple-doubles in a season and career, has it back again. She only needed 37 games to reclaim that mark.\n\nWhat's most impressive about Thomas' accomplishment is that she's done it from the forward position. Ever since her time with the Sun, Thomas has been a point-forward, facilitating the Mercury's offense. Many of her assists this year have come on 3-pointers with nearly half of them coming on shots from behind the arc.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nShe's seventh on the league's career assist list with more than 1,800 assists — the only forward in the top 10.\n\nThomas has averaged a career-best 9.2 assists this season, which is short of Courtney Vandersloot's record of 9.95 set in 2020.\n\n___\n\nAP WNBA: https://apnews.com/hub/wnba-basketball"
  },
  {
    "source": "Yahoo",
    "title": "Dream rain threes over Sparks, hand LA second straight loss",
    "url": "https://sports.yahoo.com/article/dream-rain-threes-over-sparks-012426868.html",
    "date": "2025-09-07",
    "text": "Led by Rhyne Howard’s historic night, the Dream scored early and often on Friday, handing the Sparks their second straight loss in the process, 104-85.\n\nDearica Hamby had a big night for LA, carrying the Sparks’ offense at times while totaling 26 points on 11-15 shooting with seven rebounds and five assists. Kelsey Plum had 20 points on 6-15 shooting. Rickea Jackson was an efficient 6-9 from the field and 4-4 at the line to finish with 17 points.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nOn the other side, Rhyne Howard tied the league record for 3-pointers with nine, a record she already shared coming into the night. She finished with 37 points in the contest. As a team, Atlanta shot 19-39 from the 3-point line, tying the league record for threes in a game and far outpacing the Sparks, who shot just 6-22 from range.\n\nPlum and Hamby helped the Sparks to a lead early as they combined for six of the first eight points of the game. Rhyne Howard immediately overturned that with three straight 3-pointers for the Dream, pushing them ahead 11-6.\n\nWhile Hamby tried to keep the Sparks close with an and-one to make it a 19-17 Dream lead, Atlanta used a 12-5 run to open up a nearly double-digit lead. Jackson’s late jumper helped close the gap but the Sparks went into the second trailing by seven.\n\nAfter an early back-and-forth in the second that included Alissa Pili minutes, a 7-0 run for the Dream made it a 41-28 lead for Atlanta and forced an LA timeout, a virtual carbon copy of the second quarter two nights prior between the two teams.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe Sparks did respond with a 7-0 run that included a Plum three and baskets from Hamby and Jackson to make it a five-point game, but Howard scored five straight of her own to make it a double-digit lead again.\n\nIt was all Howard in the first half, who continued her dominance with her seventh 3-pointer of the half followed by a layup, giving her 29 first-half points. Impressively, though, a Plum 3-pointer and a layup by Hamby just before the halftime buzzer kept the Sparks close as they trailed just 56-52 at the break.\n\nThe Sparks continued on in the third and tied the game by scoring six of the first eight points. The teams continued trading baskets with Hamby adding to her big night during that span, leaving the two sides teid at 64-64 at the midway point of the period.\n\nAtlanta then used a 13-0 run from that point, which featured eight points from Maya Caldwell and Howard’s eighth 3-pointer, to make it a double-digit game once more. Howard’s ninth 3-pointer, tying the league record, late in the third quarter helped them maintain that advantage heading into the fourth at 85-72.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe Sparks really started to lose grasp of the rope in the fourth as the offense became more of a struggle. An Allemand 3-pointer midway through the period made it a 92-77 game, but Caldwell responded with another long-range effort of her own.\n\nLA looked out of ideas and out of gas throughout the fourth as Atlanta pulled away and won comfortably.\n\nTakeaways\n\nAs highlighted in the preview, 3-pointers were going to dictate this one. Atlanta outscored LA by 39 points at the 3-point line. You will not win a game with that margin.\n\nThe Sparks looked like a team out of gas in the fourth. After playing weeks on end in playoff-like games with wins imperative, LA had nothing left in the tank when they needed another rally.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe Sparks return home on Sunday for the penultimate game in Crypto.com Arena when they take on the Wings. Tip is set for 3 p.m. PT.\n\nYou can follow Jacob on Twitter at @JacobRude or on Bluesky at @jacobrude.bsky.social."
  },
  {
    "source": "Yahoo",
    "title": "Former LSU basketball star Angel Reese suspended by Sky. Here's why.",
    "url": "https://sports.yahoo.com/article/former-lsu-basketball-star-angel-185452863.html",
    "date": "2025-09-07",
    "text": "Angel Reese was suspended for the first half of the Chicago Sky's game against Las Vegas Aces. Head coach Tyler Marsh said it was an \"organizational decision\" that came from the \"top down\" before the team's game on Friday.\n\nReese's suspension stems from what the Sky called \"statements detrimental to the team.\" She also sat out the entirety of Friday's contest against the Indiana Fever to serve a one-game suspension after receiving her eighth technical of the season on Wednesday.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe franchise-imposed suspension on Saturday follows Reese's comments in a Chicago Tribune article. She said she apologized to her teammates Wednesday for the remarks, which included saying she is \"not settling for the same s--- we did this year,\" and the team \"[has] to get great players\" this offseason. She also displayed concern about the Sky's point guard situation.\n\n\"We can't rely on Courtney [Vandersloot] to come back [from an ACL tear] at the age that she's at. I know she'll be a great asset for us, but we can't rely on that. We need someone, probably a little younger with some experience, somebody who's been playing the game and is willing to compete for a championship and has done it before.\"\n\nIn her second WNBA season, Reese leads the Sky with 14.7 points, 12.6 rebounds and 3.7 assists per game.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThis article originally appeared on LSU Wire: Former LSU basketball star Angel Reese suspended by Sky. Here's why."
  },
  {
    "source": "Yahoo",
    "title": "Sue Bird reflects on journey from UConn to the Hall of Fame",
    "url": "https://sports.yahoo.com/article/sue-bird-reflects-journey-uconn-001727516.html",
    "date": "2025-09-07",
    "text": "UNCASVILLE, Conn. — Between jersey retirements and statue reveals, Sue Bird is quickly adapting to her new normal of reflecting and reminiscing on a historic career.\n\n“To be honest, having them all in one year is probably the best thing that could happen,” Bird said at the Mohegan Sun on Friday. “Now as I sit here, I’m like totally relaxed... (and) I can really enjoy it.\n\nAdvertisement\n\nAdvertisement Advertisement\n\n“I think the difference with this Hall of Fame is that you’re doing it with others... The statue is like, all me. The street sign, all me. If you rewind a couple of years, jersey retirement, all me and that’s a lot. This feels like a breeze.”\n\nThe four-time WNBA champion noted the symmetry in returning to Connecticut as part of her journey into the Naismith Memorial Basketball Hall of Fame. She was surprised to find out this would be the first time that her wife, Megan Rapinoe, would be visiting Mohegan Sun.\n\n“Meanwhile, I walk in and I’m just blown away by all the memories that come rushing back,” Bird said. “Whether it’s playing games here, we came here a couple times in college — don’t tell anybody.\n\n“This place, it just has so many memories for me and of course the state itself. I always loved coming back here in my WNBA days because I knew the fans at UConn were going to be able to come and watch, you know, a person that they really watched grow up.”\n\nAdvertisement\n\nAdvertisement Advertisement\n\nDespite always returning to Connecticut as a visitor, Bird always felt the love and support of the local fans — a bond shared with all young women they watched grow up less than an hour away in Storrs.\n\n“I think a lot of the fans for a long time really viewed us as family members, viewed us as daughters,” Bird said. “So that connection was always there when I came back (to Connecticut) in the WNBA... this state is really where it all got started.”\n\nThe five-time Olympic gold medalist will be inducted to the Hall of Fame on Saturday night at the MassMutal Center by the two closest people to her from her time at UConn, Geno Auriemma and Swin Cash. Bird explained why the two fellow Hall of Famers were an easy choice as her inductees.\n\n“(Auriemma) was just somebody that really helped me find myself as a player, find myself as a person,” Bird said. “(He) helped build the foundation of who I became. He’s really difficult to play for, but in all the right ways, because he challenges you. He sees things in you and he helps you find them yourself.\n\nAdvertisement\n\nAdvertisement Advertisement\n\n“For Swin (Cash), that’s my college roommate. That’s someone that is more like family than anything else. That’s someone that I have experienced so much with, not just the highs, not just the championships, a lot of lows. Those types of people, the bond you create as you get to have those shared experiences, it’s virtually unbreakable, so it was only right to have both of them up there with me.”\n\nRead the original article on MassLive."
  },
  {
    "source": "Yahoo",
    "title": "Hiedeman scores 24, Collier 20 as Lynx hold off Valkyries 78-72",
    "url": "https://sports.yahoo.com/article/hiedeman-scores-24-collier-20-025212031.html",
    "date": "2025-09-07",
    "text": "Minnesota Lynx forward Alanna Smith (8) shoots over Las Vegas Aces center A'ja Wilson (22) during the second half of a WNBA basketball game Thursday, Sept. 4, 2025, in Las Vegas. (AP Photo/John Locher)\n\nMinnesota Lynx guard Natisha Hiedeman (2) drive between Las Vegas Aces center A'ja Wilson (22) and Las Vegas Aces guard Jewell Loyd (24) during the second half of a WNBA basketball game Thursday, Sept. 4, 2025, in Las Vegas. (AP Photo/John Locher)\n\nMinnesota Lynx guard Natisha Hiedeman (2) drive between Las Vegas Aces center A'ja Wilson (22) and Las Vegas Aces guard Jewell Loyd (24) during the second half of a WNBA basketball game Thursday, Sept. 4, 2025, in Las Vegas. (AP Photo/John Locher)\n\nMinnesota Lynx forward Alanna Smith (8) shoots over Las Vegas Aces center A'ja Wilson (22) during the second half of a WNBA basketball game Thursday, Sept. 4, 2025, in Las Vegas. (AP Photo/John Locher)\n\nMinnesota Lynx guard Natisha Hiedeman (2) drive between Las Vegas Aces center A'ja Wilson (22) and Las Vegas Aces guard Jewell Loyd (24) during the second half of a WNBA basketball game Thursday, Sept. 4, 2025, in Las Vegas. (AP Photo/John Locher)\n\nSAN FRANCISCO (AP) — Natisha Hiedeman matched her career-high with 24 points to lead the Minnesota Lynx to a 78-72 win over the Golden State Valkyries on Saturday night.\n\nThe Lynx (33-9), who had already secured the top seed for the playoffs, used a big run to close the third quarter to grab the lead. Veronica Burton converted a three-point play with 45 seconds left go pull the Valkyries within 74-72 but Napheesa Collier followed with a short baseline jumper.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nKayla McBride clinched it with two free throws after a turnover.\n\nCollier finished with 20 points. Minnesota rested Alanna Smith but Jessica Shepard stepped in for the start and had 12 points and 13 rebounds. Courtney Williams added 14 points.\n\nJanelle Salaun, Illana Rupert and Kaila Charles had 15 points and Burton 14 for the Valkyries. Golden State sold out every home game this season and set a WNBA attendance record averaging 18,604.\n\nThe Valkyries took a 36-31 halftime lead as Salaum hit a 3 and Charles had a layup in the final minute.\n\nTrailing by six with less than three minutes to go in the third quarter the Lynx went off, starting with a Collier 3-pointer. A flagrant foul was called when Hiedeman was fouled on a 3-pointer. She made all the free throws for the lead and on the ensuing possession Shepard had a putback to make it 55-52. Hiedeman added two more 3-pointers for a 16-0 run and a 61-52 lead heading into the fourth quarter.\n\nGolden State is at Seattle on Tuesday when Minnesota is at Indiana.\n\n___\n\nAP WNBA: https://apnews.com/hub/wnba-basketball"
  },
  {
    "source": "Yahoo",
    "title": "Leila Lacan, Sun deal Phoenix seeding hopes a blow with 87-84 win",
    "url": "https://sports.yahoo.com/article/leila-lacan-sun-deal-phoenix-193454924.html",
    "date": "2025-09-07",
    "text": "UNCASVILLE, Conn. (AP) — Rookie Leila Lacan scored six points in the last 30 seconds and the Connecticut Sun beat Phoenix 87-84 on Saturday, dealing a blow to the Mercury hopes of claiming the second seed for next week's playoffs.\n\nLacan, who joined the team midway through the season, drove the lane for an 83-81 lead with 27.8 seconds to go and added two free throws with 9.7 seconds left. After a Satou Sabally 3-pointer she closed the scoring with 3.7 seconds left with two more free throws.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe Sun ended the Phoenix six-game winning streak and spoiled the moment when Alyssa Thomas reclaimed the single season assist record.\n\nMarina Mabrey scored 23 points for Connecticut (11-31) and Lecan had 14. Veteran Tina Charles, whose life-saving charity was honored before the game bringing her to tears, had 22 points and 10 rebounds. Rookie Aneesah Morow had nine points and 13 rebounds.\n\nKahleah Copper scored 18 points for the Mercury (27-15), who fell a game behind Atlanta, which holds the tiebreaker, for the second seed with two games to go. Thomas had 14 points, 10 rebounds and eight assists. Sami Whitcomb scored 13 and Sabally 11.\n\nThere were 18 lead changes and never a double-figure lead.\n\nConnecticut closes the season with a home-and-home with Atlanta beginning Monday in Atlanta. Phoenix plays host to Las Vegas on Tuesday.\n\n___\n\nAP WNBA: https://apnews.com/hub/wnba-basketball"
  },
  {
    "source": "Yahoo",
    "title": "Lynx legend Maya Moore recreates iconic Michael Jordan rings photo for Hall of Fame induction",
    "url": "https://sports.yahoo.com/article/lynx-legend-maya-moore-recreates-155803860.html",
    "date": "2025-09-07",
    "text": "The post Lynx legend Maya Moore recreates iconic Michael Jordan rings photo for Hall of Fame induction appeared first on ClutchPoints.\n\nFour-time WNBA champion and former Minnesota Lynx star Maya Moore was inducted into the Naismith Memorial Hall of Fame. The 36-year-old was the No. 1 overall pick of the 2011 draft and retired in January 2023.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nMoore was one of the nine members inducted into the Hall of Fame on Saturday. And for the occasion, she recreated an iconic Michael Jordan picture holding double the number of rings.\n\nBack in June 1998, MJ was seen posing with his six NBA championship rings back after winning his second three-peat with the Chicago Bulls. Moore, in an obvious throwback to the image, hit the same pose with a total of 12 rings.\n\nThese, along with her high school national title with Collins Hill, include four WNBA titles, two NCAA championships, two Olympic golds, and three high school state titles. Moore was one of the nine inductees this year.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nMoore was selected alongside fellow WNBA legends Sue Bird and Sylvia Fowles, as well as former NBA stars Carmelo Anthony and Dwight Howard. Current Chicago Bulls head coach Billy Donovan and the 2008 US Olympics Men’s team were other notable inductees for this year.\n\nMoore, who was the 2014 WNBA MVP and the 2013 WNBA Finals MVP, spent her entire WNBA career playing for the Minnesota Lynx.\n\nAt the ceremony, Moore claimed that she was very happy with how her career had gone and simply did not have any desire to continue playing simply because she did everything she “could have possibly done and then did it again.”\n\n“I’ve been to the mountaintop, right? And then we went to the mountaintop again, so I have no regrets as far as what I was able to enjoy and experience as a player while I played,” she said at the ceremony."
  },
  {
    "source": "Yahoo",
    "title": "Why Wings must pursue Angel Reese if Sky trade her",
    "url": "https://sports.yahoo.com/article/why-wings-must-pursue-angel-153030230.html",
    "date": "2025-09-07",
    "text": "The post Why Wings must pursue Angel Reese if Sky trade her appeared first on ClutchPoints.\n\nThe Chicago Sky and Angel Reese have dominated WNBA headlines over the past week despite already being eliminated from postseason contention. Reese made comments about the Sky in an article by the Chicago Tribune that did not sit well with the organization. The Sky ultimately announced that Reese would sit out for the first-half of an upcoming game against the Las Vegas Aces. Reese, 23, still has another year on her contract as well as a club option for 2027, but if the Sky make her available in trade talks this offseason the Dallas Wings should be ready to make a pursuit.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nMost rebuilding teams would not consider moving on from a young star. Chicago has likely considered the idea of building the roster around Reese. Reese’s recent comments — where she urged the Sky to add talent and build a contender — to go along with the drama of the half-game suspension could lead to both sides seeking a fresh start.\n\nFor clarity, there are currently no sourced rumors in reference to a possible Reese trade. If Chicago makes the decision to move on or Reese requests a trade, however, then the Wings make sense as a landing destination.\n\nWings need a star forward\n\nPaige Bueckers and Arike Ogunbowale are Dallas’ star players at the moment. The Wings began the season with Teaira McCowan and NaLyssa Smith on the roster, but Dallas moved on from both players during the ’25 campaign. Myisha Hines-Allen, Luisa Geiselsoder and Li Yueru have all helped fill the power forward/center voids on the roster, but adding a star-caliber forward would help Dallas reach the next level.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nReese has earned All-Star selections in each of her two seasons in the WNBA. Overall, she has averaged 14.1 points, 12.9 rebounds, 2.7 assists and 1.4 steals per outing in her career. She needs to improve her shooting efficiency — Reese owns a 42.1 career field goal shooting percentage — but she impacts the game in multiple ways.\n\nAt 6’3″, Reese is one of the best rebounders in the league. Dallas has quietly been one of the better rebounding teams, averaging 35.0 per game which is good for fourth in the WNBA in 2025. Still, adding Reese would only improve the Wings’ rebounding prowess.\n\nReese would provide Bueckers with a pick-and-roll partner for years to come. Both players are 23 years old and would give general manager Curt Miller two stars to build around. Ogunbowale may also be in the conversation, but she will be a free agent this offseason. The Wings could bring her back, but there is a chance she may leave in free agency.\n\nA trio of Bueckers, Ogunbowale and Reese would provide value, though. The Wings also currently hold the worst record in the WNBA, meaning they will have a tremendous opportunity of landing the No. 1 overall pick in the WNBA Draft for a second consecutive season.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nA star in the paint alongside Paige Bueckers\n\nBueckers is a dominant pick-and-roll ball-handler. Reese’s pick-and-roll prowess would instantly improve alongside a guard like Bueckers. The duo could become an unstoppable force.\n\nAs mentioned, Reese’s field goal efficiency has been a problem at times. It would not be difficult to envision Reese finding more success in that department if she were to play alongside Bueckers.\n\nBueckers and Reese would also represent the long-term future of the franchise. Free agents may see the duo Dallas is building around and choose to join the Wings. Both players displayed winning prowess in college — something that will carry over into the WNBA if the right situation is presented.\n\nRelated: Satou Sabally reveals real reason for requesting Wings trade\n\nRelated: Wings’ Paige Bueckers shares spotlight after record-setting performance"
  },
  {
    "source": "Yahoo",
    "title": "Tina Charles' charity, Hopey's Heart Foundation, nears milestone for lifesaving AEDs",
    "url": "https://sports.yahoo.com/article/tina-charles-charity-hopeys-heart-171516088.html",
    "date": "2025-09-07",
    "text": "Connecticut Sun center Tina Charles (31) looks to pass the ball as Las Vegas Aces center A'ja Wilson (22) defends during the first half of a WNBA basketball game Sunday, Aug. 10, 2025, in Las Vegas. (Steve Marcus/Las Vegas Sun via AP)\n\nUNCASVILLE, Conn. (AP) — Tina Charles has been helping to save countless lives for more than a decade with her charity — Hopey's Heart Foundation.\n\nOn Saturday, the Connecticut Sun in partnership with Yale New Haven Health donated $20,000 to help Charles reach a milestone of donating 500 AEDs (automated external defibrillators). She’s 17 short right now. Each AED can cost thousands of dollars.\n\nAdvertisement\n\nAdvertisement Advertisement\n\n“We’ll get there this fall now and I’m very thankful that the Lord chose me to be able to carry out this mission,” Charles told The Associated Press before the 87-84 win over Phoenix. “It’s really just my heart and been a blessing in memory of my late aunt.”\n\nCharles teared up during the on-court presentation before the game as she was surprised by the donation.\n\nThe organization, started in 2013 and named in honor of her aunt, is dedicated to curbing deaths in the United States from sudden cardiac arrest. The organization works to ensure schools and public places have lifesaving equipment such as defibrillators on hand.\n\nYale New Haven Health was thrilled to help Charles reach the impressive milestone.\n\nAdvertisement\n\nAdvertisement Advertisement\n\n“We felt it was important as not only, a leading health care institution in this region, but also a supporter of everything of women’s sports, Tina Charles and the Connecticut Sun,” said Paul Mounds Jr., who is the Vice President of Community, Corporate and Government Relations for Yale New Haven Health.\n\nMounds Jr. said that his organization will also work with the American Heart Association to make sure that each group that receives an AED also gets heart health education alongside it.\n\nThe 36-year-old Charles said that before she started the foundation she didn’t realize how common and deadly sudden cardiac arrest could be until she read about Wes Leonard, a high school basketball player who suffered a heart attack and died after basketball practice in 2011.\n\nAnd when her aunt died a few years later from organ failure, Charles committed herself to helping to solve the problem.\n\nAdvertisement\n\nAdvertisement Advertisement\n\n“To see my family on my aunt’s side surprise me and be supportive, I’m very thankful,” said Charles, who had 22 points and 10 rebounds in the win.\n\nConnecticut team president Jen Rizzotti has been impressed with what Charles has been able to do.\n\n“It’s really inspirational. If I’m being honest. I think that’s what’s special about the WNBA is that impact the players make off the court and Tina has led the way for over a decade now,” Rizzotti said. “From the beginning when she donated her salary to her foundation, she really kind of understood the bigger picture.”\n\nIn 2017, when Charles was playing for the New York Liberty, she was surprised by the team by a man who was saved by one of the AEDs that the star had donated.\n\nThat moment has still left an impact on her years later.\n\n___\n\nAP WNBA: https://apnews.com/hub/wnba-basketball"
  },
  {
    "source": "Yahoo",
    "title": "Maya Moore recreates Jordan's iconic ring photo ahead of Hall of Fame induction",
    "url": "https://sports.yahoo.com/article/maya-moore-recreates-jordans-iconic-003555629.html",
    "date": "2025-09-07",
    "text": "WNBA great Maya Moore is one of nine members to be inducted into the Naismith Basketball Hall of Fame as part of the Class of 2025 on Saturday.\n\nMoore found success at every level of competition throughout her basketball career and displayed many of those accomplishments as part of a collaboration with Nike and the Jordan Brand.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe four-time WNBA champion and Olympic Gold Medalist recreated Michael Jordan's iconic ring photograph with her own 12 rings.\n\nMoore stopped playing after the 2018 season, after the Minnesota Lynx were eliminated in the first round of the WNBA playoffs. It snapped the Minnesota Lynx’s run of three consecutive finals appearances.\n\nMoore was the first overall pick in the 2011 WNBA draft and officially retired in January 2023.\n\nThis article originally appeared on USA TODAY: Maya Moore enters Hall of Fame, goes full Jordan in iconic pic"
  },
  {
    "source": "Yahoo",
    "title": "Breanna Stewart leads Liberty to 84-76 comeback win over Storm",
    "url": "https://sports.yahoo.com/article/breanna-stewart-leads-liberty-84-043427595.html",
    "date": "2025-09-07",
    "text": "SEATTLE (AP) — Breanna Stewart scored 13 of her 24 points in the fourth quarter, Leonie Fiebich matched her career-high with 21 and the New York Liberty kept the Seattle Storm from clinching a playoff berth with an 84-76 win on Friday night.\n\nKennedy Burke added 13 points for New York (25-17), which ended a two-game losing streak and a five-game skid on the road.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nNneka Ogwumike scored 20 points for Seattle (22-21), which still needs one win or a Sparks loss to clinch the final playoff spot. Skylar Diggins added 14 points.\n\nNew York outscored Seattle 45-29 in the second half when the Storm shot 10 of 31 but didn’t take the lead until Burke opened the fourth quarter with a layup. Ogwumike put Seattle back on top but Natasha Cloud answered with a 3-pointer.\n\nSeattle pulled to 74-72 with 3:22 to go but could get no closer as the Liberty successfully challenged two fouls in the last 1:42. The last one changed an offensive foul on Stewart into a shooting foul and her free throw made it 79-74 with 46.8 to play.\n\nStewart was 13 of 14 from the free throw line to 12 of 15 for Seattle, which was outscored by nine at the line. Both teams took 20 3s but the Storm hit four and the Liberty nine.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nWith 31 points in the second quarter the Storm led 47-39 at halftime.\n\nStewart had her 153rd 20-point game, fourth all-time while Ogwumike moved into third with her 275th 15-point game.\n\nThe Liberty host Washington on Tuesday, and Storm host Golden State in their regular season finale."
  },
  {
    "source": "Yahoo",
    "title": "Without Caitlin Clark, WNBA playoff spotlight will be dimmer",
    "url": "https://sports.yahoo.com/article/without-caitlin-clark-wnba-playoff-101607710.html",
    "date": "2025-09-07",
    "text": "The look on Caitlin Clark’s face said it all.\n\nInstead of celebrating an assist to Kelsey Mitchell to help seal a win for the Indiana Fever, Clark hung her head. A sellout crowd in Boston that had come to see the city’s second-ever WNBA regular-season game watched as Clark pounded her head against the opposite stanchion and saw her eyes well up when she reached the bench.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThree days before All-Star Weekend descended upon Indianapolis, it seemed clear there would be no 3-point shootout for Clark and no midseason showcase in front of her home fans.\n\nBut her expression betrayed a greater fear than one lost weekend. That reality was confirmed Thursday when Clark announced on social media that after an injury-marred season she would not be returning in 2025, not even if the Fever make the postseason.\n\n“I had hoped to share a better update, but I will not be returning to play this season,” Clark wrote. “I spent hours in the gym every day with the singular goal of getting back out there, disappointed isn’t a big enough word to describe how I am feeling.”\n\n\n\n\n\nIt wasn’t supposed to be like this for Clark, not after a historic rookie year that forced the sports world to reimagine the WNBA’s growth trajectory. Her first season broke viewership and attendance records and brought a new set of fans to the country’s longest-running female sports league. Clark set the WNBA’s full-season and single-game assist marks, leading Indiana back to the playoffs for the first time in eight years and revitalizing a languishing franchise.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nThe Fever had high expectations for Clark’s second season and prepared for greatness. They fired coach Christie Sides and brought in local legend and 2023 Coach of the Year Stephanie White. They traded the No. 8 pick in the 2025 draft and parted ways with young talents like NaLyssa Smith and Grace Berger to bring in veterans on one-year rentals including Sophie Cunningham and Natasha Howard.\n\nClark made it clear during the preseason, the goal was a championship — not the Commissioner’s Cup title, no matter how gleefully Indiana celebrated the $500,000 purse.\n\nSitting in eighth place without their star player and with just one week to play in the regular season wasn’t the expectation. If the Fever eke out a postseason berth, a first-round exit is the likeliest outcome without more reinforcements.\n\nBut this appeared to be a lost season for Clark long before Thursday’s announcement. She missed a preseason game with a quad injury, her first missed game of any kind as a professional. Indiana sputtered to start the season as the Fever worked in new acquisitions Howard and DeWanna Bonner. Bonner lasted only nine games before requesting a buyout; by then, Clark had suffered her first groin injury, forcing Indiana to look for a hardship point guard.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nEven when Clark was on the court, her production didn’t rise to the heights of her first season. She shot 36.7 percent from the field and 27.9 percent on 3s, struggling mightily with her jumper on the road (2 of 35 on road 3s).\n\nThe Fever weathered the initial spate of injuries, but then Clark had to sit out again, followed by season-ending injuries to Aari McDonald, Sydney Colson and Cunningham. The hopes of developing chemistry and writing the first chapter of a title run were dashed.\n\n“Any time you have to reinvent yourself throughout the course of the season … it’s challenging,” White said.\n\nA high volume of injuries have plagued the WNBA in 2025. MVP candidates A’ja Wilson and Alyssa Thomas missed time earlier in the year, and Napheesa Collier and Breanna Stewart were out for long stretches in August. Last season’s runner-up in the Rookie of the Year race, Angel Reese, also missed multiple weeks after the All-Star break.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nMany of the WNBA’s marquee national television matchups lost their luster due to injury. Clark and Reese faced each other once, as did Clark and presumptive Rookie of the Year Paige Bueckers. Collier and Stewart were never on the court together.\n\nClark still traveled around the country, signing autographs for fans and serving as a coaching intern; she even required her technical foul de-escalation crew as she protested officiating from her seat on the bench. Her presence was felt, but it only served to highlight her absence from the court.\n\nIn a way, this season’s challenges vindicated Indiana’s offseason approach. Clark’s greatness, and her excellent on-court partnerships with Mitchell and Aliyah Boston, opened the window of championship contention. Those windows don’t stay open in the WNBA for very long. The New York Liberty are experiencing that in real time as injuries hamper their championship repeat bid.\n\nThe Fever saw an opportunity, and they went for it. That it didn’t pay off doesn’t invalidate the process.\n\nAdvertisement\n\nAdvertisement Advertisement\n\nClark’s rookie year expanded the realm of possibility for the Fever. She lived up to and seemingly exceeded every expectation in 2024. The sequel couldn’t live up to the hype.\n\nThis article originally appeared in The Athletic.\n\nIndiana Fever, WNBA, Opinion\n\n2025 The Athletic Media Company"
  },
  {
    "source": "CBS",
    "title": "WNBA rookie Paige Bueckers channels her inner-Stephen Curry in message to Wings: 'We'll figure this thing out'",
    "url": "https://www.cbssports.com/wnba/news/wnba-rookie-paige-bueckers-channels-her-inner-stephen-curry-in-message-to-wings-well-figure-this-thing-out/",
    "date": "2025-09-07",
    "text": "The Dallas Wings have struggled despite a strong rookie season from Paige Bueckers and are currently sitting at the bottom of the WNBA standings. However, Bueckers is looking toward the future and quoted Golden State Warriors star Stephen Curry in a message to the franchise.\n\n\"I mean, just stick with it. Whoever we have in that locker room, whoever puts on a Wings jersey that night, that's who we're going to war with,\" Bueckers said on Friday after a 78-100 loss to the Atlanta Dream, the team's seventh consecutive loss, which dropped them to a 9-31 record.\n\n\"...I remember Steph Curry, before the Warriors became the Warriors,\" Bueckers continued. \"He tweeted out like, 'Just stick with us. We're going to figure it out.' That's the message... I just have this undying belief in it.\"\n\nCurry, the No. 7 overall pick in the 2009 NBA Draft, is considered one of the best players in league history, but he also faced some struggles at the beginning of his career.\n\nGolden State did not have a winning record until Curry's fourth season with the franchise. Two years later, the Warriors won a championship. The trio of Curry, Klay Thompson, and Draymond Green turned Golden State into a dynasty with four NBA titles together from 2015 to 2022. Now, after the emergence of Curry, the Warriors rank third with the most championships (seven) and Finals appearances (10) in NBA history, trailing only the Boston Celtics and Los Angeles Lakers.\n\nIt's hard to predict whether the Wings will achieve that kind of success, but it seems Bueckers has a blueprint to follow. The franchise won three championships when they were known as the Detroit Shock. However, the Wings' only winning season since then was a 22-18 record in 2023, when they advanced to the WNBA semifinals.\n\nBueckers arrived in the WNBA fresh off an NCAA national championship run with UConn -- a program that has not lost more than eight games in a single season since 1992-93. However, she made it clear during the WNBA preseason that her focus as a rookie was going to be on getting better and not wins and losses.\n\nThe Wings still have four regular-season games remaining. Despite her team's struggles -- Dallas was officially eliminated from playoff contention last week -- Bueckers has put on a solid campaign and is the favorite to win the league's Rookie of the Year award.\n\nShe became the fastest newbie in WNBA history to secure 500 points and 100 assists, as well as the fastest player to reach 50 rebounds in her first season. On Aug. 21, Bueckers registered 44 points in a loss to the Los Angeles Sparks, tying Cynthia Cooper-Dyke's 1997 record for the most points in a single game by a rookie.\n\nDallas will return to the court on Monday for a road game against the Minnesota Lynx, the No. 1 team in the standings."
  },
  {
    "source": "CBS",
    "title": "WNBA playoff picture: Standings, schedule as Mercury's upset loss to Sun damages hopes of earning No. 2 seed",
    "url": "https://www.cbssports.com/wnba/news/wnba-playoff-picture-standings-schedule-as-mercurys-upset-loss-to-sun-damages-hopes-of-earning-no-2-seed/",
    "date": "2025-09-07",
    "text": "Less than a week remains in the 2025 WNBA season, and the playoff picture is still murky. The Minnesota Lynx have secured the No. 1 seed and home-court advantage throughout the playoffs, but no other team is locked into a spot and two postseason berths remain up for grabs.\n\nOn Saturday, the Connecticut Sun scored a major upset win over the Phoenix Mercury, dealing a major blow to Alyssa Thomas and Co.'s hopes of earning the No. 2 seed. Elsewhere, the Lynx defeated the Golden State Valkyries to continue their push for the single-season wins record.\n\nThe playoff push will continue Sunday with three more games:\n\nAs a reminder, the top eight teams in the league make the playoffs, regardless of conference. From there, they are placed into a standard eight-team bracket. The first round of the playoffs is a best-of-three series, while the semifinals are a best-of-five and the Finals, as of this season, are a best-of-seven.\n\nThe regular season will conclude on Sept. 11 and the playoffs begin on Sept. 14. The last possible Finals date is Oct. 19.\n\nStandings\n\nMinnesota Lynx (33-9) -- Clinched playoff berth Atlanta Dream (28-14) -- Clinched playoff berth Las Vegas Aces (27-14) -- Clinched playoff berth Phoenix Mercury (27-15) -- Clinched playoff berth New York Liberty (25-17) -- Clinched playoff berth Golden State Valkyries (23-19) -- Clinched playoff berth Indiana Fever (22-20) Seattle Storm (22-21)\n\n----------------------------- Los Angeles Sparks (19-22) Washington Mystics (16-26) -- Eliminated from playoff contention Connecticut Sun (11-31) -- Eliminated from playoff contention Chicago Sky (10-31) -- Eliminated from playoff contention Dallas Wings (9-33) -- Eliminated from playoff contention\n\nNote: Two-team ties are decided first by head-to-head record and then, if necessary, by better record against .500+ teams. Ties between more than two teams are determined by the combined head-to-head record against the other teams.\n\nLynx have clinched No. 1 seed\n\n1. Minnesota Lynx (33-9)\n\nThe Lynx locked in the No. 1 seed and home-court advantage throughout the playoffs and set a franchise record for wins in a season late last month. Now, all that's left to play for is the all-time single-season wins record. If the Lynx win their remaining two games, they'll surpass the current record of 34 wins by the 2023 Aces.\n\n2025 WNBA playoffs: Minnesota Lynx clinch No. 1 seed, homecourt advantage throughout postseason Jack Maloney\n\nMercury stunned by Sun in major blow to No. 2 seed hopes\n\n2. Atlanta Dream (28-14)\n\n3. Las Vegas Aces (27-14)\n\n4. Phoenix Mercury (27-15)\n\n5. New York Liberty (25-17)\n\nThe furious race for the No. 2 seed took an interesting twist on Saturday when the Mercury were stunned by the lottery-bound Sun. They are now half a game back of the Aces and a full game back of the Dream.\n\nMeanwhile, the Liberty have dropped off from the pack. Though they clinched a playoff spot on Tuesday and picked up a big win over the Storm on Friday, they are as close to sixth as they are to fourth.\n\nAre the Aces serious title contenders? Reasons for optimism, pessimism amid Las Vegas' 12-game win streak Jack Maloney\n\nValkyries make history, Fever move closer to clinching\n\n6. Golden State Valkyries (23-19)\n\n7. Indiana Fever (22-20)\n\n8. Seattle Storm (22-21)\n\n9. Los Angeles Sparks (19-22)\n\nThe Valkyries beat the Wings at home on Thursday for their fifth win in a row and became the first expansion team ever to make the playoffs in their inaugural season.\n\nTwo spots now remain, and it seems as though the Fever will get one of them. They beat the Sky for a fifth time this season to jump into seventh place and now have a 2½-game lead on the Sparks, who lost again on Friday to the Dream. The Storm fell to eighth place with their loss to the Liberty, but still have a two-game edge on the Sparks.\n\nLottery bound\n\n10. Washington Mystics (16-26)\n\n11. Connecticut Sun (11-31)\n\n12. Chicago Sky (10-31)\n\n13. Dallas Wings (9-33)\n\nThe Mystics officially joined the lottery-bound crew with a loss to the Valkyries on Saturday. Though they were more competitive than expected this season, they ultimately fell apart down the stretch after trading All-Star guard Brittney Sykes. They got a first-round pick for Sykes, though, and will now have another lottery selection, so missing the playoffs is for the best.\n\nThe Sun, Sky and Wings have been a step behind everyone else all summer and have long been destined for the lottery. Only the Wings control their own first-round pick in the 2026 draft, however.\n\nWNBA rookie Paige Bueckers channels her inner-Stephen Curry in message to Wings: 'We'll figure this thing out' Isabel Gonzalez\n\nThe Sky owe their first to the Lynx, while the Sun owe the Sky swap rights to their first rounder. The Sky also own Mercury's first rounder, so the Sky will get the more favorable of the Sun/Mercury picks, while the Sun will get the least favorable of those selections."
  },
  {
    "source": "CBS",
    "title": "Caitlin Clark injury update: Fever star out for rest of 2025 WNBA season, calls it 'incredibly frustrating'",
    "url": "https://www.cbssports.com/wnba/news/caitlin-clark-injury-update-fever-star-out-for-rest-of-2025-wnba-season-calls-it-incredibly-frustrating/",
    "date": "2025-09-07",
    "text": "Indiana Fever star Caitlin Clark will miss the remainder of the 2025 WNBA season, she announced Thursday night. Clark hasn't played since July 15 due to a groin injury, and her season is now over amidst a difficult rehab process.\n\nClark announced the news on social media, and she expressed frustration at her lack of progress. In spite of her personal setback, Clark called on the Fever to continue their playoff push without her in the lineup.\n\n\"I had hoped to share a better update, but I will not be returning to play this season,\" Clark wrote. \"I spent hours in the gym every day with the singular goal of getting back out there, disappointed isn't a big enough word to describe how I am feeling. I want to thank everyone who had my back through all the uncertainty.\n\n\"This has been incredibly frustrating, but even in the bad, there is good. The way the fans continued to show up for me, and for the Fever, brought me so much joy and important perspective. I am so proud of how this team has only gotten stronger through adversity this year. Now it's time to close out the season and claim our spot in the playoffs.\"\n\nAfter a historic Rookie of the Year campaign, Clark's sophomore season was derailed by injuries.\n\nShe only played 13 times due to a left quad strain that kept her out for three weeks, a left groin injury that sidelined her for two weeks and now a right groin injury. Clark also suffered a left ankle bone bruise while rehabbing her current groin issue.\n\nCaitlin Clark's injury-plagued sophomore season was a disaster for the WNBA, the Fever and herself Jack Maloney\n\nIn 13 games, she averaged 16.5 points and 8.8 assists per game. Clark, however, shot just 27.9%from 3-point range on eight attempts per game. She was named an All-Star, but Clark missed out on the Commissioner's Cup championship and All-Star weekend in her adopted home city of Indianapolis.\n\nSecond-year setback\n\n\n\n2025 Caitlin Clark 2024 Caitlin Clark Games 13 40 PPG 16.5 19.2 APG 8.8 8.4 3-PT% 27.9% 34.4%\n\nWith less than a week before the Fever's regular season ends and less than two weeks until the playoffs begin, Clark was still not a full participant in practice this week.\n\n\"She hasn't been able to do a whole lot of contact,\" Fever coach Stephanie White said. \"She's been able to get up-and-down 5-on-0, been able to do shooting, but hasn't been able to get a whole lot of contact.\"\n\nEarlier this month, White said that she wants to see Clark participate in \"multiple practices\" before she potentially returned to game action.\n\n\"I want to see her in practice, live in practice,\" White said. \"I want to see her to continue to work to not just build endurance, but to be able to handle contact 94 feet as it's going to be in game, and to be able to do that and sustain from an endurance standpoint, and that's going to take multiple practices to make sure that there's no regression. As most of us know, when we get fatigued, we look different. [We need to see] how she plays through fatigue.\"\n\nThe Fever were 8-5 with Clark in the lineup and are 13-15 without her. At 21-20, they currently hold the eighth and final playoff spot, but are just 1½ games up on the ninth-place Sparks, who own the tiebreaker between the two teams."
  },
  {
    "source": "CBS",
    "title": "WNBA Power Rankings: Aces continue to surge as playoff picture comes into focus",
    "url": "https://www.cbssports.com/wnba/news/wnba-power-rankings-aces-continue-to-surge-as-playoff-picture-comes-into-focus/",
    "date": "2025-09-07",
    "text": "September has arrived, and with it the final 11 days of the 2025 WNBA regular season. While the Minnesota Lynx have clinched the No. 1 seed and home-court advantage throughout the playoffs, every other seed is still up for grabs and the battle for the final four playoff spots rages on.\n\nAs we head into the final stretch of the summer, here's a closer look at what's still to play for:\n\nFour teams in reach of No. 2 seed\n\nThe Las Vegas Aces have taken control of the No. 2 seed thanks to their 12-game winning streak, but they are only half a game up on the third-place Atlanta Dream and fourth-place Phoenix Mercury, who are only separated by a tiebreaker. The New York Liberty, now in fifth place, are two games back on the Aces, but do hold the tiebreaker between the clubs.\n\nThe No. 2 seed, of course, provides home-court advantage through the first two rounds of the playoffs and places that team on the opposite side of the bracket as the Lynx. For the same reason, this bunch of teams may be as desperate to avoid the 4/5 line as they are to get the No. 2 seed. No one wants to have to play the Lynx in the second round.\n\nFour teams for the final three spots\n\nOver the last few weeks, the Nos. 6-8 seeds have been a revolving door. As it stands on Sept. 1, the Golden State Valkyries are in sixth, the Seattle Storm are in seventh and Indiana Fever are in eighth. Just a half-game separates these three teams, however, and there's no telling how things will shake out by the end of the season.\n\nThe Los Angeles Sparks, meanwhile, remain on the outside looking in. They're now two games back of the eight-place Fever and 2½ games back of the Storm and Valkyries.\n\nWhile this group is more concerned with getting into the playoffs than seeding, the latter is certainly still on their minds. None of these teams will want to be the No. 8 seed and have to face the Lynx in the first round.\n\nHere's a quick look at some of the most important games to track this week:\n\nMonday : Los Angeles Sparks at Seattle Storm, 10 p.m. ET – NBA TV\n\n: Los Angeles Sparks at Seattle Storm, 10 p.m. ET – NBA TV Tuesday : New York Liberty at Golden State Valkyries, 10 p.m. ET – League Pass\n\n: New York Liberty at Golden State Valkyries, 10 p.m. ET – League Pass Tuesday : Indiana Fever at Phoenix Mercury, 10 p.m. ET – NBA TV\n\n: Indiana Fever at Phoenix Mercury, 10 p.m. ET – NBA TV Wednesday : Los Angeles Sparks at Atlanta Dream, 7:30 p.m. ET\n\n: Los Angeles Sparks at Atlanta Dream, 7:30 p.m. ET Thursday : Minnesota Lynx at Las Vegas Aces, 10 p.m. ET – Amazon Prime\n\n: Minnesota Lynx at Las Vegas Aces, 10 p.m. ET – Amazon Prime Friday : Los Angeles Sparks at Atlanta Dream, 7:30 p.m. ET – ION\n\n: Los Angeles Sparks at Atlanta Dream, 7:30 p.m. ET – ION Friday: New York Liberty at Seattle Storm, 10 p.m. ET – ION\n\nAnd now, CBS Sports' latest WNBA Power Rankings.\n\nWNBA Power Rankings (Sept. 1, 2025)"
  },
  {
    "source": "CBS",
    "title": "Breaking down the Fever injury situation: Caitlin Clark, Sophie Cunningham among several players sidelined",
    "url": "https://www.cbssports.com/wnba/news/breaking-down-the-fever-injury-situation-caitlin-clark-sophie-cunningham-among-several-players-sidelined/",
    "date": "2025-09-07",
    "text": "The Indiana Fever's injury-plagued season hit a new low Thursday when the team announced that superstar guard Caitlin Clark will not return this season. Clark, who was limited to just 13 games this season due to an array of lower body injuries, is the fifth Fever player to be ruled out for the season.\n\n\"Caitlin has worked so hard throughout this time, doing everything possible to recover and return to the court but, ultimately, time is not on our side,\" Fever general manager Amber Cox said in a press release. \"While we will continue working with Caitlin and provide her with every resource we have available, there is not enough time left in our season for her to safely return, and her long-term health and well-being remains our top priority. We are looking forward to having her back at full strength to start the 2026 season.\"\n\nNot even the Fever's coaches can stay healthy. Prior to the team's loss to the Phoenix Mercury on Tuesday, Stephanie White confirmed that player development coach Keith Porter had ruptured his right Achilles tendon.\n\n\"His spirits are good,\" White said. \"Keith is just one of those guys that's always happy, and he's a very faithful guy. It's an adjustment right now, because he's not on the floor, but eventually once he gets through surgery he'll be back on. But you're still gonna hear his voice, it's just like if one of us got hurt. you're still gonna hear his voice, he's still gonna be there, he's still gonna be giving the tips. As soon as he can he's gonna be back on the floor making passes. He might not be D-ing somebody up or out on the court playing with physicality, but his voice is still a presence.\"\n\nPorter, known for his work with three-time All-Star Aliyah Boston, will join the ranks of the walking wounded in Indianapolis. The Fever, who began the season with championship expectations, have been decimated by injuries. Clark, Chloe Bibby, Sydney Colson, Sophie Cunningham and Aari McDonald have all been ruled out for the season. As a result of their injury issues, 17 different players have suited up for the Fever this season.\n\nAfter Tuesday's defeat, the Fever sit in eighth place at 21-20, just 1½ games ahead of the ninth-place Los Angeles Sparks, who own the tiebreaker between the clubs. With less than a week remaining until the Fever play their final regular season game on Sept. 9, here's a rundown of their unfathomable injury situation.\n\nChloe Bibby: Left knee, out for season\n\nThe Fever's current roster looks nothing like it did to begin the season. One of the new faces is Chloe Bibby, who initially joined the team on a seven-day contract in late July and signed a rest-of-season contract on Aug. 1.\n\nBibby, who went undrafted in 2022, had bounced around overseas before catching on with the Golden State Valkyries earlier in the season. She was released after just five appearances with the expansion squad, but did enough to catch the Fever's eye.\n\nWhile Bibby got off to an impressive start with the Fever and hit multiple 3-pointers in her first three appearances, she went ice cold for a few weeks and fell out of the rotation. Recently, she started to deal with left knee soreness and has not played since Aug. 17. The Fever announced on Thursday that Bibby will not return due to her left knee issue. She is the fourth player to go down with a season-ending injury.\n\nCaitlin Clark: Right groin, out for the season\n\nClark's injury problems started during preseason when she was scratched from a warm-up game against the Washington Mystics due to left quad tightness. She appeared in the Fever's final two preseason games and was ready for opening day -- a 35-point win over the Chicago Sky in which she recorded a triple-double -- but only managed four appearances before suffering a left quad strain.\n\nClark sat out for three weeks before returning on June 14 with a stunning 32-point, eight-rebound, nine-assist outing against the reigning champion New York Liberty. Her second stint would last just five games, however, before she tweaked her left groin.\n\nAfter another two-plus weeks on the mend, Clark returned to action on July 9 in a defeat to the Golden State Valkryies, but did not look like herself. She struggled through four games before injuring her right groin late in a win over the Connecticut Sun on July 15 and has not played since.\n\nCaitlin Clark's injury-plagued sophomore season was a disaster for the WNBA, the Fever and herself Jack Maloney\n\nThe Fever announced on Thursday that Clark will not return this season.\n\n\"I had hoped to share a better update, but I will not be returning to play this season,\" Clark wrote on social media. \"I spent hours in the gym every day with the singular goal of getting back out there, disappointed isn't a big enough word to describe how I am feeling.\n\n\"I want to thank everyone who had my back through all the uncertainty. This has been incredibly frustrating, but even in the bad, there is good. The way the fans continued to show up for me, and for the Fever, brought me so much joy and important perspective. I am so proud of how this team has only gotten stronger through adversity this year. Now it's time to close out the season and claim our spot in the playoffs.\"\n\nSydney Colson: Torn left ACL, out for season\n\nColson, who made her WNBA debut back in 2011, signed with the Fever in free agency last offseason. She was expected to be a veteran presence in the locker room who could provide some backcourt depth, but ended up playing more than anyone expected due to the Fever's injury problems.\n\nDuring a defeat to the Phoenix Mercury on Aug. 7, Colson went do chase down an offensive rebound near the Fever's bench and landed awkwardly. She immediately collapsed to the ground and was later diagnosed with a torn ACL in her left knee that will keep her out for the remainder of the season.\n\nIn 30 games this season, Colson averaged 2.4 points and two assists in 13.5 minutes per night.\n\nSophie Cunningham: Torn right MCL, out for season\n\nThe Fever were wheeling and dealing this offseason, and one of their biggest moves was trading the No. 8 overall pick in the 2025 WNBA Draft (Saniya Rivers) to the Connecticut Sun and NaLyssa Smith to the Dallas Wings in exchange for Cunningham from the Mercury as part of what eventually became a 10-team mega trade.\n\nCunningham, who spent the first six seasons of her career with the Mercury, tweaked her ankle during the preseason, which delayed her debut with the team until May 22. Another ankle injury a week later put her on the shelf for two weeks. As a result of those injuries, and the move to a new city to play for a new organization, Cunningham struggled at first in Indianapolis.\n\nShortly before the All-Star break, though, Cunningham was inserted into the starting lineup and found her stride. In 13 games as a starter, she averaged 11.2 points and shot 51.6% from the field, including 46.9% from 3-point range. Her momentum came to a halt against the Sun on Aug. 17 when Bria Hartley fell into her leg and she had to be helped off the floor. An MRI later revealed a torn MCL in her right leg that ended her season.\n\nAari McDonald: Broken right foot, out for season\n\nEarly in the season, the Fever were so shorthanded that they qualified for an emergency hardship exception. They used it to sign former lottery pick Aari McDonald, who was a surprise cut by the Los Angeles Sparks during training camp. McDonald made an immediate impact for the Fever, but rules of the emergency hardship exception dictated that she had to be released once the Fever were healthy.\n\nAs it turned out, McDonald wasn't gone for long. When DeWanna Bonner -- the Fever's marquee free agent signing -- quit on the team in late June it opened up the cap space to sign McDonald for the remainder of the season. McDonald immediately became one of the team's best defenders and her pace, ability to get downhill and playmaking allowed the team to play largely the same way it did without Clark. The Fever were 12-8 with McDonald in the lineup.\n\nUnfortunately for McDonald and the Fever, her season came to an end during the same Aug. 7 defeat to the Mercury in which Colson was injured. In the fourth quarter of that contest, McDonald suffered a broken bone in her right foot. Over her 20 games with the Fever, McDonald averaged 9.8 points, 4.7 assists and 1.3 steals."
  },
  {
    "source": "CBS",
    "title": "Indiana Fever vs. Washington Mystics Live Score and Stats - September 7, 2025 Gametracker",
    "url": "https://www.cbssports.com/wnba/gametracker/live/WNBA_20250907_IND@WAS/",
    "date": "2025-09-07",
    "text": "A month ago, Sunday's contest pitting the Indiana Fever and host Washington Mystics seemed like it could have been one of the league's premier matchups.\n\nIt's lost much of its luster since then.\n\nThe matchup was moved from Washington, D.C, to a larger arena in Baltimore in anticipation of superstar Caitlin Clark drawing massive attention. Clark, however, announced Thursday that she would miss the rest of the season due to a groin injury.\n\nThis matchup also could have been a deciding factor in the playoff hunt. Washington was fighting for a postseason berth at 16-18 at the time, however they've since dropped eight games in a row and have been eliminated from playoff contention.\n\nThe Mystics have averaged a paltry 70 points per game during their skid and have lost five contests by double digits.\n\nWith its young core in place, Washington is now looking beyond the 2025 season.\n\n\"This is the best league in the world, you're going to lose some,\" forward Alysha Clark said after Washington's 75-69 loss to the Phoenix Mercury on Thursday. \"But it's a process, when you're in this stage of ... building for the future in that way.\"\n\nIndiana (22-20), even without Clark for most of the season, has kept a tight grip on its playoff spot. The Fever reside as the seventh seed and control their own destiny. A win over the Mystics would earn Indiana consecutive postseason appearances for the first time since 2015-16.\n\nFever coach Stephanie White said the team can't focus on those achievements yet.\n\n\"After the season, I'm sure when we reflect, we'll be able to come from a different perspective, but right now we're hungry for more,\" White said.\n\nSince a porous five-game stretch in which it allowed 90.8 points per game from Aug. 12-24, Indiana's defense has tightened up. It has conceded an average of 77.4 points in the team's last five games.\n\nThe Fever's leading scorer Kelsey Mitchell has posted 20 and 29 points, respectively, in her last two games. But the All-Star guard is averaging 17.3 points, shooting 34.7 percent from the field and 35 percent from 3-point range in three games this season versus Washington.\n\nThe Mystics' leading scorer, Sonia Citron, is averaging 15.7 points per game against the Fever this season.\n\nWashington holds a 2-1 advantage in the season series, including an 88-84 win in the teams' most recent matchup on Aug. 15.\n\n--Field Level Media"
  },
  {
    "source": "CBS",
    "title": "Caitlin Clark's injury-plagued sophomore season was a disaster for the WNBA, the Fever and herself",
    "url": "https://www.cbssports.com/wnba/news/caitlin-clarks-injury-plagued-sophomore-season-was-a-disaster-for-the-wnba-the-fever-and-herself/",
    "date": "2025-09-07",
    "text": "Caitlin Clark's sophomore season started with a triple-double and ended with a press release.\n\nEarly on Thursday evening, nearly four months after Clark walked off the floor to a standing ovation from an adoring Gainbridge Fieldhouse crowd during a 35-point win over the Chicago Sky on opening day -- a sign that perhaps the Indiana Fever's goal to compete for a championship was not outlandish -- the team announced that she would not return to the court this season.\n\nCaitlin Clark injury update: Fever star out for rest of 2025 WNBA season, calls it 'incredibly frustrating' Jack Maloney\n\n\"I had hoped to share a better update, but I will not be returning to play this season,\" Clark wrote on social media. \"I spent hours in the gym every day with the singular goal of getting back out there, disappointed isn't a big enough word to describe how I am feeling.\n\n\"I want to thank everyone who had my back through all the uncertainty. This has been incredibly frustrating, but even in the bad, there is good. The way the fans continued to show up for me, and for the Fever, brought me so much joy and important perspective. I am so proud of how this team has only gotten stronger through adversity this year. Now it's time to close out the season and claim our spot in the playoffs.\"\n\nClark, who last played on July 15, was limited to 13 games this season due to an array of injuries: left quad tightness during training camp, a left quad strain on May 24, a left groin injury on June 26 and a right groin injury on July 15. Maybe she would have made it back if not for a left ankle bone bruise during her rehab process on Aug. 7, but it's impossible to say for sure.\n\nWhat is certain is that Clark's inability to stay healthy this summer was a disaster -- for herself, her teammates, the Fever organization and the WNBA.\n\nA 'one-trick pony'\n\nIn retrospect, Clark probably shouldn't have suited up for the Fever's preseason tilt against the Brazilian national team at Carver-Hawkeye Arena on Iowa's campus one day after sitting out of their first preseason game due to left quad tightness, but nothing was going to stop her from taking the court in front of her hometown fans that day.\n\nPlus, there was nothing to suggest that Clark's quad issue was serious, and she had been an iron woman to that point. Clark played in every single game during her four seasons at Iowa and all 42 of her regular-season and playoff contests as a rookie. Prior to this summer, the last time Clark had missed a game due to injury was her sophomore year of high school.\n\nAfter the fact, however, it's easy to trace a throughline from Clark pushing through some quad tightness in May, to her brutal midseason shooting slump, to the right groin injury in July that eventually ended her season. Even when Clark was on the court this summer, she was rarely, if ever, 100%.\n\nAside from her opening-day triple-double and a brilliant 32-point, eight-rebound, nine-assist effort against the reigning champion New York Liberty upon her initial return from injury, most of the discussion about Clark's on-court performance this season was negative.\n\nClark averaged 16.5 points, five rebounds and 8.8 assists, but shot 36.7% from the field, including 27.9% from 3-point range. When she failed to make a 3-pointer in a May 22 win over the Dream, it snapped a streak of 140 games with a made 3, dating back to her sophomore season at Iowa. She would go on to have two more games without a make from behind the arc and shot just 7 of 49 on 3-point attempts in her final seven appearances. For the season, she was 2 of 35 from downtown on the road.\n\nClark's reward for trying to fight through injuries was a blow to her reputation.\n\nGolden State Valkyries coach Natalie Nakase took a victory lap after her team held Clark to 11 points on 3 of 14 from the field on June 19.\n\n\"We know she doesn't like physicality,\" Nakase said. \"We know she wants to get to that left stepback.\"\n\nESPN analyst Carolyn Peck went on TV and said that the Fever were \"even more dangerous when Caitlin Clark doesn't play\" after Indiana scored an upset win over the Las Vegas Aces on July 3 without Clark.\n\nNBA All-Star Jeff Teague chimed in to call Clark a \"one-trick pony\" and said that the WNBA had \"figured her out\" later in July, while Clark was in the middle of the worst slump of her career.\n\nIn addition to dealing with the chore of constant rehab and the mental anguish of not being able to play the game she loves, Clark had to listen to greatly exaggerated reports of her demise. If there's any silver lining to this situation, it's that Clark should have extra motivation to prove everyone wrong next season.\n\nChampionship dreams fade\n\nFollowing her historic collegiate career at Iowa, Clark burst onto the WNBA scene last season and immediately established herself as one of the league's best players. She led the Fever to the playoffs for the first time since 2016 and won Rookie of the Year while setting the league's single-game and single-season assist records. In addition, Clark finished fourth in MVP voting and became the first rookie to make the All-WNBA First Team since Candace Parker in 2008.\n\nClark's instant success allowed the Fever to put the pedal to the floor this offseason. They announced plans for a new practice facility (which they broke ground on Thursday, hours before Clark was ruled out for the season), revamped their front office, hired Stephanie White as coach and brought in half a dozen new players, including veterans DeWanna Bonner, Natasha Howard and Sophie Cunningham.\n\n\"Yeah, absolutely,\" Clark said during training camp, when asked if the team had been \"explicit\" about wanting to win a title in 2025.\n\nWhen a reporter followed up, asking what success would look like this season, Clark doubled down: \"a championship.\"\n\nThe Fever never had a chance to chase those dreams.\n\nBonner quit on the team after nine appearances, and five players, including Clark, have been ruled out with season-ending injuries. Even one of their coaches went down with a torn Achilles tendon. Despite all of the adversity the Fever have faced this season, a healthy Clark would have at least given them a shot come playoff time. Now, there's no guarantee they'll even make the postseason.\n\nBreaking down the Fever injury situation: Caitlin Clark, Sophie Cunningham among several players sidelined Jack Maloney\n\nAs of Thursday, the Fever were 21-20 -- 8-5 with Clark and 13-15 without her -- sitting in eighth place, just 1 ½ games up on the Los Angeles Sparks for the final playoff berth. Even if the Fever do hang on to clinch a spot, there's a good chance they will be the No. 8 seed and have to face the league-leading Minnesota Lynx in the first round.\n\nNo matter their opponent, the Fever will be underdogs in the first round of the playoffs. And even if Kelsey Mitchell and Aliyah Boston -- both candidates for All-WNBA recognition -- manage to lead an upset in a short best-of-three series, there's no hope of a deep run without Clark. After the Fever announced she was done for the season, their championship odds plummeted to +4500 at Caesars.\n\n'The most popular athlete in America'\n\nOn May 15, the day before the 2025 season started, WNBA commissioner Cathy Engelbert went on Bill Simmons' podcast and called Clark the \"most popular athlete in America.\"\n\n\"It is a balance, but she's a generational talent,\" Engelbert continued. \"No league is ever about one player, but in this case, Caitlin brought tens of millions of new viewers into the W. And there's no denying that impact.\"\n\nThe 2024 Draft, featuring Clark as the No. 1 overall pick, had a record 2.4 million viewers. This year, the draft was down to 1.25 million viewers. The 2024 All-Star Game, featuring Clark and Team WNBA against Team USA also set a record with 3.4 million viewers. With Clark sidelined for this year's All-Star Game in Indianapolis, the ratings dropped to 2.2 million.\n\nLast season, Game 2 of the Fever's first-round playoff series against the Connecticut Sun peaked at 2.5 million viewers. The 2024 Finals averaged 1.6 million viewers. It's easy to guess how Clark's injury will affect the figures for the 2025 playoffs later this month.\n\nAside perhaps from LeBron James in the NBA, no single player in North American sports is more important to their respective league than Clark. Everything she touches turns to gold, from TV ratings to merchandise sales to attendance figures.\n\nThe WNBA is still having a successful season -- the league broke its single-season attendance record, thanks in part to the extended 44-game season -- but there's no debate that Clark brings extra eyeballs to the league.\n\nThe reality is simple: When she's not playing, fewer people are interested."
  },
  {
    "source": "CBS",
    "title": "Chicago Sky suspend Angel Reese for one half after 'detrimental' comments made about teammates",
    "url": "https://www.cbssports.com/wnba/news/chicago-sky-suspend-angel-reese-for-one-half-after-detrimental-comments-made-about-teammates/",
    "date": "2025-09-07",
    "text": "The Chicago Sky have suspended Angel Reese due to detrimental comments she made about her teammates, the team announced on Friday. Reese will sit out the first half of the Sky's upcoming game against the Las Vegas Aces.\n\nIn an interview with the Chicago Tribune, Reese made waves by calling out her teammates in the midst of a disappointing season. In response, the Sky have chosen to suspend their star player for a half.\n\n\"The Chicago Sky values the safety, respect and well-being of every player. We are committed to accountability so our players can stay focused on playing basketball,\" the team said in a statement.\n\n\"Because of statements detrimental to the team made by Angel Reese during the league-mandated media, she will not play in the first half of the game on September 7 against the Las Vegas Aces. The matter has been handled and resolved internally, and we are moving forward as a team.\"\n\nChicago is 10-30 and has been eliminated from playoff contention. As her second WNBA season comes to an end, Reese is fed up with losing and called on the organization to make changes to the roster.\n\n\"I'm not settling for the same shit we did this year,\" Reese told the Chicago Tribune. \"We have to get good players. We have to get great players. That's a non-negotiable for me.\n\n\"I'm willing and wanting to play with the best. And however I can help to get the best here, that's what I'm going to do this offseason. So it's going to be very, very important this offseason to make sure we attract the best of the best because we can't settle for what we have this year.\"\n\nReese also made comments about specific teammates, and in one instance, expressed concern about Courtney Vandersloot's age.\n\n\"We can't rely on Courtney to come back at the age that she's at,\" Reese said. \"I know she'll be a great asset for us, but we can't rely on that. We need someone probably a little younger with some experience, somebody who's been playing the game and is willing to compete for a championship and has done it before.\"\n\nReese has since apologized for her comments, saying that they were \"taken out of context.\" The Sky star added that her teammates have \"busted their ass\" as much as she has.\n\nThis first-half suspension now means Reese will miss the Sky's next three halves of basketball. She was suspended for Friday night's game against the Fever because she surpassed the technical foul limit."
  },
  {
    "source": "CBS",
    "title": "Angel Reese apologizes to Sky teammates, says critical comments were 'taken out of context'",
    "url": "https://www.cbssports.com/wnba/news/angel-reese-apologizes-to-sky-teammates-says-critical-comments-were-taken-out-of-context/",
    "date": "2025-09-07",
    "text": "Following the Chicago Sky's 88-64 win over the Connecticut Sun on Wednesday, Angel Reese publicly apologized to her teammates for critical comments she made about them in an interview with the Chicago Tribune, and claimed that some of her words were \"taken out of context.\"\n\nHere are Reese's full postgame remarks:\n\n\"I don't think I'm frustrated. I probably am frustrated with myself right now. I think the language is taken out of context and I really didn't mean to to put down my teammates because they've been through this with me throughout the whole year. They've busted their ass just how I busted my ass, they showed up for me through thick and thin, and in the locker room when nobody could see anything. \"So I would apologize to my teammates, which I already have about the article and how it was misconstrued about what was said. I just have to be better with my language because I know it's not the message it's the messenger and understanding what I say can be taken any kind of way. So I just have to really be better and grow from this.\"\n\nThe 10-30 Sky expected to compete for a playoff spot this season. Instead, they'll miss the postseason, and, to make matters worse, owe their lottery-bound first-round 2026 draft pick to the Minnesota Lynx.\n\nAhead of the conclusion of their disappointing campaign, Reese aired her frustrations with the front office, coaching staff and roster construction. She called for major moves in free agency and hinted at leaving when her contract is up in 2027 if she doesn't see the changes she wants.\n\nAngel Reese calls out Sky's front office, demands big moves in free agency: 'We have to get great players' Jack Maloney\n\n\"I'm not settling for the same shit we did this year,\" Reese said. \"We have to get good players. We have to get great players. That's a non-negotiable for me.\n\n\"I'm willing and wanting to play with the best. And however I can help to get the best here, that's what I'm going to do this offseason. So it's going to be very, very important this offseason to make sure we attract the best of the best because we can't settle for what we have this year.\"\n\nIf Reese had left her comments there, no one would have had an issue. However, she also called out specific teammates, including guards Courtney Vandersloot, Rachel Banham and Hailey Van Lith, and said that she and fellow second-year big Kamilla Cardoso are the only guaranteed returners.\n\nReese's quote about Vandersloot, a franchise icon who has been sidelined with a torn ACL since June 7, was particularly notable.\n\n\"We can't rely on Courtney to come back at the age that she's at,\" Reese said. \"I know she'll be a great asset for us, but we can't rely on that. We need someone probably a little younger with some experience, somebody who's been playing the game and is willing to compete for a championship and has done it before.\"\n\nSky coach Tyler Marsh said that the organization is aware of Reese's comments and would handle the matter \"in-house.\" Annie Costabile of Front Office Sports reported that Reese's teammates have seen the interview and are unhappy. The Sky have planned a team meeting to discuss the situation. Costabile added, \"There is a belief among some sources that Reese's future in Chicago may not be reparable.\"\n\nReese is also facing a one-game suspension after receiving her eighth technical foul of the season against the Sun, which put her above the league's regular-season technical foul threshold. Assuming that technical does not get rescinded, Reese would serve her suspension Friday against the Indiana Fever.\n\nThe Sky's 2025 season will come to a close on Sept. 11 at home against the New York Liberty."
  },
  {
    "source": "CBS",
    "title": "WNBA Game Scores",
    "url": "https://www.cbssports.com/wnba/scoreboard/",
    "date": "2025-09-07",
    "text": ""
  },
  {
    "source": "CBS",
    "title": "Sky's Angel Reese suspended for Friday's game vs. Fever after surpassing technical foul limit",
    "url": "https://www.cbssports.com/wnba/news/skys-angel-reese-suspended-for-fridays-game-vs-fever-after-surpassing-technical-foul-limit/",
    "date": "2025-09-07",
    "text": "Chicago Sky star Angel Reese has been suspended for one game after surpassing the regular-season technical foul limit during her team's 88-64 win over the Connecticut Sun on Wednesday, the WNBA announced. Reese will serve her suspension on Friday, when the Sky take on the Indiana Fever.\n\nUnder WNBA rules, a player or coach is automatically suspended without pay for one game upon receiving an eighth technical foul during the regular season. The previous limit was seven technicals, but the league increased it to eight this season with the jump to a 44-game schedule. For every two additional technical fouls received, the player or coach will be automatically suspended for an additional game.\n\nReese was issued her league-leading eighth technical late in the second quarter on Wednesday after hitting Sun forward Aaliyah Edwards in the head while the two were battling for position under the basket. While Edwards was looking up toward the basket, Reese spun and smacked Edwards with the back of her hand.\n\nCrew chief Randy Richardson explained the decision to give Reese a technical in the pool report after the game:\n\nQUESTION: \"Could you break down the reasoning behind the technical foul that was called on Angel Reese?\" RICHARDSON: \"Yeah, so we had a flail on the court; so we had a non-call on the court and then we went to take a look at it and we deemed that to be a non-basketball act by Reese and we ended up calling the flail an unsportsmanlike technical foul.\" QUESTION: \"Can you specify what the flail was?\" RICHARDSON: \"A flail is when her arm hit (Aaliyah Edwards) in the back of the head after the ball went into the basket and it was just deemed to be an unsportsmanlike act. It was the back of the hand to the contact to Edwards.\" QUESTION: \"What is the difference between what would have been a basketball play versus a non-basketball play as you deemed it?\" RICHARDSON: \"Any contact to the head like that, we'll just take a look at that for potential, just\n\nfor the severity of the contact. We think it was just an unsportsmanlike act.\"\n\nWNBA leaders in technical fouls\n\nPlayer/Coach Team Technicals Angel Reese Sky 8 Natasha Cloud Liberty 6 Shakira Austin Mystics 5 Bria Hartley Sun 5 Tyler Marsh Sky 5\n\nReese recorded another double-double with 18 points and 13 rebounds, but shot just 4 of 12 from the field with four turnovers to bring her interesting Wednesday to a close.\n\nPrior to the game, Reese made headlines for explosive comments she gave to the Chicago Tribune, for which she has since apologized. In a lengthy interview, Reese called out the Sky's front office and coaching staff, as well as her teammates. She demanded big moves in free agency and suggested that she could leave the Sky when she reaches free agency in 2027.\n\n\"I'm not settling for the same shit we did this year,\" Reese said. \"We have to get good players. We have to get great players. That's a non-negotiable for me.\n\n\"I'm willing and wanting to play with the best. And however I can help to get the best here, that's what I'm going to do this offseason. So it's going to be very, very important this offseason to make sure we attract the best of the best because we can't settle for what we have this year.\"\n\nAngel Reese calls out Sky's front office, demands big moves in free agency: 'We have to get great players' Jack Maloney\n\nReese's remarks about franchise icon Courtney Vandersloot, who has been out since June 7 with a torn ACL, were particularly notable.\n\n\"We can't rely on Courtney to come back at the age that she's at,\" Reese said. \"I know she'll be a great asset for us, but we can't rely on that.\"\n\nCoach Tyler Marsh addressed Reese's comments prior to the team's game against the Connecticut Sun on Wednesday.\n\n\"We are aware of it,\" Marsh said. \"We're addressing it in-house as currently speaking. That's where we'll stay right now.\"\n\nReese's teammates have seen the interview and are unhappy, according to Front Office Sports, and the Sky have reported planned a team meeting to discuss the situation. \"There is a belief among some sources that Reese's future in Chicago may not be reparable,\" Annie Costabile reported."
  },
  {
    "source": "CBS",
    "title": "Cameron Brink opens up about return to Sparks, WNBA playoff push and what she learned while sitting out",
    "url": "https://www.cbssports.com/wnba/news/cameron-brink-opens-up-about-return-to-sparks-wnba-playoff-push-and-what-she-learned-while-sitting-out/",
    "date": "2025-09-07",
    "text": "Los Angeles Sparks forward Cameron Brink used her time recovering from a torn ACL to get outside her comfort zone.\n\n\"It was really important for me to have stuff outside of basketball, especially coming back from an injury,\" she told CBS Sports. \"We are not just basketball players, we are not just athletes... It was really good for me to kind of see myself as a complete person rather than someone who is just coming back from injury.\"\n\nBrink started her own podcast, modeled for Sports Illustrated, and did other unexpected side quests such as participating in State Farm's Gamerhood, a reality TV-style gaming competition. Brink said she used to play Halo with her brother and now plays Fortnite with her fiancé, so she figured that would be a fun thing to try.\n\n\"When you are recovering from an ACL surgery you have a lot of time to sit down and play video games,\" Brink said.\n\nHowever, she is grateful to return her full attention to basketball. The second-year Sparks star got back on the court late July and said it didn't really feel like she was out for 406 days. Her return came at the perfect time for the Sparks, who are still fighting for a spot in the WNBA playoffs.\n\n\"It felt like how I've always been doing it. When I step out on the court, it doesn't really feel much different,\" she said. \"It felt great. I missed it so much and I'm just looking forward to the rest of the season because I genuinely missed playing with my teammates so much and just being a part of the team instead of just cheering on the bench, which was still amazing. I learned so much watching, but I'm ready to be in the action.\"\n\nBrink was one of the top performing rookies last season and has taken pride on her defense since her time at Stanford. She was averaging 2.3 blocks per game before the injury which, had she played enough games to qualify, would have been the second-best mark in the league behind Las Vegas Aces star A'ja Wilson.\n\nShe flirted with a double-double during the Sparks 81-80 win against Dallas last week with 11 points and 8 rebounds. On Tuesday before an eight-point loss to the Phoenix Mercury, coach Lynne Roberts said her minutes restriction could increase to around 25 minutes a game, but foul trouble only kept Brink on the floor for 14.\n\n\"I don't want anyone to get an and-one, so I'm going to use my fouls,\" she said. \"I've always struggled with foul trouble but it's because I'm an aggressive player. I'm still working on it.\"\n\nBrink is a sophomore in the league but has about the same amount of playing experience as the rookies, so she is trying to not put too much pressure on herself while still learning.\n\n\"When you sit out for so long you just have an appreciation for stepping out on the court,\" she said. \"It's really hard to be part of a league that is so talented. It's a really hard league to be a part of so even being out there, I think every time I step out there I'm just genuinely so happy. I try to take it all in because you knever know what could happen.\"\n\nAs the stakes continue to rise at this stage of the regular season, Brink said her goal is to help her team make the playoffs. The Sparks have not made the postseason since 2020. At 17-19 entering play on Wednesday, they are currently ninth in the standings, 1 ½ games behind the Storm for the eighth and final playoff spot.\n\n\"We are so close and we are really hitting our stride,\" Brink said. \"Sometimes it may be hard. We've had some tough losses, some close loses. But we genuinely get better every day.\""
  },
  {
    "source": "CBS",
    "title": "Dallas Wings vs. Los Angeles Sparks Live Score and Stats - September 7, 2025 Gametracker",
    "url": "https://www.cbssports.com/wnba/gametracker/preview/WNBA_20250907_DAL@LAS/",
    "date": "2025-09-07",
    "text": "With just three games left in their regular season, the Los Angeles Sparks will try to stay alive in the WNBA playoff hunt beginning with Sunday's date against the visiting Dallas Wings.\n\nLos Angeles (19-22) sits two games behind Seattle for eighth place and the last spot in the postseason. The Sparks helped their cause with a head-to-head win over the Storm last Monday, 91-85, but come into Sunday's contest having dropped their last two.\n\nLos Angeles dropped back-to-back games in Atlanta, 86-75 Wednesday and 104-85 Friday.\n\n\"We've got a great locker room in there,\" Sparks assistant coach Mike Neighbors said following Friday's loss. \"They'll rally around each other. They've done it repeatedly throughout the year. We've battled a lot of adversity from day one with injuries and stuck together.\"\n\nOvercoming a 6-14 start to the season, Los Angeles has given itself hope of sneaking into the playoffs behind the performances of veterans Kelsey Plum, who averages a team-high 19.9 points per game, and Dearica Hamby, averaging 18.4 points and a team-high eight rebounds.\n\nSecond-year forward Rickea Jackson also has stepped into a key role, scoring at least 15 points in each of the Sparks' last four games. Jackson has scored in double-figures in nine of the last 10 contests. Her high in that stretch was a 25-point performance when Los Angeles last saw Dallas on Aug. 20.\n\nThe Sparks took an 81-80 decision in that matchup, improving to 3-0 on the season vs. the Wings (9-33).\n\nThe one-point loss is part of the nine-game losing streak Dallas takes into Sunday's game. The skid continued Thursday in an 84-80 final at Golden State, despite rookie sensation Paige Bueckers' 27 points and six assists.\n\nBueckers has been a highlight in an otherwise trying season for the last-place Wings, leading the squad with 19.1 points and 5.3 assists per game. She erupted for 44 points in the Aug. 20 meeting with Los Angeles, tying a WNBA rookie record.\n\n\"What we want to show every night (is) a fight,\" Bueckers said following Thursday's loss at Golden State. \"Regardless of who we have, what our record is, we're not focused on that.\"\n\nDallas has dealt with its share of injury struggles, most notably the absence of three-time All-WNBA honoree Arike Ogunbowale, who has been diagnosed with tendinitis in her right knee. A four-time All-Star, Ogunbowale is averaging 15.5 points per game but last played Aug. 10.\n\n--Field Level Media"
  },
  {
    "source": "CBS",
    "title": "Courtney Vandersloot responds to Angel Reese, says age is 'not a factor' and she'll return to Sky next season",
    "url": "https://www.cbssports.com/wnba/news/courtney-vandersloot-responds-to-angel-reese-says-age-is-not-a-factor-and-shell-return-to-sky-next-season/",
    "date": "2025-09-07",
    "text": "Chicago Sky point guard Courtney Vandersloot has been sidelined since June 7 with a torn ACL, but found herself in headlines this week after All-Star forward Angel Reese said that the team could not rely on her as their starting point guard next season.\n\nIn an interview with Sky broadcaster Shimmy Miller, which was taped prior to the team's win over the Connecticut Sun on Wednesday but surfaced online on Saturday, Vandersloot responded to Reese and stated that she plans to return to Chicago next season.\n\n\"Contrary to what people say or think, my age is absolutely not a factor. I am coming back,\" the 36-year-old Vandersloot said. \"I'm gonna come back better than ever because that's what I've done. I've put myself in the position to come back and compete at this age.\"\n\nIn a lengthy interview with the Chicago Tribune earlier this week, Reese aired her frustrations with the front office, coaching staff and roster construction, and called for major moves in free agency this winter.\n\n\"I'm not settling for the same shit we did this year,\" Reese said. \"We have to get good players. We have to get great players. That's a non-negotiable for me.\"\n\nAngel Reese calls out Sky's front office, demands big moves in free agency: 'We have to get great players' Jack Maloney\n\nReese also critiqued multiple teammates, including Vandersloot, Rachel Banham and Hailey Van Lith, and said that she and fellow second-year big Kamilla Cardoso are the only guaranteed returners. Reese's comments about Vandersloot were particularly notable.\n\n\"We can't rely on Courtney to come back at the age that she's at,\" Reese said. \"I know she'll be a great asset for us, but we can't rely on that. We need someone probably a little younger with some experience, somebody who's been playing the game and is willing to compete for a championship and has done it before.\"\n\nSky coach Tyler Marsh said that the team would handle Reese's comments \"in-house.\" The organization later suspended Reese for the first half of the team's game against the Las Vegas Aces on Sunday. Reese had previously been suspended for the team's loss to the Indiana Fever on Friday for accumulating too many technical fouls.\n\nReese has since apologized for her comments and said that they were \"taken out of context.\"\n\nThe 10-31 Sky hoped to compete for a playoff spot this season, but have long been eliminated from playoff contention. To make matters worse, they owe the Minnesota Lynx their first-round pick in the 2026 WNBA Draft and could give away the No. 1 overall selection.\n\nReese and the Sky have three games remaining and will conclude their campaign on Sept. 11 against the reigning champion New York Liberty."
  },
  {
    "source": "CBS",
    "title": "Chicago Sky vs. Las Vegas Aces Live Score and Stats - September 7, 2025 Gametracker",
    "url": "https://www.cbssports.com/wnba/gametracker/preview/WNBA_20250907_CHI@LVA/",
    "date": "2025-09-07",
    "text": "The Las Vegas Aces set a franchise record with their 13th win in a row, and they did so by taking down the team that last beat them in a potential WNBA Finals preview.\n\nThe Aces will see how far this run can take them with three games remaining in the regular season, starting with two at home against the Chicago Sky. They will begin that set Sunday night and run it back on Tuesday.\n\nLas Vegas' 97-87 home win over the Minnesota Lynx on Thursday was the biggest of the team's historic streak because of what it represented. The last time the Aces and Lynx had squared off on Aug. 2, Minnesota ran away with a 111-58 laugher, handing Las Vegas the second-worst loss in WNBA history.\n\nThe Aces (27-14) wouldn't let that happen again. They shot a resounding 38 of 69 from the field (55.1 percent), had 25 assists to 12 turnovers and outscored Minnesota in every quarter. A'ja Wilson was a dominant 12-for-15 shooting for 31 points and eight rebounds.\n\n\"When you're losing, you have to fight off human nature to question yourself,\" Aces coach Becky Hammon said. \"You have to stay really resolute in what you believe. ... Even though we were losing games, I told them multiple times, 'We're so close to turning that corner. And once that corner is turned, it's going to be scary.'\"\n\nWilson has re-entered the MVP conversation by scoring 30-plus points in seven of her last 10 games. In the 13-game win streak, she's averaged 27.2 points, 12.1 rebounds, 2.4 assists and 2.0 blocks.\n\nIf they win out, the Aces would tie the 2014 Phoenix Mercury for the second-longest win streak in WNBA history at 16. Only the 2001 Los Angeles Sparks (18) had a longer run.\n\nLas Vegas gets to face badly struggling Chicago (10-31), a team that won't have star Angel Reese for the first half of Sunday's game.\n\nAfter Reese was suspended for Friday against the Indiana Fever for technical foul accumulation, her team handed her an additional half-game punishment for comments she made to the Chicago Tribune about needing better players around her next year. The discipline came as a surprise, as it was announced after Reese had apologized privately and publicly.\n\n\"It was from the top down. It was an organizational decision,\" said Tyler Marsh, wrapping up his first year as a head coach at any level. \"It's kinda handled internally and that's kinda what it's been.\"\n\nWithout Reese, the Sky fell 97-77 at the Fever on Friday. Kamilla Cardoso had 18 points and nine rebounds, and Michaela Onyenwere also supplied 18 points.\n\n--Field Level Media"
  },
  {
    "source": "WNBA",
    "title": "Team News Archive",
    "url": "https://www.wnba.com/news/category/team-news",
    "date": "2025-09-07",
    "text": "A Minnesota Basketball Legend Returns: What Led Lindsay Whalen Back to the Lynx Sideline?\n\nAfter winning four WNBA championships with the Lynx, Lindsay Whalen is now back to business as an assistant, hoping to help them win their fifth.\n\nJun 24, 2025"
  },
  {
    "source": "WNBA",
    "title": "2025 WNBA Power Rankings: Week 13",
    "url": "https://www.wnba.com/news/2025-power-rankings-week-13",
    "date": "2025-09-07",
    "text": "The playoff picture is beginning to come into focus. In the past week, the Lynx clinched the best record in the league, while the Aces, Dream and Mercury all punched their tickets to the playoffs.\n\nThat means we have four teams in, we have four teams out and four spots left with five teams still in the mix.\n\nWho’s In: Lynx (clinched No. 1 seed), Aces, Dream, Mercury\n\nWho’s Out: Mystics, Sun, Sky, Wings\n\nWho’s In The Mix: Liberty, Storm, Valkyries, Fever, Sparks\n\nWho’s In: Clinched Playoff Berth\n\n1. Minnesota Lynx (31-8) ↔️\n\nLast Week: 1\n\nThis Week: Mon vs. DAL, Thur. at LVA, Sat. at GSV\n\nMinnesota’s win over Connecticut on Saturday not only clinched the No. 1 seed in the playoffs, it also set a Lynx franchise record for wins in a season (31), surpassing the mark they set last year (30) with five games to play. One of those remaining games is a marquee matchup with the red-hot Aces on Thursday. While the game won’t affect Minnesota’s playoff position, it can impact both the scoring title and MVP races between Napheesa Collier (23.41 ppg) and A’ja Wilson (23.36) – who enter the week in a dead heat in scoring average while Minnesota leads the season series 3-0.\n\n2. Las Vegas Aces (26-14) ↔️\n\nLast Week: 2\n\nThis Week: Thur. vs. MIN, Sun. vs. CHI\n\nTiebreakers (Top 4 Race): 3-0 vs. ATL, 3-1 vs. PHX, 1-2 vs. NYL\n\nIt was another perfect week for the Aces with road wins at Chicago and Atlanta to extend their win streak to a franchise-record-tying 12 games. Wilson continues to dominate both ends of the court – averaging 26.8 points, on 50.4% FG, 45% 3P, 87.9% FT shooting splits, along with 12.4 rebounds, 2.4 assists, 2.0 blocks and 1.5 steals. Las Vegas will look to set a new mark in Thursday’s showdown with Minnesota.\n\n3. Atlanta Dream (25-14) ↔️\n\nLast Week: 3\n\nThis Week: Mon at CON, Wed. vs. LAS, Fri. vs. LAS\n\nTiebreakers (Top 4 Race): 3-0 vs. PHX, 2-2 vs. NYL, 0-3 vs. LVA\n\nAt 12-5, the Dream have been the second best team since the All-Star break. However, three of those five losses have come to the Aces, who have passed the Dream in the standings and own the head-to-head tiebreaker should it be needed at season’s end. Atlanta enters the week tied with Phoenix at 25-14, but holds the No. 3 spot in the standings after sweeping the season series with the Mercury (3-0).\n\n4. Phoenix Mercury (25-14)\n\nLast Week: 4 ↔️\n\nThis Week: Tue. vs. IND, Thur. at WAS, Sat. at CON\n\nTiebreakers Top 4 Race: 3-1 vs. NYL, 1-3 vs. LVA, 0-3 vs. ATL\n\nThe Mercury are riding a four-game win streak as they look to secure a top-four finish and home-court advantage in the opening round of the playoffs. Phoenix enters this week tied with Las Vegas and Atlanta in the loss column (14) but does not hold the head-to-head tiebreaker over either team, making a climb to No. 2 or No. 3 more challenging. However, Phoenix does hold a two-loss edge and the tiebreaker over No. 5 New York as the Mercury try to hold off the defending champs.\n\nWho’s In The Mix: Race For Playoffs\n\n5. New York Liberty (24-16) ↔️\n\nLast Week: 5\n\nThis Week: Tue. at GSV, Fri. at SEA\n\nTiebreakers (Top 4 Race): 2-1 vs. LVA, 2-2 vs. ATL, 1-3 vs. PHX\n\nTiebreakers (Playoff Race): 3-0 vs. GSV (1 left), 3-1 vs. IND, 2-1 vs. LAS, 0-2 vs. SEA (1 left)\n\nThe Liberty enter this week in a unique position – they are the only team that is still in contention for a top-four finish while not having clinched a playoff berth. New York enters this week with a magic number of one, meaning they need one win (first chance is Tuesday at Golden State) or one Sparks loss (first chance is Monday at Seattle) to punch their fifth straight postseason ticket. After getting Natasha Cloud back on Saturday, New York hopes to get back to full health with Sabrina Ionescu (toe) and Nyara Sabally (knee) soon.\n\n6. Golden State Valkyries (21-18) ⬆️\n\nLast Week: 7\n\nThis Week: Tue. vs. NYL, Thur. vs. DAL, Sat. vs. MIN\n\nTiebreakers (Playoff Race): 3-0 vs. IND, 3-1 vs. LAS, 2-1 vs. SEA (1 left), 0-3 vs. NYL (1 left)\n\nA three-game win streak has helped Golden State’s effort to become the first expansion team to reach the playoffs in its inaugural season, but there is still work to be done. Four of the Valkyries’ final five games come against teams that have either clinched a playoff berth (two games vs. Minnesota) or remain in the playoff mix (New York and Seattle). Can Veronica Burton continue dishing dimes — she has 13+ assists in three of her last five games — and help Golden State make history?\n\n7. Seattle Storm (22-19) ⬇️\n\nLast Week: 6\n\nThis Week: Mon. vs. LAS, Fri. vs. NYL\n\nTiebreakers (Playoff Race): 2-0 vs. NYL (1 left), 1-2 vs. GSV (1 left), 1-2 vs. LAS (1 left), 0-3 vs. IND\n\nOn Thursday in Minnesota, the Storm overcame a 21-point deficit to rally past the league-leading Lynx for a statement road win after Seattle entered the game 0-10 on the season when trailing by 16+ points. That was one of the Storm’s five wins over their last six games as they look to close the season strong and secure their playoff berth. Tonight’s game against Los Angeles is big as a loss would drop Seattle to 20 losses (even with L.A.) and give the Sparks the head-to-head tiebreaker.\n\n8. Indiana Fever (21-19) ↔️\n\nLast Week: 8\n\nThis Week: Tue. at PHX, Fri. vs. CHI, Sun. at WAS\n\nTiebreakers (Playoff Race): 3-0 vs. SEA, 1-3 vs. NYL, 1-3 vs. LAS, 0-3 vs. GSV\n\nAfter opening the week with wins over Seattle and Los Angeles to climb to sixth place in the standings, the Fever lost Sunday’s game against Golden State to drop back down to eighth. While the Fever hold the head-to-head tiebreaker over Seattle, they do not have tiebreakers against the Liberty, Sparks or Valkyries, which are the three teams closest to Indy in the playoff race. This week, the Fever head to Phoenix to face the playoff-bound Mercury before a pair of games against teams that have already been eliminated.\n\n9. Los Angeles Sparks (18-20) ↔️\n\nLast Week: 9\n\nThis Week: Mon. at SEA, Wed. at ATL, Fri. at ATL, Sun. vs. DAL\n\nTiebreakers (Playoff Race): 3-1 vs. IND, 2-1 vs. SEA (1 left), 1-2 vs. NYL, 1-3 vs. GSV\n\nNo team has a busier remaining schedule than the Sparks – who have played in a league-low 38 games and have six games over the season’s final 11 days, including four this week – as L.A. looks to snap a four-year playoff drought. Monday night’s game at Seattle is crucial as a win will prevent L.A. from dropping further from the pack in the loss column, while tying the season series with the Storm. It is the first of four remaining road games for the Sparks, who have been better away (10-8) than at home (8-12) this season.\n\nWho’s Out: Eliminated From Playoffs\n\n10. Washington Mystics (16-25) ↔️\n\nLast Week: 10\n\nThis Week: Thur. vs. PHX, Sun. vs. IND\n\nSaturday’s loss at Golden State not only marked Washington’s largest margin of defeat (-37) since 2008, it also officially eliminated the Mystics from the playoffs. Sunday’s loss in L.A. made it seven straight for the Mystics, who will finish 10th in the standings regardless of the outcome of all remaining games – they can’t catch any team in the top nine and can’t be caught by any of the teams below them.\n\n11. Connecticut Sun (10-29) ↔️\n\nLast Week: 11\n\nThis Week: Mon. vs. ATL, Wed. at CHI, Sat. vs. PHX\n\nDespite Sunday’s loss to Minnesota, the Sun have played their best ball of the season down the stretch – going 5-3 in their last eight games. During this stretch, veterans Tina Charles (17.3 ppg) and Marina Mabrey (15.1 ppg) have led the way, but they are followed in scoring by a trio of rookies — Leïla Lacan (11.6 ppg, 5.8 apg, 2.6 spg), Saniya Rivers (10.0 ppg, 44.8% 3P) and Aneesah Morrow (8.6 ppg, 9.3 rpg).\n\n12. Chicago Sky (9-30) ↔️\n\nLast Week: 12\n\nThis Week: Wed. vs. CON, Fri. at IND, Sun. at LVA\n\nMonday’s game against Las Vegas saw the Sky retire Candace Parker’s No. 3 jersey during a halftime ceremony. That game also saw Angel Reese pass Tina Charles (45) for the most double-doubles through a player’s first two seasons in WNBA history. With two more double-doubles last week, Reese is up to 48 and counting. The Sky enter this week looking to snap a four game slide as Chicago has gone just 2-17 in its last 19 games.\n\n13, Dallas Wings (9-31) ↔️\n\nLast Week: 13\n\nThis Week: Mon. at MIN, Thur. at GSV, Sun. at LAS\n\nThe injuries and the losses continue to climb for Dallas, which has eight players listed on its injury report entering Monday’s game in Minnesota. That includes rookie sensation Paige Bueckers (left calf), who is on pace to finish in the top 10 in scoring (18.9 ppg), assists (5.4 apg) and steals (1.6) in her first season as a pro. The Wings have dropped seven straight and are 3-18 over their last 21 games."
  },
  {
    "source": "WNBA",
    "title": "Analysis Archive",
    "url": "https://www.wnba.com/news/category/analysis",
    "date": "2025-09-07",
    "text": "Players to Watch Ahead of WNBA All-Star 2025\n\nWith All-Star week upon us, here are 10 (or so) players that have been some of my favorites to watch so far this season.\n\nJul 16, 2025"
  },
  {
    "source": "WNBA",
    "title": "WNBA Best Bets for August 29: Weekend Preview and WNBA Finals Odds",
    "url": "https://www.wnba.com/news/wnba-best-bets-august-29",
    "date": "2025-09-07",
    "text": "The 2025 WNBA regular season is in its final stretch, and the competition is HOT. The expansion Golden State Valkyries are chasing history as they fight to clinch a postseason berth in their inaugural year, while Indiana’s Caitlin Clark inches closer to a long-awaited return. Meanwhile, Alyssa Thomas continues to redefine versatility with a record-breaking seventh triple-double, fueling Phoenix’s late push.\n\nWith the playoff picture tightening and sportsbooks adjusting daily, this weekend offers bettors compelling angles tied directly to the league’s biggest headlines\n\nLet’s take a look at the latest WNBA odds for the WNBA Finals, give a weekend preview, and I’ll share my best bets for Friday and Saturday’s games on DraftKings Sportsbook You can also find more WNBA previews, picks, and daily content on DraftKings Network.\n\n2025 WNBA Finals Odds\n\nThe Favorite: MIN Lynx (+135)\n\nMinnesota remains the Finals favorite at +135, and for good reason. The Lynx sit atop the league at 30-7 with a six-game cushion, having beaten the defending champion Liberty three times this season and held down the best defense and offense in the league.\n\nNapheesa Collier’s return only strengthens their case, dropping 32 points and nine rebounds in her first game back, reasserting her MVP status. With a playoff berth locked and depth pieces like Jessica Shepard and Courtney Williams delivering in big spots, Minnesota’s mix of elite scoring, defense, and veteran leadership makes them the clear team to beat.\n\nWNBA Best Bets and Weekend Preview\n\nDallas Wings at Atlanta Dream — Friday, August 29, 7:30 PM ET\n\nThe Atlanta Dream enter the weekend looking to rebound after falling to the red-hot Las Vegas Aces, who have ripped off 12 straight wins. Rhyne Howard and Brionna Jones each dropped 19 points in that loss, but Atlanta has now failed to crack 80 points in five straight contests despite still owning the third-best offensive rating in the league (106.4).\n\nThe Dallas Wings, meanwhile, are trending in the opposite direction, dropping six in a row and 11 of their last 12, sliding to the bottom of the standings. Scoring hasn’t been their issue, but their second-worst defense — especially in transition — continues to sink them. That’s a suboptimal matchup against an Atlanta team that thrives when they can get out and run.\n\nFrom a betting perspective, this feels like a spot where the Dream should control the pace and cover. Look for Allisha Gray (18.8 PPG, 38.8% from three) to shine in a revenge game against her former team, making her scoring props an intriguing angle alongside a play on Atlanta against the spread.\n\nLean: ATL -13\n\nPICK: Allisha Gray Over 16.5 Points (-115)\n\nIndiana Fever at Los Angeles Sparks — Friday, August 29, 10:00 PM ET\n\nThe Indiana Fever are in must-win mode to stay in the playoff picture, but injuries have taken a toll. They’ve gone 10–11 without Caitlin Clark and just 3–6 in their last nine, though Clark’s recent return to non-contact drills hints she could be back soon. The Los Angeles Sparks, meanwhile, sit ninth in the standings but have already swept the season series 3-0, including a 100–91 win on Aug. 5. With Kelsey Plum averaging 20.4 PPG (23.1 over her last six), L.A. has the momentum and matchup edge. From a betting standpoint, even with Indiana’s desperation factor, the Sparks on the moneyline remain the play I’m eyeing.\n\nLean: LA ML\n\nPICK: Kelsey Plum Under 2.5 Three-Pointers Made (-140)\n\nWashington Mystics at Golden State Valkyries — Saturday, August 30, 8:30 PM ET\n\nThe Golden State Valkyries are closing in on history, sitting seventh in their inaugural WNBA season and looking to become the first expansion team to reach the playoffs in Year 1. They’ll lean heavily on Veronica Burton, who’s already delivered two of the only eight games in league history with 24+ points and 13+ assists, as they try to lock in that postseason spot down the stretch.\n\nThe Washington Mystics, meanwhile, are reeling after an 89–63 blowout loss to the Liberty on Thursday, their fifth straight defeat. With a bottom-third offense (10th in rating) and only average defense (7th), they’ll need big nights from rookie standouts like Sonia Citron (15.2 PPG) and Kiki Iriafen to stay alive in the playoff hunt.\n\nFrom a betting lens, momentum leans heavily toward Golden State. The Valks’ depth and Burton’s elite playmaking make them a strong pick against a struggling Mystics squad.\n\nPICK: GS -5.5 (-105)\n\nAll season long, I’ll be tracking the WNBA Odds for MVP, Finals Winner and more right here!\n\nAll odds and lines provided by DraftKings Sportsbook and are subject to change.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER (1-800-426-2537) (AZ/CO/DC/IA/IL/IN/KS/KY/LA/MD/ME/MI/NC/NJ/NH/OH/OR/PA/TN/VA/VT/WV/WY), (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY / text HOPENY (467369) (NY).\n\nPlease Gamble Responsibly. Call 1-888-789-7777 / visit ccpg.org (CT), or visit www.1800gambler.net (WV). Void where prohibited.\n\n21+ (18+ DC/KY/NH/WY). Physically present in AZ/CO/DC/CT/IL/IN/IA/KS/KY/LA(select parishes)/MA/MD/ME/MI/NC/NH/NJ/NY/OH/OR/PA/TN/VA/VT/WV/WY only. Void in ONT. Eligibility restrictions apply. See terms at draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS)."
  },
  {
    "source": "WNBA",
    "title": "2025 WNBA Power Rankings: Week 11",
    "url": "https://www.wnba.com/news/2025-power-rankings-week-11",
    "date": "2025-09-07",
    "text": "Before we dive into this week’s power rankings, let’s pause for a moment to recognize the history that went down in Seattle on Sunday as Sue Bird became the first WNBA player honored with a statue by their franchise.\n\nThe No. 1 pick in the 2002 WNBA Draft, Bird spent her entire 20-year career in Seattle, leading the Storm to four titles and retiring in 2022 as the WNBA’s all-time leader in games played (580), minutes (18,079), assists (3,234) and All-Star selections (13) – marks that still hold today.\n\n“People keep asking me what it feels like to be the first,” said Bird during her speech. “The truth is that I never set out to be the first at anything, but if being the first means I won’t be the last, if this statue means that 20 years from now there will be statues of other WNBA greats … then I’m proud to be the first.”\n\nThe bronze statue outside Climate Pledge Arena depicts Bird in her signature ponytail, but rather than a pose of a pass to represent her record in assists, or a jumper to represent her clutch buckets in the playoffs, the statue sees Bird gliding in for a layup.\n\n“My very first points in the WNBA at KeyArena as a rookie were on a layup,” said Bird. “My very final points in the WNBA were at Climate Pledge on a layup.”\n\nWhile the statue’s pose symbolizes the start and end of her two-decade career in Seattle, the statue’s presence means she’ll remain a part of the city for decades to come.\n\nCongrats to Sue! Now, onto this week’s power rankings.\n\n1. Minnesota Lynx (28-5) ↔️\n\nLast Week: 1\n\nThis Week: Tue. at NYL, Thur. at ATL, Fri. at IND, Sun vs. IND\n\nIt was one game, one win for the Lynx this week as they improved to 3-0 against New York in this season’s rematches of last year’s Finals. The Lynx have already clinched a playoff berth and continue to stack wins – six in a row to enter the week – despite being without MVP frontrunner Napheesa Collier (ankle) for the last four games. With a 6.5-game lead on the field with 12 games to play, the Lynx can be cautious with Collier’s return to ensure she is 100% for the postseason.\n\n2. Atlanta Dream (22-12) ↔️\n\nLast Week: 2\n\nThis Week: Tue. at LVA, Thur. vs. MIN, Sat. vs. NYL\n\nAtlanta’s six-game win streak – tied for the third-longest in franchise history – was snapped on Friday as the Storm held off the Dream in a thriller in Vancouver. Atlanta bounced back with a win over Golden State on Sunday to wrap the week in sole possession of second place in the WNBA, holding a one-game lead on the Liberty. The Dream face a loaded schedule this week – playing the three teams that reached the past two WNBA Finals: the Aces (2023 champs), the Lynx (2024 runner-up) and Liberty (2024 runner-up, 2025 champs).\n\n3. Las Vegas Aces (21-14) ⬆️\n\nLast Week: 5\n\nThis Week: Tue. vs.. ATL, Thur. vs. PHX, Sat. at WAS\n\nThe Aces are back! Las Vegas has won seven straight – the longest active win streak in the league – and 12 of its last 15 games to climb from ninth to fifth in the standings and just 1.5 games back of second place. Since Vegas’ win streak started on Aug. 3, A’ja Wilson has led the WNBA in scoring (26.1 ppg) and rebounding (13.3 rpg) while also ranking top 10 in both steals (1.7 spg) and blocks (1.4 bpg) over the past two weeks.\n\n4. New York Liberty (21-13) ⬇️\n\nLast Week: 3\n\nThis Week: Tue. vs. MIN, Thur. vs. CHI, Sat. at ATL\n\nThe Liberty are 4-7 since losing Breanna Stewart to a knee injury just three minutes into their game against the Sparks on July 26. Three of those seven losses have come against the league-leading Lynx, while another came this week against the streaking Aces. While Stewart is expected to return by late August, the Liberty face another challenging week, taking on Minnesota and Atlanta – the only two teams ahead of New York in the standings – on Tuesday and Saturday, respectively.\n\n5. Phoenix Mercury (20-13) ⬇️\n\nLast Week: 4\n\nThis Week: Tue. at GSV, Thur. at LVA, Fri. vs. GSV\n\nThe Mercury went to Seattle and spoiled Sue Bird statue night on Sunday behind Alyssa Thomas’ fifth triple double of the season. Thomas now has more triple-doubles in just her first 28 games on the Mercury than any other player has in their entire career. Yes, five of Thomas’ record 20 career triple-doubles have come in her first season in Phoenix. The next closest players on the all-time triple-double list (regular and playoffs combined) are Sabrina Ionescu (four), Caitlin Clark and Candace Parker (three each).\n\n6. Golden State Valkyries (18-16) ⬆️\n\nLast Week: 8\n\nThis Week: Tue. vs. PHX, Fri. at PHX, Sun. at DAL\n\nThe longest win streak in franchise history – aka this season – was snapped at four straight on Sunday against the Dream. However, Golden State is 7-3 in its last 10 games and would make the playoffs if the season ended today. They are part of a five-team cluster – along with the Fever (19-16), Storm (17-18), Sparks (16-18) and Mystics (16-18) – separated by just two losses and battling for three playoff spots.\n\n7. Indiana Fever (19-16) ⬇️\n\nLast Week: 6\n\nThis Week: Fri. vs. MIN, Sun. at MIN\n\nSunday’s game against Connecticut was a microcosm of Indiana’s season. They lost another guard to injury – Sophie Cunningham left in the second quarter and will undergo an MRI on her knee today – and they showed their resiliency and fight to overcome being shorthanded. Behind Kelsey Mitchell’s 38 points, the Fever pulled off a franchise-record 21-point comeback to defeat the Sun in overtime, avoiding a three-game skid and inspiring this postgame speech from coach Stephanie White.\n\nThe Fever are off until Friday when they begin a home-and-home set with the league-leading Lynx, giving them a few days to figure out a guard rotation as Cunningham will likely join Clark (hopeful to get her back before the end of the regular season), Aari McDonald and Sydney Colson (both out of the year) on the sideline.\n\n8. Los Angeles Sparks (16-18) ⬇️\n\nLast Week: 7\n\nBehind a stretch of eight wins in a nine-game span, the Sparks ascended the standings and the power rankings over the past few weeks. However, since that hot streak, the Sparks have dropped three of their last five games, falling into a three-way tie with Seattle and Washington with 18 losses each as the three teams sit between eighth and 10th in the standings – all eyeing a playoff spot.\n\n9. Seattle Storm (17-18) ↔️\n\nLast Week: 9\n\nThis Week: Tue. at CHI, Fri. at DAL, Sun. at WAS\n\nThe Storm held off a fourth quarter rally by the Dream to not only win the WNBA Canada Game in Vancouver on Friday, but also snap a season-long six-game losing streak. However, the Storm were unable to follow that win with another as they fell to the Mercury on Sue Bird statue night on Sunday. Seattle is one of two teams – along with the Sparks – who have been better on the road (9-8) compared to home (8-10). The Storm can add to that road win total this week as they open their final trip of the season with stops in Chicago, Dallas and Washington.\n\n10. Washington Mystics (16-18) ↔️\n\nLast Week: 10\n\nThis Week: Tue. vs. CON, Thur. at CON, Sat. vs. LVA, Sun. vs. SEA\n\nAfter a 2-7 stretch from July 15-Aug. 8 dropped Washington four games below .500 for the season, the Mystics have won three of their last four games to reach 16-18 – keeping them in the playoff battle. Washington’s All-Star rookie duo continues to lead the way, with Sonia Citron (19.5 ppg, 62.5% on 3s) and Kiki Iriafen (18.3 ppg, 10.5 rpg, 59.5% FG) combining to average 37.8 ppg over the past four games.\n\n11. Dallas Wings (9-26) ⬆️\n\nLast Week: 12\n\nThis Week: Wed. at LAS, Fri. vs. SEA, Sun. vs. GSV\n\nThis week started with a case of déjà vu – with different results – for the Wings. On Tuesday, Dallas snapped a five-game losing streak with a one-point win over Indiana despite the Fever closing the game with a 19-3 run. On Friday, it was the Wings that made the closing run (19-2) before ultimately falling short by a single point. Keep an eye on Maddy Siegrist, who’s helped fill the void left by Arike Ogunbowale (knee), with 20 ppg on 64.9 FG, 45.5% 3P and 100% FT shooting splits over the past three games.\n\n12. Chicago Sky (8-25) ⬇️\n\nLast Week: 11\n\nThis Week: Tue. vs. SEA, Thur. at NYL, Sat. vs. CON\n\nDating back to July 14, the Sky have gone just 1-12 in their last 13 games, with losing streaks of eight and (currently active) four games. They’ve been outscored by an average of 18.1 ppg during this stretch, with All-Star forward Angel Reese appearing in only three of those games as she continues to battle a back injury.\n\n13. Connecticut Sun (6-27) ↔️\n\nLast Week: 13\n\nThis Week: Tue. at WAS, Thur. vs. WAS, Sat. at CHI\n\nAfter Sunday’s overtime loss to the Fever, the Sun are just two losses away from being the first team officially eliminated from playoff contention this season. Connecticut enters the week nine losses behind the eighth place Storm with 11 games to play."
  },
  {
    "source": "WNBA",
    "title": "Napheesa Collier Remains WNBA MVP Favorite, but Race is Heating Up",
    "url": "https://www.wnba.com/news/wnba-mvp-favorites",
    "date": "2025-09-07",
    "text": "The WNBA MVP race could be heating back up during the final weeks of the 2025 regular season.\n\nSince late May, Minnesota Lynx forward Napheesa Collier has been the betting favorite to win MVP at the BetMGM online sportsbook. She remains a -325 favorite, giving her an implied probability of 76.47%, despite being out for more than two weeks with an ankle injury.\n\nWhile Collier has missed the past five games for Minnesota, a pair of contenders have started to apply pressure on her in this race.\n\nLas Vegas Aces forward A’ja Wilson is second in the latest WNBA MVP odds with a price tag of +450, giving her an implied probability of 18.18%. Phoenix Mercury forward Alyssa Thomas is +600, which suggests an implied probability of 14.29%.\n\nNo other player is listed better than 150/1 to win the award at BetMGM. Only six options are remaining in this market.\n\nCollier’s case could be the easiest, assuming she’s able to return to action soon. She’s the best player on the best team in the league. Minnesota is 6.5 games clear of anyone else with a 28-6 overall record.\n\nAfter finishing as a runner-up in last year’s MVP race, Collier leads the league with an average of 23.5 points per game while shooting 53.7% from the floor. She’s played 26 contests this year, averaging 7.5 rebounds, 3.5 assists, 1.8 steals, and 1.6 blocks per game.\n\nWilson has recently emerged as Collier’s primary challenger after scoring 30-plus points in three consecutive games. She’s led the Aces (22-14) to eight wins in a row, as they have surged to fifth in the WNBA standings.\n\nWilson, who won last year’s award over Collier, is trying to become the first player in WNBA history to win four MVP awards, averaging 22.9 points, 10 rebounds, 3.3 assists, and 2.2 blocks in 32 games.\n\nThomas has remained in the mix throughout her first season with the Mercury, who sit fourth in the updated WNBA playoff picture at 21-13. She’s pacing the league with a career-best nine assists per game in this system, while averaging 16.1 points, 8.6 rebounds, and 1.6 steals in 29 contests.\n\nThomas, who finished runner-up in the 2023 MVP race, has recorded five triple-doubles this year. No other WNBA player has more than four in their entire career.\n\nWith the way these three stars are playing this year, the WNBA MVP race could become a compelling conversation down the stretch.\n\nWNBA MVP Odds 2025\n\nNapheesa Collier -325\n\nA’ja Wilson +450\n\nAlyssa Thomas +600\n\nSabrina Ionescu +15000\n\nAllisha Gray +30000\n\nCaitlin Clark +50000\n\nVisit the BetMGM sportsbook throughout the season for updated WNBA futures, including WNBA Finals odds. You can also view updated sportsbook promos, including a First Bet Offer for eligible new customers."
  },
  {
    "source": "WNBA",
    "title": "WNBA Best Bets for August 22: Weekend Preview and WNBA Champion Odds",
    "url": "https://www.wnba.com/news/weekend-preview-and-wnba-champion-odds",
    "date": "2025-09-07",
    "text": "The 2025 WNBA regular season is entering its final stretch, with a weekend slate full of matchups that could reshape the playoff race. The Liberty and Dream clash Saturday in a pivotal fight for the potential No. 2 seed behind the already-clinched Lynx, while rookie Paige Bueckers just turned heads with a stunning 44-point outburst. With WNBA Finals odds shifting, this weekend offers not only high-stakes action on the court but also some of the best bets of the season for fans and bettors.\n\nLet’s take a look at the latest WNBA odds for the WNBA Finals, give a weekend preview, and I’ll share my best bets for Friday and Saturday’s games on DraftKings Sportsbook You can also find more WNBA previews, picks, and daily content on DraftKings Network.\n\n2025 WNBA Finals Odds\n\nThe Favorite: MIN Lynx (+145)\n\nFor the first time in three weeks, the favorite to win the WNBA Finals remains on top, and it’s Minnesota (+145) holding the crown. The Lynx have not only separated from the pack but dominated it, sitting first in the league at 26-7 and 5.5 games clear of their closest challenger, Atlanta. They’ve beaten the defending champion New York Liberty three times this season, continue to own the best offense and defense in the league, and have done it all without MVP front-runner Napheesa Collier.\n\nWith a playoff berth already secured, Minnesota continues to prove they’re the most formidable opponent in the postseason. A balanced roster built on elite scoring, suffocating defense, and veteran leadership has carried them this far, and Collier’s return will only make them more dangerous.\n\nWNBA Best Bets and Weekend Preview\n\nSeattle Storm at Dallas Wings — Friday, August 22, 7:30 PM ET\n\nDallas knew what it was getting when it drafted Paige “Ms. Buckets” Bueckers No. 1 overall, and she delivered in a big way with 44 points against the Sparks, tying Cynthia Cooper’s 28-year-old rookie scoring record. Still, the 9-27 Wings couldn’t close, losing 81-80 and have officially been bounced from playoff contention.\n\nThey now face a Seattle team that’s stumbled of late, dropping seven of its last ten to fall back to .500, though veterans Skylar Diggins and Nneka Ogwumike helped notch a crucial win over Chicago earlier this week. Offensively, both teams rank near the bottom (Dallas 9th, Seattle 8th in offensive rating), but the Storm hold the edge defensively. With Ezi Magbegor holding down the paint (2.1 BPG), Gabby Williams locking down the perimeter (2.4 SPG), and the team holding opponents to 80.1 points per game (5th), Seattle has the talent to rewrite the ship\n\nWith their playoff lives on the line, the Storm are the safer lean tonight. That said, Bueckers proving she’s a bucket every night? I’m backing that, too.\n\nLean: Storm ML\n\nPICK: Paige Bueckers Over 19.5 Points (+100)\n\nMinnesota Lynx at Indiana Fever — Friday, August 22, 7:30 PM ET\n\nEven without MVP front-runner Napheesa Collier, the Lynx have looked like a well-oiled machine, leaning on their depth and a next-player-up mentality to go 4-2 in her absence. After being taken down Thursday by a surging Atlanta Dream, Minnesota now faces an Indiana Fever team that has been hit hard by injuries. Sophie Cunningham is out for the season with a torn MCL — the third Fever guard lost in just two weeks — while Caitlin Clark remains sidelined with a bone bruise suffered on August 7.\n\nStill, the Fever have managed to win six of their last 10 and currently sit sixth in the league standings, with Golden State and Seattle close behind. The challenge Friday is steep: the Lynx remain the championship favorite, boasting both the league’s best defense (96.7 rating) and best offense (109.7 rating) even without Collier on the floor. With their depth, consistency, and proven ability to handle adversity, Minnesota has the edge to overpower an injury-riddled Fever squad tonight.\n\nPICK: MIN Lynx -6 (-110)\n\nNew York Liberty at Atlanta Dream — Saturday, August 23, 2:00 PM ET\n\nTalk about a matchup. The Dream have surged into second place behind Minnesota, winning eight of their last 10 and edging out the Finals-favorite Lynx 75-73 on Thursday. The Liberty, meanwhile, continue to stumble without Breanna Stewart — just 5-5 over their last 10 — showing lapses in fundamentals. While they’re only allowing 81.7 points per game, New York leads the league in opponent rebounds (36.4), saw their defensive rating balloon to 110.9 at a point in August, and remains plagued by turnovers.\n\nAllisha Gray has been on fire, averaging 18 points per game over her last 10 and dropping 27 against the league’s top defense in her last outing. With New York’s defense slipping, Gray looks primed for another big performance. I’m backing her to light it up again Saturday afternoon.\n\nLean: ATL ML\n\nAll season long, I’ll be tracking the WNBA Odds for MVP, Finals Winner and more right here!\n\nAll odds and lines provided by DraftKings Sportsbook and are subject to change.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER (1-800-426-2537) (AZ/CO/DC/IA/IL/IN/KS/KY/LA/MD/ME/MI/NC/NJ/NH/OH/OR/PA/TN/VA/VT/WV/WY), (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY / text HOPENY (467369) (NY).\n\nPlease Gamble Responsibly. Call 1-888-789-7777 / visit ccpg.org (CT), or visit www.1800gambler.net (WV). Void where prohibited.\n\n21+ (18+ DC/KY/NH/WY). Physically present in AZ/CO/DC/CT/IL/IN/IA/KS/KY/LA(select parishes)/MA/MD/ME/MI/NC/NH/NJ/NY/OH/OR/PA/TN/VA/VT/WV/WY only. Void in ONT. Eligibility restrictions apply. See terms at draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS)."
  },
  {
    "source": "WNBA",
    "title": "WNBA Best Bets for September 5: Weekend Preview and WNBA Finals Odds",
    "url": "https://www.wnba.com/news/weekend-preview-and-wnba-champion-odds-september-5",
    "date": "2025-09-07",
    "text": "The 2025 WNBA regular season has officially entered its final week, with the playoff picture still simmering. Only Minnesota has locked in their spot at the top, while the race for the remaining seven remains wide open.\n\nThe postseason tips off on September 14, and two teams are heating up at exactly the right time: the Las Vegas Aces have surged to clinch a playoff berth behind an incredible 13-game winning streak, while the Phoenix Mercury are keeping pace, riding momentum into the postseason.\n\nLet’s take a look at the latest WNBA odds for the WNBA Finals, give a weekend preview, and I’ll share my best bets for Friday and Saturday’s games on DraftKings Sportsbook You can also find more WNBA previews, picks, and daily content on DraftKings Network.\n\n2025 WNBA Finals Odds\n\nThe Favorite: MIN Lynx (+120)\n\nThere hasn’t been much shake-up in the WNBA Finals market. Minnesota holds steady as the favorite at +120, leading the league at 32–9 with a comfortable cushion in the standings. Backed by the league’s top offensive and defensive ratings, the Lynx secured the No. 1 seed with authority and continue to prove their dominance by winning seven of their last 10 contests.\n\nWith Napheesa Collier anchoring their attack, a defense capable of shutting down any opponent, and the depth to wear teams down, Minnesota stands as the undeniable frontrunner to capture the championship.\n\nWNBA Best Bets and Weekend Preview\n\nLos Angeles Sparks at Atlanta Dream — Friday, September 5th, 7:30 PM ET\n\nWith the Atlanta Dream already locked into the postseason, all the pressure shifts to the Los Angeles Sparks on Friday. The Sparks have dropped five of their last 10 — including an 86–75 loss to Atlanta in their last matchup — and find themselves scrambling on the playoff bubble. In that game, Dearica Hamby dropped 21 points and nine boards while Kelsey Plum added 18 points and seven assists, but the Sparks couldn’t match the Dream’s depth. Rhyne Howard poured in 19, Brionna Jones notched her 12th double-double, and five Atlanta players finished in double figures.\n\nAtlanta brings the league’s second-best offensive rating into a matchup with Los Angeles’ shaky defense, ranked fourth-worst overall and prone to giving up clean looks from deep. Unless the Sparks find defensive consistency in a hurry, the Dream are poised to make it two straight, and I’m liking Howard to lead the charge from beyond the arc.\n\nLean: ATL -6.5\n\nPICK: Rhyne Howard Over 3.5 Three-Pointers Made (+135)\n\nNew York Liberty at Seattle Storm — Friday, September 5th, 10:00 PM ET\n\nIt’s been anything but smooth sailing for the Liberty this season, with injuries derailing the reigning champions and stars missing extended stretches — the latest setback being Sabrina Ionescu’s absence. Without her steady scoring presence, New York has dropped two straight, including a rough 66–58 loss to the Golden State Valkyries. While they’ve still officially clinched a playoff spot, the Liberty have their work cut out for them as the playoffs near.\n\nUp next is Seattle, a team that’s been wildly inconsistent down the stretch, beating Finals favorite Minnesota 93–79 one night, then coughing up a 17-point lead to fall 91–85 against Los Angeles two games later. If the Storm can close the season with back-to-back wins, they’ll hit the postseason at .500 and with momentum. However, to knock off New York, they’ll need a locked-in defensive effort and big outings from Skylar Diggins and Nneka Ogwumike to overcome the Liberty’s still-lethal attack, which ranks third in the league in offensive rating (105.6).\n\nLean: NY +2\n\nPICK: Nneka Ogwumike Over 17.5 Points (-120)\n\nPhoenix Mercury at Connecticut Sun — Saturday, September 6th, 1:00 PM\n\nThe Mercury are scorching right now. Winners of six straight, Phoenix finally has its big three, Satou Sabally, Kahleah Copper, and Alyssa Thomas, all healthy and rolling at the same time. Thomas has been nothing short of electric, racking up a league-record seven triple-doubles while stuffing the stat sheet on a nightly basis, and the Mercury’s surge has pushed them into the top three in the standings. Fresh off a 75–69 win over the Mystics, they head into Saturday with a prime chance to keep the streak alive against a fading Connecticut team.\n\nThe Sun are already out of the playoff picture, stuck near the bottom of the standings with the league’s worst offensive rating (96.2) and third-worst defensive rating (108.8). This is exactly the kind of matchup Phoenix should dominate, and with a playoff spot already locked up, I expect the Mercury to treat the rest of the season as chemistry and momentum building reps.\n\nPICK: PHO -10.5 (-110)\n\nAll season long, I’ll be tracking the WNBA Odds for MVP, Finals Winner and more right here!\n\nAll odds and lines provided by DraftKings Sportsbook and are subject to change.\n\nGAMBLING PROBLEM? CALL 1-800-GAMBLER (1-800-426-2537) (AZ/CO/DC/IA/IL/IN/KS/KY/LA/MD/ME/MI/NC/NJ/NH/OH/OR/PA/TN/VA/VT/WV/WY), (800) 327-5050 or visit gamblinghelplinema.org (MA). Call 877-8-HOPENY / text HOPENY (467369) (NY).\n\nPlease Gamble Responsibly. Call 1-888-789-7777 / visit ccpg.org (CT), or visit www.1800gambler.net (WV). Void where prohibited.\n\n21+ (18+ DC/KY/NH/WY). Physically present in AZ/CO/DC/CT/IL/IN/IA/KS/KY/LA(select parishes)/MA/MD/ME/MI/NC/NH/NJ/NY/OH/OR/PA/TN/VA/VT/WV/WY only. Void in ONT. Eligibility restrictions apply. See terms at draftkings.com/sportsbook. On behalf of Boot Hill Casino & Resort (KS)."
  },
  {
    "source": "WNBA",
    "title": "Players To Watch During the 2025 Stretch Run",
    "url": "https://www.wnba.com/news/players-to-watch-during-the-2025-stretch-run",
    "date": "2025-09-07",
    "text": "With just over three weeks remaining in the regular season, we take a look at one key player (sometimes two) from each team – some All-Stars and some X-factors – to keep an eye on as the stretch run heats up.\n\nTeams are listed in order of standings as of Aug. 18, 2025.\n\n1. Minnesota: Kayla McBride & Courtney Williams\n\nDespite losing the league’s top scorer and leading MVP candidate, Napheesa Collier, for the past two weeks (and no definitive timetable for a return), the Lynx have not missed a stride – winning all four games that Collier has missed. The key is Minnesota’s depth, led by its two other 2025 All-Stars. Williams has picked up her scoring (averaging a team-high 18.5 since Collier has been out), while McBride is shooting 46.9% from 3 in the month of August.\n\n2. Atlanta: Naz Hillmon\n\nOn a team with three All-Stars — Allisha Gray, Rhyne Howard and Brionna Jones — it’s a player that just entered the starting lineup in August that leads the team in point differential (+6.4). In fact, the Dream are 12.3 points per 100 possessions better when Hillmon is on court (+12.9 net rating) compared to when she’s off (+0.6 net rating). Gray is second on that list with a 6.5 pts per 100 poss differential.\n\n3. New York: Emma Meeseman\n\nSigned on Aug. 1 to help fill the void left by Breanna Stewart – who last played on July 26 and is projected to return near the end of August – the Liberty swapped in one former Finals MVP (Meesseman in 2019) for another (Stewart in 2018 and 2020). In her first seven games in New York, the Belgian center is averaging 15.3 points per game on 51.9% FG, 60% 3P and 90.5% FT shooting splits, along with 5.7 boards, 3.7 assists, a steal and a block in her first WNBA action since 2022 with Chicago.\n\n4. Phoenix: Alyssa Thomas\n\nAlyssa Thomas did not record a single triple-double in her first eight WNBA seasons combined. Her first came on July 22, 2022 and she’s added 19 more since – including five so far in her first season in Phoenix. Thomas has more triple-doubles in her first 28 games with the Mercury than any other player in WNBA history has for their entire career. Thomas’ ability to impact all facets of the game has lifted Phoenix to its first 20+ win season since 2018 and has the Mercury in the race for home-court advantage in the playoffs.\n\n5. Las Vegas: Jewell Loyd\n\nAs part of a three-team deal in February, the Aces acquired Jewell Loyd from Seattle, while sending Kelsey Plum to Los Angeles. After playing her first decade with the Storm, Loyd got off to a slow start in her first season in Las Vegas. However, she is currently playing her best ball of the season – coinciding with the Aces’ season-high seven-game win streak. Over eight games in August, Loyd is averaging 14.8 ppg on 45.9% shooting overall and 45.6% from 3-point range – providing a consistent perimeter scoring threat to complement A’ja Wilson’s work in the frontcourt.\n\n6. Indiana: Kelsey Mitchell\n\nWith Caitlin Clark limited to just 13 of Indiana’s 35 games due to three separate injuries, fellow guards Sydney Colson and Aari McDonald out for the season, and Sophie Cunningham leaving Sunday’s game with a knee injury, the Fever have shown their resilience to remain in the thick of the playoff hunt. A key reason is the play of Kelsey Mitchell, who erupted for a career-high-tying 38 points (34 coming in the 2nd half and OT) to lead the Fever to a franchise-record 21-point comeback on Sunday. Ironically, Mitchell’s two 38-point games have both come against Connecticut – six years apart.\n\n7. Golden State: Veronica Burton\n\nBurton arrived in the Bay with career averages of 5.5 points, 3.0 assists and 2.5 rebounds over her first three seasons in Dallas and Connecticut. In her first season with the Valkyries, Burton has thrived – averaging career-bests of 11.3 points, 5.1 assists, 4.3 rebounds and 38.2% shooting from beyond the arc. And she’s peaking at the right time. Burton has increased both her scoring and shooting percentage month over month all season, currently at 13.5 points on 48.6% shooting from deep over eight games in August, helping the Valkyries set the record for most wins by an expansion team in its inaugural season.\n\n8. Seattle: Brittney Sykes\n\nAcquired on Aug. 5 from Washington, Sykes is averaging 14.4 points, 3.4 assists and 1.6 steals in her first five games with the Storm. As Seattle pushes for a playoff berth, Sykes’ ability to impact the game on both ends of the court will be key to complement fellow All-Stars Skylar Diggins, Nneka Ogwumike and Gabby Williams. The Storm enter this week clinging to the eighth and final playoff berth, leading the No. 9 Sparks and No,. 10 Mystics by just a half-game each.\n\n9. Los Angeles: Kelsey Plum\n\nOnly one player in WNBA history has averaged at least 20 points and six assists over the course of a full season – Diana Taurasi during the 2013 season. Twelve years later, Plum is on pace to join Taurasi as she’s averaging 21.0 points and 6.6 assists – ranking third in the league in both categories – in her first season in Los Angeles. How important has Plum’s scoring been for the Sparks this season? L.A. is 12-9 when she scores 20+ points and 4-8 when she’s held below 20 points.\n\n10. Washington: Sonia Citron & Kiki Iriafen\n\nFollowing the Sykes trade, the burden of keeping the Mystics in playoff contention fell even more on Washington’s pair of All-Star rookies. Citron leads the Mystics in scoring (15.2 ppg, 17th in WNBA), while Iriafen leads the team in rebounding (8.5 rpg, 4th in WNBA). With five rookies on the roster and only two players – Alysha Clark (via the Sykes trade) and Stephanie Dolson – on the squad, the Mystics are building for the future. Getting Citron and Iriafen more experience this season will be key.\n\n11. Dallas: Paige Bueckers\n\nA leading candidate for Rookie of the Year honors, the No. 1 pick in the 2025 Draft is putting herself in historic company with her on-court play. Bueckers is one of only 15 rookies in WNBA history to average at least 18 points per game (she’s currently ninth at 19.8 ppg exactly. And she’s one of only two rookies – along with last year’s Rookie of the Year Caitlin Clark – to average at least 15 points and five assists in their debut season.\n\n12. Chicago: Ariel Atkins & Angel Reese\n\nHow important has Atkins been for Chicago? How about the fact that all eight of Chicago’s wins have come with Atkins on the court. The team is 0-7 in the games she’s missed in her first season in Chi-town after spending the first seven seasons – including the 2019 title run – in Washington. Meanwhile, Reese has appeared in only two of Chicago’s last dozen games due to a back injury, but is ramping up for a return. Despite appearing in only 23 games, Reese leads the W in double-doubles (17, tied with Thomas) and rebounds (12.6 rpg), while increasing her scoring, shooting, assists, steals and blocks over her rookie year.\n\n13. Connecticut: Aneesah Morrow & Saniya Rivers\n\nWith the Sun eliminated from playoff contention, Connecticut has 11 remaining games to continue to develop its young talent with an eye toward next year. In April, Connecticut chose Morrow (7th) and Rivers (8th) with first round picks as the team began a new chapter in 2025. Morrow ranks 2nd among rookies and 18th in the WNBA with 6.2 rebounds per game (along with 7.4 ppg), while Rivers ranks 2nd among rookies and tied for 6th in the WNBA with 1.6 steals per game (along with 8.1 ppg)."
  },
  {
    "source": "WNBA",
    "title": "Power Rankings Archive",
    "url": "https://www.wnba.com/news/category/power-rankings",
    "date": "2025-09-07",
    "text": "2025 WNBA Power Rankings: Week 7 - Part Two\n\nWith each team set to reach or pass the midway point of the season this week, let’s take a look at how the teams stack up against one another.\n\nJul 14, 2025"
  },
  {
    "source": "WNBA",
    "title": "Angel Reese Suspended After Reaching Technical Foul Limit",
    "url": "https://www.wnba.com/news/angel-reese-technical-foul-suspension",
    "date": "2025-09-07",
    "text": "NEW YORK, Sept. 4, 2025 – Chicago Sky forward Angel Reese has been suspended one game after receiving her eighth technical foul of the 2025 season, the WNBA announced today.\n\nUnder WNBA rules, a player or coach is automatically suspended without pay for one game upon receiving an eighth technical foul during the regular season. For every two additional technical fouls received during that regular season, the player or coach will be automatically suspended for an additional game.\n\nReese incurred her eighth technical foul with 0:46 remaining in the second quarter during Wednesday’s game versus the Connecticut Sun. She will serve her suspension on September 5, when the Sky visits the Indiana Fever.\n\n# # #"
  },
  {
    "source": "WNBA",
    "title": "Players To Watch Over The Season’s Final Two Weeks",
    "url": "https://www.wnba.com/news/players-to-watch-final-two-weeks-2025",
    "date": "2025-09-07",
    "text": "With less than two weeks remaining in the regular season, every game takes on added importance when it comes to reaching the postseason and securing playoff position.\n\nWe continue our series of players to watch with another mix of superstars and x-factors that will help determine their team’s fate.\n\nStats, rankings and standings through games played on Aug. 28, 2025\n\n1. Minnesota: Alanna Smith & DiJonai Carrington\n\nDespite Thursday’s loss to Seattle, the Lynx remain on track to lock up the No. 1 overall seed in the playoffs. Napheesa Collier’s return from an ankle injury is huge, as is the play of fellow All-Stars Kayla McBride and Courtney Williams (who we highlighted last week). Two more key players on this deep squad are starting center Alanna Smith and newcomer DiJonai Carrington off the bench. Both were All-Defensive Team selections last season (Smith alongside Collier in Minny, while Carrington was in Connecticut) and have helped the Lynx to a league’s best 97.7 defensive rating. Smith joins Las Vegas’ A’ja Wilson as the only players averaging 2+ blocks and 1+ steals this season.\n\n2. Las Vegas: A’ja Wilson\n\nThe reigning MVP is making a run for her fourth such honor with a post All-Star tear that has coincided with Vegas’ 12-game win streak to race up the standings. Wilson and the Aces are off until next Thursday when they host the Lynx in a clash of the top two teams in the standings and the top two scorers in the league. Wilson is averaging 26.8 points with six 30+ point games during Las Vegas’ win streak, boosting her season average to 23.4 ppg, just 0.2 ppg behind Collier in the race for the scoring title. Wilson also ranks second in rebounding (10.1), first in blocks (2.2) and eighth in steals (1.6).\n\n3. Atlanta: Allisha Gray\n\nNo player in the WNBA has played more total minutes this season than Gray’s 1,337. The ironwoman has appeared in all 38 of Atlanta’s games (after playing all 40 last season). Only two players have splashed more 3-pointers than Gray’s 92 as the 3-time All-Star is averaging a career-best 2.4 triples per game on 38.8% shooting – her highest mark in three seasons with the Dream and second-highest in her nine-year career. She’s on pace to set career-best marks in points (18.7), rebounds (5.4) and assists (3.6) and has Atlanta in contention for a top-four playoff berth.\n\n4. Phoenix: Kahleah Copper & Satou Sabally\n\nCopper played only five games in June after missing the first month of the season with a knee injury. She played only five games in July due to a rib injury. In August, she has played 12 games, averaging 16.7 ppg, including Thursday’s 28-point performance against Chicago. As for Sabally, who is averaging a team-high 16.7 ppg – keep an eye on her points column. When she scores over 15 points, the Mercury are 11-4 this season, compared to 9-9 when she scores 15 or less.\n\n5. New York: Breanna Stewart\n\nAfter missing a month with a bone bruise in her right knee that cost her 13 games, Stewart returned to the court this past week. With a minutes restriction keeping her under 25 minutes in her first two games back, Stewart still averaged 15.5 points and seven rebounds in a pair of New York wins. How will her knee respond to an increase in minutes and an increase in pressure once the Liberty begin their title defense in the postseason? With key members of the roster out – Sabrina Ionescu (toe), Jonquel Jones (illness), Natasha Cloud (nose) and Nyara Sabally – can Stewart and the rest of the Liberty maintain their playoff position over these closing weeks?\n\n6. Indiana: Aliyah Boston & Odyssey Sims\n\nIn Tuesday’s win, the Fever got 20+ point games from Boston, Sims and Kelsey Mitchell (who we discussed last week) as Indy avoided a three-game skid. Boston has been a constant for the Fever – a top 20 scorer, a top 10 rebounder and shot blocker – while racking up the 4th most double-doubles in the league (15). Sims, on the other hand, has had to strike fast. Working on her third 7-day contract with a Fever team ravaged by guard injuries, Sims has averaged 9.8 points, 4.2 assists and 38.5% 3-point shooting over six games, with a top-20 assist/turnover ratio (2.48), giving the Fever a veteran presence in the backcourt.\n\n7. Seattle: Gabby Williams\n\nIn Thursday’s comeback win over the Lynx, Williams put up 16 points, four rebounds, three assists, two blocks, one steal and four 3-pointers in 30 minutes. It was the type of stuff-the-box-score performance that earned Williams the nickname “French Army Knife” from her head coach Noelle Quinn. The All-Star’s versatility can be seen in her season averages – 12.0 ppg, 4.3 rpg, 4.3 apg and 2.3 spg – marks that have only been hit by two other players in WNBA history: Tamika Catchings in 2007 and Angel McCoughtry in 2013. And neither of them averaged Williams’ 1.2 3-pointers per game.\n\n8. Golden State: Tiffany Hayes & Iliana Rupert\n\nAlready wearing a mask to protect a broken nose, Hayes went down with a knee injury during a collision with Phoenix’s Kahleah Copper last week. She’s listed as day-to-day with seven games to play. Her return will be critical as Golden State finds itself in a four-team battle for the final three spots in the playoff picture. With the Valkyries potentially making history as the first WNBA expansion franchise to reach the playoffs, getting Hayes back on court, and continued production and shooting from Rupert will be key. Rupert – a 6-foot-4 center from France, is the WNBA leader in 3-point percentage (31-of-67, 46.3%), giving Golden State a proven stretch five.\n\n9. Los Angeles: Dearica Hamby & Azurá Stevens\n\nWhen looking at this year’s season leaders across seven key categories – averages in points, rebounds, assists, steals and blocks, as well as field goal percentage and 3-point percentage – only seven players appear in the top 10 in at least three categories:\n\n5 Categories: Napheesa Collier\n\n4 Categories: A’ja Wilson, Alyssa Thomas, Dearica Hamby\n\n3 Categories: Aliyah Boston, Paige Bueckers, Azurá Stevens\n\nTwo of those seven players – and the only teammates on this list – are Hamby (18,1 PPG, 7.8 RPG, 1.6 SPG, 57.5 FG%) and Stevens (7.8 RPG, 1.1 BPG, 41.0 3P%) – who have both used their diverse talents to keep the Sparks in the hunt for a playoff berth.\n\n10. Washington: Shakira Austin\n\nOn Sunday, Austin put up a career-best 30 points (10-15 FG, 10-10 FT) with five boards and four blocks, but her effort was thwarted by Nneka Ogwumike’s game-winning buzzer-beater for Seattle. In her fourth season after being selected 3rd overall in 2022, Austin’s scoring has risen each year, up to this season’s 12.9 ppg to go with 6.4 rebounds, 1.8 assists, 1.2 steals and 1.1 blocks. Can Austin help Washington snap its five-game losing streak and avoid playoff elimination this weekend when the Mystics visit Golden State and Los Angeles?\n\n11. Connecticut: Tina Charles & Marina Mabrey\n\nLast week, we highlighted a pair of promising rookies for the Sun. This week, it’s time to show some love to the vets. Tina Charles enters the weekend needing 19 field goals to pass Diana Taurasi (3,341) for the most in WNBA history. Averaging 5.9 buckets per game, Charles is on pace to break the record in four games. Meanwhile, Mabrey has been key to Connecticut’s late season resurgence. The Sun are 7-9 since she returned from injury on July 24 after going 3-19 prior.\n\n12. Chicago: Kamilla Cardoso\n\nAfter discussing Angel Reese last week, it’s time to add Cardoso to the watch list. I’m particularly intrigued by watching more of Cardoso and Reese sharing the court and playing off one another. So far this season, Cardoso has assisted Reese 18 times, while Reese has returned the favor 23 times. While Chicago has been eliminated from the playoffs, the development of this front line tandem is key to the Sky’s future success.\n\n13. Dallas: Maddy Siegrist\n\nWith eight players listed on the injury report ahead of Friday’s game in Atlanta, Siegrist will have the opportunity to build on her already career-best numbers — 12.2 ppg, 4.5 rpg, 0.6 steals, 0.6 blocks — when the Wings face the Dream. Siegrist, the third overall pick in the 2023 Draft, is averaging 15.3 points on 56.2% shooting over 10 games in August. Can she close out the month strong as the season winds down?"
  },
  {
    "source": "WNBA",
    "title": "Betting + Odds Archive",
    "url": "https://www.wnba.com/news/category/betting",
    "date": "2025-09-07",
    "text": "WNBA Best Bets for August 29: Weekend Preview and WNBA Finals Odds\n\nThe 2025 WNBA regular season is in its final stretch, and the competition is HOT! Check out the best bets and odds ahead of the weekend.\n\nAug 29, 2025"
  },
  {
    "source": "WNBA",
    "title": "2025 WNBA Power Rankings: Week 12",
    "url": "https://www.wnba.com/news/2025-wnba-power-rankings-week-12",
    "date": "2025-09-07",
    "text": "The stage is set for a thrilling finish to the 2025 regular season with playoff spots and positioning on the line in just about every single game over the final two-plus weeks.\n\nFor this week’s rankings, we’re breaking down the field into four groups – each one representing a different race for the teams included.\n\nGroup 1: Race to clinch No. 1 overall seed\n\nThe smallest of these groups belongs solely to the Lynx, who have a magic number of two (Lynx wins or Dream losses) to clinch the No. 1 overall seed and home-court advantage throughout the playoffs. How important is home-court? The Lynx are 18-1 at Target Center this season.\n\n1. Minnesota Lynx (30-7)\n\nLast Week: 1 ↔️\n\nThis Week: Thur. vs. SEA, Sat. at CON\n\nThe Lynx opened the week with their first consecutive losses of the season – falling at New York and Atlanta – before bouncing back by sweeping a home-and-home with Indiana. Sunday’s game marked the return of Napheesa Collier, who dropped 32 points in her first game after missing three weeks with an ankle injury. Minnesota went 5-2 without the league’s leading scorer and MVP candidate.\n\nGroup 2: Race for home-court advantage in First Round\n\nNext up, we have four teams – the Aces, Dream, Mercury and Liberty – separated by just two games and all seeking a top-four finish in order to secure home-court in the opening round of the playoffs.\n\n2. Las Vegas Aces (24-14)\n\nLast Week: 3 ⬆️\n\nThis Week: Mon. at CHI, Wed. at ATL\n\nNo team in the league is hotter than the Aces, who won their 10th straight game on Saturday – marking the longest win streak of the Vegas era and the second longest in franchise history (12 by the 2012 Silver Stars). The eighth win of this streak came against the Dream as the Aces rallied back from 10 down in the fourth quarter to clinch the head-to-head tiebreaker (lead season series 2-0 with one game to play). Vegas also holds the tiebreaker over Phoenix, but not New York.\n\n3. Atlanta Dream (24-13)\n\nLast Week: 2 ⬇️\n\nThis Week: Wed. vs. LVA, Fri. vs. DAL\n\nWith only 13 losses on the season – second only to Minnesota – the Dream control their own destiny down the stretch. If they win out, they’ll be the No. 2 seed (assuming Minnesota doesn’t collapse). Atlanta has won nine of its last 11 games with its only loss this week coming at the hands of red-hot Las Vegas. The Dream will look to avenge that loss on Wednesday when they host the Aces in their final meeting of the regular season. While Atlanta does not have the tiebreaker with Vegas, they do hold it over Phoenix and split its season series with New York.\n\n4. Phoenix Mercury (22-14)\n\nLast Week: 5 ⬆️\n\nThis Week: Tue. at LAS, Thur. vs. CHI, Sat. vs. NYL\n\nThis month, Phoenix has gone 0-4 against Las Vegas and Atlanta, but 6-0 against all other teams. However, dropping two games apiece to the Aces and Dream means that the Mercury lost the head-to-head tiebreakers with both teams, which could hurt them if the race remains this tight down the stretch. Phoenix leads its season series with New York (2-1) and can clinch that tiebreaker in their final meeting on Saturday.\n\n5. New York Liberty (22-15)\n\nLast Week: 4 ⬇️\n\nThis Week: Mon. vs. CON, Thur. vs. WAS, Sat. at PHX\n\nThe Liberty are 2-5 in their last seven games and 5-9 since losing Breanna Stewart to a bone bruise in her knee on July 26 (I’m including that game in the record since Stewart only played three minutes). Stewart isn’t the only player the Liberty are missing. Nyara Sabally (knee) remains out for likely another week, while Sabrina Ionescu (foot), Natasha Cloud (nose) and Isabelle Harrison (concussion) are all listed as questionable for Monday’s game against the suddenly-scorching Sun. Saturday’s game at Phoenix is one to watch as NY can clinch the head-to-head tiebreaker with a win, giving the Liberty two tiebreakers (also over Vegas) in this group.\n\nGroup 3: Race for final three playoff spots\n\nNext up, we have five teams still in the mix for the final three playoff berths, including four teams – the Storm, Valkyries, Fever and Sparks – all with exactly 18 losses entering this week. The Mystics are still alive, but sit four losses behind this group’s lead pack.\n\n6. Seattle Storm (20-18)\n\nLast Week: 9 ⬆️\n\nThis Week: Tue. at IND, Thur. at MIN, Sat. vs. CHI\n\nNneka Ogwumike came through in the clutch on Sunday, knocking down a15-foot fadeaway at the buzzer to seal Seattle’s third straight win and fourth in the last five games as the Storm have bounced back from a six-game losing streak to open August. Can the Storm keep rolling with three teams right on their heels? They’ll have to since Seattle will not hold any head-to-head tiebreakers over this field – Seattle lost its season series with Indiana and must beat Golden State and L.A. in order to even those two series.\n\n7. Golden State Valkyries (19-18)\n\nLast Week: 6 ⬇️\n\nThis Week: Sat. vs. WAS, Sun vs. IND\n\nThere have only been eight games in WNBA history with a player racking up 24+ points and 13+ assists – Veronica Burton has two of those games in Golden State’s last three outings. Sunday’s win at Dallas snapped a three-game slide for the Valkyries, who remain in the hunt to become the first WNBA expansion team to qualify for the playoffs in their inaugural season. Golden State has tiebreakers on its side, locking up the head-to-head edge over Indiana and Los Angeles and leading Seattle (2-1) with one game to play.\n\n8. Indiana Fever (19-18)\n\nLast Week: 7 ⬇️\n\nThis Week: Tue. vs. SEA, Fri. at LAS, Sun. at GSV\n\nThis is an important week for the Fever as they face each of the other three teams that open the season’s penultimate week with 18 losses – hosting Seattle on Tuesday before a California road trip to face the Sparks on Friday and Valkyries on Sunday. The Fever enter this crucial point of the schedule having gone just 2-6 in their last eight games following a season-best five-game win streak. As injuries continue to ravage the team – Sophie Cunningham is the latest to be lost for the season – can the Fever fight their way to a top-eight finish? When it comes to tiebreakers, Indy holds it over Seattle, but lost its season series to both L.A. and Golden State.\n\n9. Los Angeles Sparks (17-18)\n\nLast Week: 8 ⬇️\n\nThis Week: Tue. vs. PHX, Fri. vs. IND, Sun. vs. WAS\n\nFrom July 13-Aug. 7, the Sparks went on a run of eight wins over a nine-game span, with win streaks of five and three games. Since then, they have not been able to string together back-to-back wins as they have alternated wins and losses over each of their past six games. In such a tight playoff race, a timely win streak can make all the difference. Coming off a Kelsey Plum game-winner in their only game last week, can the Sparks make it two straight when they host the Mercury on Tuesday? In terms of tiebreakers, the Sparks hold it over the Fever and lead the Storm (2-1 with one game to play), but lost to the Valkyries.\n\n10. Washington Mystics (16-22)\n\nLast Week: 10 ↔️\n\nThis Week: Thur. at NYL, Sat. at GSV, Sun. at LAS\n\nResults: L vs. CON 80-69, L at CON 67-56, L vs. LVA 91-81, L vs. SEA 84-82\n\nNotes: lost 4 straight, in danger of playoff elimination\n\nJust like a timely win streak can boost a team during a tight playoff race, an untimely losing streak can be a damaging blow to a team’s playoff hopes. Case in point – the Mystics – who have dropped four straight games to fall four losses behind the pack in the race for the final three playoff spots. Washington has no margin for error down the stretch, including a pair of must-win road games this week at Golden State and Los Angeles.\n\nGroup 4: Officially out of playoff contention\n\nThree teams – the Sun, Sky and Wings – have been mathematically eliminated from postseason contention with two weeks to play. With each roster featuring young talent, these final games can be useful tools for player development that can carry over to next season.\n\n11. Connecticut Sun (9-27)\n\nLast Week: 13 ⬆️\n\nThis Week: Mon. at NYL, Wed. at DAL, Sat. vs. MIN\n\nResults: W at WAS 80-69, W vs. WAS 67-56, W at CHI 94-84\n\nNotes: won 3 straight, 1st win streak of season, 6-8 since ASG\n\nThe Sun enter this week riding their first win streak of the season – having strung together three straight victories over the Mystics (twice) and Sky. Leading the way during the streak has been Tina Charles (19.0 ppg, 8.3 rpg), Saniya Rivers (12.3 ppg, 1.7 spg) and Marina Mabrey (12.0 ppg, 5.0 apg). Overall, the Sun are 6-8 since All-Star compared to 3-19 prior to the break.\n\n12. Chicago Sky (9-27)\n\nLast Week: 12 ↔️\n\nThis Week: Mon vs. LVA, Thur. at PHX, Sat. at SEA\n\nA pair of 20/10 games from Kamila Cardoso (22 pts, career-high 16 reb) and Angel Reese (21 pts, 10 reb) helped the Sky top the Liberty in Brooklyn to snap a five-game losing streak. The Sky open the week hosting the red-hot Aces in the first of three matchups over a 15-day span.\n\n13. Dallas Wings (9-29)\n\nLast Week: 11 ⬇️\n\nThis Week: Wed. vs. CON, Fri. at ATL\n\nThe Wings have dropped five straight and 10 of their last 11 games to fall to the bottom of the standings this week. Wednesday’s loss to the Sparks saw Kelsey Plum hit a game-winner to spoil Paige Bueckers’ brilliant 44-point effort – the most points scored in any WNBA game this season and the most ever scored by a rookie in league history. Things don’t get any easier as Dallas faces one of the most difficult remaining schedules, with five of their final six games coming against teams in the playoff hunt. The other? Wednesday against the suddenly-hot Connecticut Sun."
  }
]